{"inkVersion":18,"root":[["^[player:5da4b3ff:audio/voices/","\n","^[kari:a88533ff:audio/voices/","\n","^[mom:9b67a7ff:audio/voices/","\n","^[dad:677b46ff:audio/voices/","\n","^[grandpa:ae2a19ff:audio/voices/","\n","^[audie:ef8100ff:audio/voices/","\n","^[brynja:df48c1ff:audio/voices/","\n","^[asta:156546ff:audio/voices/","\n","^BEGIN","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n",{"->":"start"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"start":[{"->":"beginning"},{"#f":3}],"beginning":[[{"#":"s_act1/Audio/waves"},{"#":"s_act1/Audio/WAVESMENUSPROLOGUE_m"},{"#":"v_prologue/prologueArt"},"^Alex found a nook in the ferry where she couldn't see the water. Even though her dad told her that being inside would only make her more seasick, she preferred it to being on the deck. Looking at the coast of rural Iceland just made Alex want to go home.","\n","^She wished her parents hadn't come from a town so far away, and her stomach churned thinking about how much more time she'll have to spend in the rental car before arriving at her Grandfather's house. At least here it was quiet, and she could draw until her mother found her.","\n","^:mom:\"Jesus, Alex, what are you doing down here? I can barely breathe with all these fumes, and - if a brake malfunctions? A car could start rolling and run you over. Get your head out of your notebook.\":","\n","^Alex's mom took away her journal and pencils.","\n","^:mom:\"Listen to me, Alex. I know you don't know much about where we're going, but that's why you have to trust me, and do exactly what I say. No running off. Just be good for two days, and then we leave. Understand?\":","\n",["ev",{"^->":"beginning.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Alex nodded yes.",{"->":"$r","var":true},null]}],["ev",{"^->":"beginning.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Alex rolled her eyes. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"beginning.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["ev",{"^->":"beginning.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"^ Her mom scoffed before saying, ","<>","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom:\"Come back up to the deck with me.\":","\n","ev","str","^go up","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^Alex and her mom walked onto the deck and found her father.","\n","^:mom:\"Einar. She was hiding with the cars,\": she said.","\n","^Dad frowned.","\n","^:dad:\"I'm sorry, I told her not to move from the bench... Why would you do that, Alex?\":","\n","ev","str","^Alex tried to explain herself","/str","/ev",{"*":".^.c-3","flg":20},["ev",{"^->":"beginning.0.g-1.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^Alex kept quiet. ",{"->":"$r","var":true},null]}],{"c-3":["^ Alex tried to explain herself. :player:\"I wanted to draw,\": she said. Mom gave dad an angry look, and he started to relay what they both knew would sound better coming from him.","\n","^:dad:\"I understand, but I told you to draw on the bench. Look, until the end of the trip, you can only draw in the car. Otherwise, you have to pay attention, krútt. I need you to talk to me, and I promise this trip will pass by fast.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["ev",{"^->":"beginning.0.g-1.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","^Dad looked at Mom, and then started to relay what they both knew would sound better coming from him.","\n","^:dad:\"Look, until the end of the trip, you can only draw in the car. Otherwise, you have to pay attention, krútt. I need you to talk to me, and I promise this trip will pass by fast.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Not quite satisfied but too anxious to continue, Mom stepped away to smoke a cigarette. Dad started to say something to her, then decided against it.","\n","^:dad:\"Are you excited to meet your cousin?\":","\n",["ev",{"^->":"beginning.0.g-2.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^Alex answered yes. ",{"->":"$r","var":true},null]}],["ev",{"^->":"beginning.0.g-2.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":18},{"s":["^Alex answered no.",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"beginning.0.g-2.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^:player:\"I think so,\": she said.","\n","^:dad:\"I definitely am.\" dad He was born after your mom and I moved away, but his mother was a great woman. He's two years younger than you, but I think you two will get along really well.\":","\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-6":["ev",{"^->":"beginning.0.g-2.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^:player:\"Not really. I don't know what he is like,\": she said.","\n","^:dad:\"To tell you the truth, I don't know either. He was born after your mother and I moved away, so I've never met him. But he's family, so we ought to give him a chance, right? His mother was a great woman. I bet you two will get along famously.\":","\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":[{"->":"ACT1"},{"#f":7}]}],{"#f":3}],"ACT1":[{"->":"town"},{"#f":3}],"town":[{"->":".^.intro"},{"intro":[[{"#":"check_act1"},{"#":"s_stop"},{"#":"v_act1/dock"},"^The ferry pulled into the harbor and Alex's family drove off in their rental car. The town of Fjallvík is small, it takes less than five minutes to drive slowly to its limits. On the way Alex noticed a fish market, a school house, and a general store, along with some tour advertisements for hiking, skiing, horse stables, and fishing.","\n","ev","str","^Alex sat in silence","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex started sketching","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad:\"When I was a kid, there wasn't anything here except for a small dock that your grandfather built. I would go out fishing with him every morning and sell what we caught at the market back across the bay in Dalvík.","\n","ev","str","^Alex drew","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex looked at the floor","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex stared out the window","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:dad:\"Now there are lots of tourists coming to see the mountains. They're even developing the area for skiing. My father lives in town here. After dinner we'll go to their place to stay the night.\":","\n","ev","str","^cool","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":[{"->":"arrival"},{"#f":7}]}],{"#f":3}],"#f":3}],"arrival":[["^Alex spent the next fourty minutes managing her nausea as her father drove them through vast expanses of completely empty land - a tunnel burrowed through the snowy grey mountains behind the port to reveal a wide green valley with no civilization in sight.  Eventually, Alex's family pulled up to a small house. An old man who Alex knew must be her grandfather stood out front.","\n",{"#":"v_act1/outsideHouseFirst"},"^:mom:\"Don't bring anything out of the car, Alex.\":","\n","^Her parents got out of the car, and to prove a point Alex waited for her mother's approval to follow. Grandfather shook dad's hand, and then him and Mom looked at eachother and said a few words. Alex watched intently. Grandfather gestured towards her, and mom motioned for her to come out of the car.","\n","ev","str","^Alex got out of the car","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex refused to get out of the car","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Alex got out of the car and walked to the house, getting a better look at him - she realized that were her Grandfather not hunched over a cane he would be an enormously tall man. Even like this he was a very imposing figure, but Alex couldn't get a read on his expression. It was the kind of resting frown many old men have but there was something so relaxed about him that Alex felt even more small. ","\n","^To his right, she realized, was her younger cousin, hiding behind her grandfather's legs. Alex estimated the boy was around two years younger than her. He stared at her, mesmerized.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ Alex refused to get out of the car, and slowly her mom walked over to her. Suddenly, she jerked the door open. Alex flinched, but when she looked up her mom was just staring at the ground. Alex slid out of the back seat and walked to the porch, Fjola following behind.","\n","^Alex got out of the car and walked to the house, getting a better look at her Grandfather - she realized that were he not hunched over a cane he would be an enormously tall man. Even like this he was a very imposing figure, but Alex couldn't get a read on his expression. It was the kind of resting frown many old men have but there was something so relaxed about him that Alex felt even more small.","\n","^To his right was Alex's younger cousin, a boy Alex estimated was around two years younger than her. He beamed at her, mesmerized.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandfather spoke to Alex in English, finding his way slowly through the words-","\n","^:grandpa: \"So you are the one I've waited so long to meet. You look just like your mother.\":","\n","^They all stood there while Alex's Grandfather eyed her up and down. Fjola didn't take her eyes off him.","\n","^:grandpa:\"My name is Jorgur, little one. I'm thrilled you are here. Kari, introduce yourself.\":","\n","^Kari spoke deliberately. Alex assumed he was nervous.","\n","^:kari:\"Hello cousin, my name is Kari. It is good to meet you.\":","\n","^:grandpa:\"Very good. Come inside, everyone.\":","\n","ev","str","^Alex followed","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex introduced herself to her cousin","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["^ ",{"->":"intro_livingroom"},"\n",{"#f":7}],"c-3":["\n","^Alex decided to introduce herself to her cousin.","\n","^:player:\"Hey, I'm Alex,\": she said. Kari lowered his voice.","\n","^:kari:\"Hey! It's so amazing to meet you. Wow, okay, come inside!\":","\n",["ev","str","^Alex followed","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Alex followed Kari in.","\n",{"->":"intro_livingroom"},{"#f":7}]}],{"#f":7}],"#f":7}]}],{"#f":3}],"intro_livingroom":[[{"#":"v_act1/homeInterior"},"^Jorgur walked into the house and took a seat.","\n","^:grandpa:\"Welcome back.\":","\n","^:dad:\"Wow, it hasn't changed at all,\": Dad said.","\n","^:grandpa:\"Kari, show your cousin around the house.\":","\n","^Kari's head shoots down towards his feet.","\n","^:kari:\"Yes, grandfather.\": He looks at you.","\n","^:kari:\"Cousin, follow me upstairs?\":","\n",["ev",{"^->":"intro_livingroom.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go upstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"intro_livingroom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n",{"->":"intro_upstairs"},{"#f":7}]}],{"#f":3}],"intro_upstairs":[[{"#":"v_act1/bedroom"},{"#":"s_audio/FootStep(Inside)_s"},["^:kari:\"...and this is my room! What do you think?\":","\n","^Alex stepped into her cousin's room. There were drawings scattered everywhere, on almost every surface. Alex had wished her parents would let her keep her room like this, but seeing it for herself she started to understand why they made her keep clean. Looking closer, Alex realized that almost all the drawings were of the same four creatures over and over - what looked to be a dragon, a bird, a bull, and a giant.","\n","ev","str","^It's nice","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Weird drawings","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Boring","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"It's a nice room. I like your drawings.\":","\n","^:kari:\"Thank you! Drawing is my favorite. Grandpa likes them too. He says I could be a famous artist one day. Here, I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player:\"Your drawings are funny.\":","\n","^:kari:\"You think so? Drawing is my favorite. Grandpa likes them too. He says I could be a famous artist one day. Here, I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["^ :player:\"There's nothing in it except your drawings.\":","\n","^:kari:\"Drawing is my favorite. Grandpa likes them too. He says I could be a famous artist one day. Here, I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^He handed Alex a crude drawing of a whale swimming towards an island with the four creatures on it.","\n","ev",1,"/ev",{"temp=":"has_drawing","re":true},"ev","str","^Alex thanked him","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex smiled awkwardly","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["^ Alex thanked Kari for the drawing. She wasn't sure what this meant, but she wanted to be polite. ","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["^ Alex smiled awkwardly. She wasn't sure what this meant, exactly.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Kari shifted a bit as he prepared to explain.","\n","^:kari:\"So this is - wait, um, do you speak Icelandic?\":","\n","^:player:\"A bit, but... not really,\": Alex admitted.","\n","^:kari:\"Oh! That's okay. So... this is a drawing of the four landvættir. I love to draw them. They are spirits that protect the land, and help the people who live with them. There are many different wights but these four are the most important.\":","\n","ev","str","^Alex remembered the story","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^Alex started to remember the story her father had told her once when she was very little. :player:\"And an evil king sent his wizard to attack Iceland in the form of a whale?\":","\n","^:kari:\"Yes!\": Kari replied. :kari:\"Wow... I am so happy you know the story.\":","\n","^Kari lowered his voice. :kari:\"Listen Alex, I need to tell you something. There are not any wights around this house anymore. They were driven away from here, but Grandpa says drawing them is a good way to pay tribute and invite them. I like to hang my drawings on the clothesline for them to see. I sit by the window and watch them move in the wind like they are here protecting us, and soon they will come. Would you like to draw landvættir with me?\":","\n",["ev",{"^->":"intro_upstairs.0.g-3.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":18},{"s":["^Alex accepted.",{"->":"$r","var":true},null]}],{"c-6":["ev",{"^->":"intro_upstairs.0.g-3.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":7}],"#f":7}],"g-4":["^Kari got Alex some charcoal and paper and the two cousins started to draw.","\n","ev","str","^Alex started with the dragon","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Alex started with the bird","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Alex started with the giant","/str","/ev",{"*":".^.c-9","flg":20},{"c-7":["^ Alex started by drawing the dragon wight.","\n","^:kari:\"Ooh, that's good! The dragon is super cool - it guards the east side of Iceland with other lizards and worms and snakes.\":","\n","ev",1,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"c-8":["^ Alex started by drawing the bird wight.","\n","^:kari:\"Ooh, that's good! The bird is super amazing - it guards the north side of Iceland with many other birds, great and small.\":","\n","ev",2,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"c-9":["^ Alex started by drawing the giant wight.","\n","^:kari:\"Ooh, that's good! The giant is super cool - he guards the south side of Iceland with many other jötnar.\":","\n","ev",4,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"#f":7}],"g-5":[{"->":".^.^.^.drawingConvo"},{"#f":7}]}],{"drawingConvo":[["ev","str","^Alex complimented Kari's drawing","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex asked his favorite wight","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Some time passed as they drew together.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ Alex complimented Kari's drawing. :player:\"Your cow is really cool too.\":","\n","^Kari giggled at this. :kari:\"It's not a cow, it's a bull! The bull is HUGE, and he wades into the water to the west and bellows out at the whale, with all the land wights behind him!\": At this, Kari jumped up and made the biggest roar he could - until he started coughing and collapsed onto the floor in a laughing fit. Alex tried to imagine a bull making a sound anything like this hyper little boy, and she started laughing along with him.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"Which is your favorite wight, Kari?\":","\n","^:kari:\"Ooh, that's hard. I think probably the bird. The birds can go anywhere they want.\":","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["\n",{"->":".^.^.^.^.predinner"},{"#f":7}]}],{"#f":3}],"predinner":[["^Some time passed as the pair studiously drew creatures of all sorts.","\n","^:kari:\"Hey Alex, what do you think of my English? I learn at school but Grandpa never allows me to use it. It is always so funny to hear him try it! He hates having to talk in English.\":","\n",{"#":"v_enter_act1/fadedDAD"},"^Before Alex could respond, her dad entered the room. :dad:\"Dinner is ready, kids, come downstairs as soon as you can.\":","\n","^:kari:\"Coming!\": Kari cheerfully replied.","\n",["ev",{"^->":"intro_upstairs.predinner.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go downstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^I:J,3:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"intro_upstairs.predinner.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],{"->":"dinner"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"dinner":[[{"#":"v_exit"},{"#":"v_act1/homeInterior"},{"#":"s_audio/FootStep(Inside)_s"},"^Alex walked downstairs and Jorgur instructed everyone bring their bowl up to the counter. He ladled out fish stew and hunks of bread. Alex still felt sort of sick from traveling, and the strong odor was unappetizing.","\n","ev","str","^Alex took a seat","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Alex took a seat at the small dinner table next to her cousin. The room fell silent for a moment as everyone started to eat. Finally, Einar decided to speak up.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad: \"Ólafur, I'm so sorry about Fjola. We all know how much she meant to you.\":","\n","^Grandpa looked at his plate. :grandpa:\"She was a wonderful woman. It would make her happy to know you all came to send her off. She loved you dearly.\":","\n","ev","str","^Alex ate her bread","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex tried the stew","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex didn't eat","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^It's cold","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^It's beautiful","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^It's alright I guess","/str","/ev",{"*":".^.c-6","flg":20},{"c-1":["^ Alex ate her bread, which was somewhat stale.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["^ Alex tried the stew, which was thin but warmed her up.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ Alex decided not to eat.","\n","^Mom looked at Grandpa. :mom:\"We're only staying here for two days. After the funeral, we have to leave.\":","\n","^Grandpa frowned at this. :grandpa: \"Of course, of course.\":","\n","^After a moment, he turned to look at Alex and asked, :grandpa:\"What do you think of Iceland so far, little one?\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["^ Grandpa laughed. :grandpa:\"You'll adjust to it soon! The Icelandic blood in you will come to the fore, you'll see right away.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-5":["^ Grandpa smiled. :grandpa:\"Why that's wonderful. I'm glad to hear it. This is the home of your forefathers, it is right for you to respect it.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-6":["^ Grandpa smiled. :grandpa:\"You'll see, we'll show you a wonderful time here, isn't that right, Kari?\": Kari nodded in return. :kari:\"Yes, grandfather!\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^Alex finished her dinner and was instructed to place her dish in the sink.","\n","^:grandpa:\"Kari, go play outside with Alex. Don't go too far.\":","\n","^Kari nodded. :kari:\"Yes, grandfather!\": he said. \"I know exactly what to show her.\": Kari and Alex started getting on their shoes when Fjola spoke up.","\n","^:mom:\"Hold on, Alex. I think it's time for us to leave. We really need to be getting to Ólafur's.\":","\n","^When Fjola said Ólafur's name Jorgur's frown became a grimace. :grandpa:\"Fjola, let the children play for a little while. Ólafur is hardly any concern of mine, and I have not seen my daughter for  I have not seen that man in years.\":","\n","^:mom:\"Years? Did you even invite him to mother's funeral?\":","\n","^:\"Of course not, \":","\n","^:mom:\"Alex, just - don't go far.\":","\n","^:player:\"I won't.\":","\n",["ev",{"^->":"dinner.0.g-1.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex followed Kari outside","/str","/ev",{"*":".^.^.c-7","flg":22},{"s":["^^J:J,3:7 ^",{"->":"$r","var":true},null]}],{"c-7":["ev",{"^->":"dinner.0.g-1.c-7.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],{"->":"ACT2"},"\n","done",{"#f":7}],"#f":7}]}],{"#f":3}],"ACT2":[{"->":"afterDinner"},{"#f":3}],"afterDinner":[[{"#":"check_act2"},{"#":"v_clearScreen"},{"#":"v_act2/outsideHouse"},{"#":"s_audio/FootStep(Outside)_s"},"^:kari:\"Sorry about that. Grandfather can get upset sometimes. Did you enjoy dinner?\":","\n","ev","str","^Alex said yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex said no","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player: \"Yeah, it was pretty good, actually. Besides the smell.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player: \"How can you stand eating that fish? I feel like I'll never get the smell out of my nose\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Kari laughed.","\n","^:kari:\"We eat that almost every day. I like it best when it's thicker. Anyway, I want to show you something. Follow me over here!\":","\n","^Before Alex could protest, Kari sped off at the grassy hills behind the house. She figured she might as well follow.","\n",["ev",{"^->":"afterDinner.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Follow","/str","/ev",{"*":".^.^.c-2","flg":22},{"s":["^^I:J,3:5 ^",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"afterDinner.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],{"->":"enterwood1"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"enterwood1":[[{"#":"v_act2/forest5"},{"#":"v_enter_act2/forrest5KARI"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex cleared the hill and couldn't believe how wide open everything was. Distances she knew were huge seemed small with so little in the way.","\n","^:kari:\"This way, cousin! It's not too far!\": Kari bounced along the stream and Alex tried to keep up.","\n",["ev",{"^->":"enterwood1.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Follow","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^A:B,6:7^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"enterwood1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],{"->":"campfire"},"\n",{"#f":7}]}],{"#f":3}],"campfire":[{"#":"v_act2/meadowcampfire"},{"#":"v_enter_act2/entranceKARI"},{"#":"s_audio/Piano LeadUp_m"},"ev",{"VAR?":"coin"},1,"+",{"temp=":"coin","re":true},"/ev","^Alex wasn't sure how far she'd gone or how long it took by the time the cousins arrived at their destination. The grass gave way to dirt as Alex reached a thicket of trees, with a lean-to and some logs set up as benches around a fire pit. Kari stood proudly in the center of the area.","\n","^:kari:\"We made it, cousin! This is a very special place. Grandfather and I come here to pray, and sometimes camp! A few times a year, we gather with his friends for some bigger celebrations. There is always music and singing and good food! We used to do it more often. There used to be more people too.\": ",{"->":"cousinConvo_campfire"},"\n",{"#f":3}],"cousinConvo_campfire":[["ev","str","^Who else comes here?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Camping?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Celebrations?","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"Who else comes here?\": ","\n","^:kari:\"Well, it used to be Aunt Sigrún, Grandfather, Grandmother, Einar...\": Kari looked up and began to mutter as he kept track on his fingers. :kari:\"There was Ólafur, Helga, Björn, Margrét... Oh! And Ásta, Brynja, and Audhumbla. Now it’s just me, Audhumbla, and Grandfather.\": ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ :player:\"Camping?\": she asked. ","\n","^:kari:\"It's so nice and fun. We stay here for a few days and just relax and pray.\":","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ :player:\"Celebrations?\": ","\n","^:kari:\"Well, we perform the blót here, and make an offering to the gods or wights. On holidays we do one for all the gods.\":","\n",["ev","str","^How does it work?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ :player:\"How does it work?\": she asked.","\n",{"->":"wightPower"},{"#f":7}]}],{"#f":7}]}],{"#f":3}],"wightPower":[[{"#":"s_audio/ThunderRain"},["^Kari pulled out a piece of bread he had bitten into the shape of a horse","\n","^:kari:\"Do you want to meet one of the land wights?\":","\n","ev","str","^Alex wanted to","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex asked if they were real","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex was scared","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^:player:\"Yeah.\":","\n","^:kari:\"Okay. They can be mischievous so we have to be very polite.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["\n","^:player:\"Are they real?\":","\n","^:kari:\"Of course they are real!\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["\n","^:kari:\"I promise they won’t hurt you, it’ll be okay! We just have to remember to be super polite. They are a bit mischievous.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:kari:\"Here,\": he said, :kari:\"take a bite of this.:\"","\n","ev","str","^Take a bite","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Refuse","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n","^Alex bit off a chunk of the bread horse and handed it back to Kari, who nibbled off one of the legs.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["\n","^:player:\"Um, I don't think I want to. My stomach hurts.\":","\n","^:kari:\"Oh, that's okay. I'll take your bite,\": he said. Kari then nibbled off two of the bread horse's legs.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^:kari:\"Now, we put our wishes into the bread. You go first. You don't have to tell me what you wish for.\":","\n","ev","str","^I wish I was home","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^I wish my parents would stop being so weird","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^I wish Grandfather would like me","/str","/ev",{"*":".^.c-7","flg":20},{"c-5":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-6":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-7":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^:player:\"Okay, I made my wish.\":","\n","^:kari:\"I always wish for the wights to come back to our house to protect us. Okay, come here.\":","\n","^Kari led Alex over to a big rock. He got on his knees next to it and Alex followed. He started to speak in Icelandic. From what Alex knew, she understood that he was asking permission for something and introducing her. Kari finished, and the two stared at the rock in silence.","\n","^:player:\"Is something going to-\":","\n","^Sure enough, the biggest lizard Alex had ever seen crawled out from under the rock and sat on the top, eating the bread right out of Kari's hand. Alex couldn't take her eyes off of it.","\n","^:kari:\"I call this one Smorble,\": he whispered.","\n","^The lizard finished the bread, and started to stare right into Kari's eyes. Kari stared back.","\n","^:kari:\"I think he wants to show us something.\":","\n","^It turned to Alex. Alex forced herself to meet its gaze. Slowly, it crawled off the rock and onto Alex's leg.","\n","ev","str","^Remain calm","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Alex freaked out","/str","/ev",{"*":".^.c-9","flg":20},{"c-8":["^ Alex took a deep breath and let the lizard crawl up her leg onto her stomach. From there, it seemed to stare even deeper into her soul. She kept her cool, and eventually it crawled down off of her, and started to slink towards the tree line.","\n","^:kari:\"Okay, I think it's showing us the way. We should follow it. Come on Alex!\":","\n",{"->":".^.^.^.g-4"},{"#f":7}],"c-9":["^ Alex couldn't handle the lizard on her body and frantically shook it off with a yelp.","\n","^:kari:\"Alex!\":","\n","^The lizard fell to the ground and started to crawl away towards the tree line.","\n","^:kari:\"Come on, it's leaving, we have to follow it!\":","\n",{"->":".^.^.^.g-4"},{"#f":7}],"#f":7}],"g-4":["^Alex wasn't sure this was a good idea. She had already gone much farther than her parents would have liked. On the other hand, Alex was curious to see what would happen if they followed this lizard.","\n","ev","str","^Alex followed Kari","/str","/ev",{"*":".^.c-10","flg":20},"ev","str","^Alex turned back","/str","/ev",{"*":".^.c-11","flg":20},{"c-10":["^ Kari had made up his mind, and Alex felt safer with him than without him. She started to chase after him.","\n","ev",1,"/ev",{"temp=":"followedKari","re":true},{"->":"entrance"},{"#f":7}],"c-11":["^ Kari had made up his mind, and Alex knew that to protest would be pointless. Her parents would already be mad at her for being gone so long, following Kari now would be too much. She figured she could manage getting back to Grandfather's house if she just followed the stream. ","\n","ev",0,"/ev",{"temp=":"followedKari","re":true},{"->":"entrance"},{"#f":7}],"#f":7}]}],{"#f":3}],"act2Home_outside":[[{"#":"v_clearScreen"},{"#":"s_audio/WAVESMENUSPROLOGUE_m"},{"#":"v_act2/outsideHouseThird"},"^Alex emerged from the trees and her parents ran to embrace her. She'd never seen them this upset. Dad was seemingly unable to speak.","\n","^:mom:\"Are you okay?\":","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"Yeah, I think so\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I was scared I wasn't going to make it back.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom: \"You look hurt... where is your cousin?\":","\n","ev",{"VAR?":"followedKari"},0,"==","out","/ev","^ ",{"->":".^.^.^.whereKariLeft"},"\n","ev",{"VAR?":"followedKari"},1,"==","out","/ev","^ ",{"->":".^.^.^.whereKariFollowed"},"\n",{"#f":7}]}],{"whereKariFollowed":[["ev","str","^I lost him","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^He just disappeared","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I don't know","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player: \"It's all my fault, I tried my best to follow him but he ran off into the forest.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I ran after him and he just vanished\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^ :player:\"I don't know!\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":[{"->":".^.^.^.^.momScaredCont"},{"#f":7}]}],{"#f":3}],"whereKariLeft":[["ev","str","^I left him","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I don't know","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"He ran off... I couldn't follow him because you told me not to go far\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I don't know!\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":[{"->":".^.^.^.^.momScaredCont"},{"#f":7}]}],{"#f":3}],"momScaredCont":[[["^:mom:\"Okay, okay. We're going to go look for him. Stay at Grandpa's until we get back, just go to bed and we'll find Kari.\":","\n","ev","str","^Okay","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I want to help","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"Okay.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player:\"I want to help.\" :","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:mom: \"We need you to stay here. I left some clothes for you in Kari's room. Just get into bed, Grandpa will help. We'll be back soon, krútt.\":","\n","ev","str","^Go inside","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":[{"->":"act2Home_inside"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"#f":3}],"act2Home_inside":[[{"#":"v_act2/insideHouseJustGramps"},"^Alex walked inside with Grandpa.","\n","^:grandpa: \"Just you and me now, child. You should go to bed like your mother said.\":","\n","ev","str","^Are you concerned?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Do you know where Kari is?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Okay","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^:player:\"Are you scared about Kari?\": you ask.","\n","^:grandpa:\"Kari would never run off. He is too weak. That boy has no resolve. Here.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"Oh, Kari is just out playing. Do you think he would run off? Or is hurt? He knows the area well, and is too weak to run away. He has no resolve. Here.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^:player:\"Okay.\":","\n","ev",{"VAR?":"Stamina"},15,"+",{"temp=":"Stamina","re":true},"/ev",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandpa wets a cloth in the sink and cleans you up a bit. He gives you a bandage.","\n","^:grandpa:\"Okay, time for bed. Go upstairs.\":","\n",["ev",{"^->":"act2Home_inside.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go to bed","/str","/ev",{"*":".^.^.c-3","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"act2Home_inside.0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"act2Home_bedroom"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"act2Home_bedroom":[[{"#":"v_clearScreen"},{"#":"v_act2/bedroomEMPTY"},"^Finally back at the house, Alex was exhausted. Her mom had left some clothes for her, as promised, and Alex was ready for bed.","\n",["ev",{"^->":"act2Home_bedroom.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex changed and went to sleep","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^A:F,5:8 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"act2Home_bedroom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Alex changed and tried to sleep. Not knowing when her parents would be back, Alex tossed and turned for the next few hours, hoping Kari would run through the door.","\n",{"#":"v_fadeOut"},{"#":"t_speedDown"},{"#":"t_speedDown"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom: \"Krútt... wake up...\":","\n",{"#":"t_reset"},{"#":"v_enter_act2/fadedMOM"},"^Alex's mother shook her awake.","\n",{"#":"v_fadeIn"},"^She couldn't tell what time it was, but she knew she asleep longer than her mom told her she would be.","\n","^:mom: \"We went to the police across the bay. They're going to come in the morning to look for Kari but in the meantime Dad and I are going out to keep searching. I left you some food in the fridge just in case, but I think Grandpa might be able to cook for you. Please just stay here. I love you. \":","\n","^She leaves and you drift back asleep.","\n",{"#":"v_fadeOut"},["ev",{"^->":"act2Home_bedroom.0.g-0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Alex drifted back asleep. ",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"act2Home_bedroom.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],{"->":"ACT3"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"ACT3":[[{"#":"v_clearScreen"},{"#":"v_act3/bedroomEmpty"},{"#":"v_enter_act3/fadedGRAMPS"},{"#":"v_fadeIn"},{"#":"s_audio/Somber_m"},"^:grandpa: \"Wake up child. While you stay here you will live like a member of our kindred.\":","\n","ev","str","^Alex got up","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"#":"v_fadeIn"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Alex reluctantly got out of bed.","\n","ev","str","^Alex asked about Kari","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["^ After coming out of her sleepy haze, Alex suddenly remembered the events of last night. She asked where Kari was.","\n","^:grandpa: \"He didn't come home last night. Probably sleeping over at Audhumbla's or the Jóhannsons. You don't understand, child, our kindred are unafraid of the land. She is far less cruel than the city you live in.\"","\n","^Alex was unsatified with that answer and felt horribly guilty. She felt that if Kari wasn't safe, it was her fault.","\n","^:grandpa: \"Come downstairs. I've already made breakfast while you slept in. I will be hard at work outside.\"","\n",{"->":"ACT3.askGramp"},{"#f":7}],"#f":7}]}],{"askGramp":[["ev","str","^Alex pressed further","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex dropped the subject","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ :player:\"How can you be sure he's safe?\":","\n","^:grandpa: \"I said come downstairs. Don't doubt my family's strength, Kari is far better at navigating this land then you will ever be!\"","\n","^Alex followed him downstairs but couldn't help but worry about her cousin.","\n",{"->":"ACT3.breakfast"},{"#f":7}],"c-1":["^ Alex followed downstairs but couldn't help but worry about her cousin.","\n",{"->":"ACT3.breakfast"},{"#f":7}]}],{"#f":3}],"breakfast":[[{"#":"v_exit"},{"#":"v_act3/insideHouseEmpty"},"^Grandpa plopped a plate of oatmeal and a dolop of white stuff Alex didn't reconize onto the table. Alex took a seat at the table as he stared directly at her.","\n","ev","str","^Alex asked about the breakfast","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex took a bite","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^Alex asked what the white stuff was and Grandpa scoffed.","\n","^:grandpa: \"Its skyr!\"","\n","^Grandpa's face began to turn red.","\n","^:grandpa: \"It's like yogurt. Gah!\": He threw his hands into the air. :grandpa:\"What does your family teach you? How dare they let our culture die like this.\":","\n","^He stormed out and Alex felt relieved.","\n",{"->":"ACT3.eat"},{"#f":7}],"c-1":["^ Alex took a spoonful of the white yogurt-like substance. It was thick, creamy, but still sweet. Grandpa grunted, he actually seemed glad that she enjoyed it. ","\n","^:grandpa: \"I put sugar in the oatmeal. I know how they spoil you in America.\"","\n","^He hobbled out the door.","\n",{"->":"ACT3.eat"},{"#f":7}]}],{"#f":3}],"eat":[["^Alex's parents still weren't home, and neither was Kari.","\n","^Alex sat alone at the table and began to think to herself.","\n","ev","str","^It was your fault","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex took a bite","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ The guilt cut deep into her. :player: \"I can't just sit here and do nothing, not while Kari is still out there!\": she said to herself. ",{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}],"c-1":["^ She took a bite of her oatmeal. ",{"->":"ACT3.eat2"},"\n",{"#f":7}]}],{"#f":3}],"eat2":[["ev","str","^Kari could be dead","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex took another bite","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ The guilt cut deep into her. :player: \"I can't just sit here and do nothing, not while Kari is still out there!\": She said to herself.","\n",{"->":"ACT3.livingRoomPuzzle"},{"#f":7}],"c-1":["^ She took another bite of her skyr. ",{"->":"ACT3.eat3"},"\n",{"#f":7}]}],{"#f":3}],"eat3":[["ev","str","^If you hadn't been so childish","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex drank some milk","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ The guilt cut deep into her. :player: \"I can't just sit here and do nothing, not while Kari is still out there!\": She said to herself. ",{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}],"c-1":["^ She sipped some of her milk. ",{"->":"ACT3.eat4"},"\n",{"#f":7}]}],{"#f":3}],"eat4":[["ev","str","^Everyone will hate you","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex kpet eating","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^  The guilt cut deep into her. :player: \"I can't just sit here and do nothing, not while Kari is still out there!\" She said to herself. ",{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}],"c-1":["^ She kept eating. ",{"->":"ACT3.eat5"},"\n",{"#f":7}]}],{"#f":3}],"eat5":[["ev","str","^Everyone hates you","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex kept eating","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^  The guilt cut deep into her. :player: \"I can't just sit here and do nothing, not while Kari is still out there!\": She said to herself. ",{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}],"c-1":["^ She kept eating. ",{"->":".^.^.^"},"\n",{"#f":7}]}],{"#f":3}],"livingRoomPuzzle":[["ev",{"VAR?":"foundClues"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ Alex got up, determined to save her cousin. She just had to figure out how. ","<>",{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"foundClues"},"/ev",[{"->":".^.b","c":true},{"b":["^ Alex surveyed the room, deciding how she would sneak out of the house. ","<>",{"->":".^.^.^.11"},null]}],"nop","\n",{"#":"v_act3/insideHouseEmpty"},["ev",{"^->":"ACT3.livingRoomPuzzle.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^The window","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^B:C,2:3^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^The Cabinets","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^D:F,2:3^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Fireplace","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^A:B,4:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Front Door","/str",{"VAR?":"hasPapers"},"/ev",{"*":".^.^.c-3","flg":7},{"s":["^^J:J,3:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Stairs","/str","/ev",{"*":".^.^.c-4","flg":6},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"foundClues"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Alex looked out the window perhaps hoping to see Kari. Unfortunately, all she found was the rolling hills to the north and her grandfather occationally walking past to water the plants.","\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.12"},null]}],"nop","\n","^Alex saw hills that looked a lot like the ones on Kari's map. She clenched her fists and waited for her grandfather to turn the corner. She then opened the window and bolted for the hills.","\n",{"->":"ACT3.puzzleEnd"},{"#f":7}],"c-1":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"foundClues"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Where ever Alex ended up going, she knew it will probably be a long journey. She stocked up on some snacks for her eventual journey, stuffing her pockets.","\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.12"},null]}],"nop","^","\n","^Alex came to the realization that she was not getting out of this house while her Grandfather guarded the outside. She decided to break one of the shelves. With a loud crack, she snapped out a shelf in the cabinet, spilling the contents it supported. She frantically ducked out of sight as her Grandfather burst through the door to investigate. She then took the chance to bolt through the door, knowing he wouldn't be able to catch up.","\n",{"->":"ACT3.puzzleEnd"},{"#f":7}],"c-2":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"^ ","\n","ev",{"VAR?":"foundClues"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^A shiver went down Alex's spine. She cozied up next to the lit fireplace, just for a little while. For that short while, she felt like she was home again.","\n",{"->":".^.^.^.^.^"},{"->":".^.^.^.13"},null]}],"nop","\n","^Alex came to the realization that she was not getting out of this house while her Grandfather guarded the outside. She started frantically throwing things into the fire until smoke filled the room. She frantically ducked out of sight as her Grandfather burst through the door to investigate. She then took the chance to bolt through the door, knowing he wouldn't be able to catch up.","\n",{"->":"ACT3.puzzleEnd"},{"#f":7}],"c-3":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],"^  Alex got up, put on her coat and boots and left through the front door. ","\n","^Grandpa stopped her.","\n","^:grandpa: \"Where do you think you're going? Go back inside! You are not Kari. You haven't lived here and I doubt you would ever make it home safely. You're parents have made you soft. They would blame me for you getting lost and I will not have that\":","\n","^He glared at her until she headed back inside. Alex can tell there will be no chance to reason with him.","\n","ev",1,"/ev",{"temp=":"foundClues","re":true},{"->":".^.^.^"},{"#f":7}],"c-4":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"^ ",{"->":"ACT3.UpstairsPuzzle"},"\n",{"#f":7}]}],{"#f":3}],"UpstairsPuzzle":[["ev",{"VAR?":"hasPapers"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n",{"#":"v_enter_act3/papers"},{"->":".^.^.^.5"},null]}],"nop","\n",{"#":"v_act3/bedroomEmpty"},["ev",{"^->":"ACT3.UpstairsPuzzle.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Papers","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^G:H,8:8 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.UpstairsPuzzle.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^The Bed","/str","/ev",{"*":".^.^.c-1","flg":22},{"s":["^^A:F,5:8 ^ ",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.UpstairsPuzzle.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^down","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^I:J,3:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ACT3.UpstairsPuzzle.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"^ Alex picked up Kari's drawings. Sifting through them, she desperately looked for a clue, a message, anything that could guide her to Kari. She had to squint to make out what they were, which only served to remind her how young Kari was and how much danger he could be in.","\n","^One drawing took her particularly long to decipher. But it soon dawned on her what it was- a map. There seemed to be a path through the mountains that lead to the shore. At the top right of the map was a boat circled in red. :player: \"If Kari is anywhere it's there.\":","\n","ev",1,"/ev",{"temp=":"hasPapers","re":true},{"#":"v_exit"},{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"ACT3.UpstairsPuzzle.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"^ Alex had hardly slept at all the night before, seeing Kari's empty bed only made her feel worse. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["ev",{"^->":"ACT3.UpstairsPuzzle.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}]}],{"#f":3}],"puzzleEnd":[["^As she runs, Alex heard her Grandfather's shouting behind her but she did not care. She needed to find her cousin, and this was how she was going to do it.","\n","ev","str","^Alex headed north","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"trails"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"act3Boat":[{"#":"v_clearScreen"},"ev",{"VAR?":"coin"},1,"+",{"temp=":"coin","re":true},"/ev","^Your heart sinks as you realize Kari really isn't in here. Once again you are lost and alone in the Icelandic wilderness. And now you have to go back to your parents and grandpa empty handed and in huge trouble.","\n","^You finally enter the boat and find a mess of drawings, notes, and trinkets. Kari has fashioned this place into a home, or maybe a studio. From the amount of stuff lying around, you assume he must spend a lot of his time here.","\n",{"->":".^.Insideboat"},{"Diary":[["^You pick up a school notebook and begin to read.","\n","^:kari: \"I am writing this in english to practice and it feels more secret. today I was out and i saw a man leading a group of strange people into the mountains. I told Grandpa and he was very upset and told me not to talk to them. he called them tourists. later we made really good bread with margret and bjorn johannson and we played outside and drew the wights.\":","\n","ev","str","^Next entry","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Keep looking","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ You decide to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:kari: \"Today grandpa made a meeting for the kindred to talk about the tourists. There was grandpa, Audy, the Geirssons, and the Johannsons. I always like seeing mr. geirson. he said that we should be open to the tourists and fishing isn't as good anymore and Grandpa said that we need to protect our land. Grandpa got really mad and Mr. Geirson said that this is why aunt Sigrun and uncle einar left. That made Grandpa really mad. when we got home he didn't want to bake with me.\":","\n","ev","str","^Next entry","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Keep looking","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ You decide to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:kari: \"Grandpa has been quiet and mean. he found out Mr geirson sold some land to the man. grandma said maybe we should try to change and he was mean to her. i told grandpa that today was the day for eyvind kinnrifi and he told me it wasnt and he would not forget that even though it was the 9 february. he got really really mad and confused and punished me and i ran here to my boat.\":","\n","ev","str","^Next entry","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Keep looking","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-5":["^ You decide to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^:kari:\"i have not written in this diary in a few months. grandpa does not allow me to speak english anymore or talk to the geirssons. the Johannsons left the kindred too. I miss playing with bJörn and margrét Johannson a lot but grandpa says i can not see them either. he has been very mean and yells a lot. he does not talk to grandma any more. at least auntie audy is still okay to talk to. i often sneak out to stay at her house in the west and she gives me milk. it does not seem like grandpa notices.\":","\n","ev","str","^Keep looking","/str","/ev",{"*":".^.c-6","flg":4},{"c-6":["^ You decide to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"#f":7}],"#f":7}]}],{"#f":3}],"Insideboat":[["ev","str","^Examine drawings","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Examine journal","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine trinkets","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Go Home","/str",{"VAR?":"seenBoat"},3,">","/ev",{"*":".^.c-3","flg":21},{"c-0":["^ You examine the drawings. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},"^Heaps of half-finished papers lie around the boat. Over and over you see the same four creatures in Kari's drawings - dragon, eagle, bull, and giant. It's obsessive. In many of the drawings the four are pictured with a whale, sometimes fighting the whale or towering over it. The creatures are labeled, respectively, as East, North, West, South. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":[{"->":"act3Boat.Diary"},"\n",{"#f":7}],"c-2":["^ Scattered around the boat you see a bowl with some runes carved in it, some little hammers, twigs, a knife, and a hollowed-out horn.","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":"act3HomeOutside"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"act3HomeOutside":[[{"#":"v_clearScreen"},{"#":"s_stop"},{"#":"v_act3/outsideHouse"},"^You'd seen enough in the boat and decided to stop back home before heading out to meet Audhumbla. Finally, you arrive back at Grandpa's house, exhausted and beaten up from your journey north. Through the window you can see Grandpa napping in his chair. You could try to sneak back in or greet grandpa like nothing is wrong.","\n","ev","str","^Walk in","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Sneak in","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":".^.^.^.act3walkIn"},"\n",{"#f":7}],"c-1":[{"->":".^.^.^.act3Sneak"},"\n",{"#f":7}]}],{"act3Sneak":[[{"#":"v_act3/insideHouseEmpty"},"^You open the door and it creaks loudly. You don't see Grandpa.","\n",["ev",{"^->":"act3HomeOutside.act3Sneak.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go upstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"act3HomeOutside.act3Sneak.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":".^.^.^.^.act3SneakUpstairs"},"\n",{"#f":7}]}],{"#f":3}],"act3SneakUpstairs":[[{"#":"v_clearScreen"},{"#":"v_enter_act3/fadedGRAMPS"},{"#":"v_act3/bedroom"},"^Grandpa is standing in Kari's room with an angry look on his face.","\n","^:grandpa:\"Where have you been?\"","\n","ev","str","^Out looking for Kari","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Just getting some air","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Wanted to look at the mountains","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","\n",{"#":"t_speeddown"},"^:grandpa: \"Hrmph. Your parents told you to stay in, didn't they?:","\n","^:grandpa:Well I do like a rebel. Maybe you have a bit of Iceland in you after all. But don't do it again. Now, come downstairs. I am to give you lunch and then we leave\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#":"t_reset"},{"#f":7}],"c-1":["\n","^:grandpa: \"Well stay inside. Your parents told you. Now, come downstairs, I am to give you lunch and then we leave.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}],"c-2":["\n","^:grandpa: \"They are beautiful. Well stay inside. Your parents told you. Now, come downstairs, I am to give you lunch and then we leave.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}]}],{"#f":3}],"act3walkIn":[[{"#":"v_clearScreen"},{"#":"v_act3/insideHouseEmpty"},{"#":"v_enter_act3/fadedGRAMPS"},"^You stroll into the house like you own the place. Grandpa is sitting in his chair.","\n","^:grandpa: \"Oh, hello.\":","\n",{"#":"t_speeddown"},"ev","str","^Hello grandpa","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^What's up","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Hey","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"Hello grandpa\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^:player:\"What's up.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^:player:\"Hey.\":","\n",{"#":"t_reset"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandpa seems unconcerned.","\n","^:grandpa:\"Hrmph. Where did you go? You seem hurt.\":","\n",{"#":"t_speeddown"},"ev","str","^Just getting some air","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Exploring","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Looking for Kari","/str","/ev",{"*":".^.c-5","flg":20},{"c-3":["^ :player:\"Just... getting some air.\":","\n",{"#":"t_reset"},"^:grandpa: \"Ah, good. The air here is the best you will find in the world.\"","\n",{"#":"t_speeddown"},{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["^:player:\"Um... exploring.\":","\n",{"#":"t_reset"},"^:grandpa: \"Ah. It's good for you.\":","\n",{"#":"t_speeddown"},{"->":".^.^.^.g-1"},{"#f":7}],"c-5":["^:player:\"I was looking for Kari\":","\n",{"#":"t_reset"},"^:grandpa: \"Hrmph. I told you he is just out playing.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:grandpa:\"You seem hurt. Here.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}]}],{"#f":3}],"act3Leaving":[[["^Grandpa cleans you up a bit and gives you a bowl of lamb stew with bread. :grandpa: \"Your parents asked I bring you to your father's family in the village. I do not go there anymore.\":","\n","ev","str","^Why?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Okay","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player: \"Why?\":","\n","^:grandpa:\"His family betrayed the kindred. They sold land to the tourist guides, to let them invade and deface our land. Now, I must employ fishermen from across the water.\":","\n","^:player: \"Huh.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player: \"Okay.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:grandpa:\"Time to go.\":","\n",{"->":".^.^.^.^.act3car"},{"#f":7}]}],{"#f":3}],"act3walk":[{"->":".^.^.act3car"},{"#f":3}],"act3car":[[["^You and grandpa get in his car and start to drive west.","\n",{"#":"v_exit"},{"->":"ACT4"},{"#f":7,"#n":"g-0"}],null],{"#f":3}],"#f":3}],"ACT4":[[{"#":"check_act4"},{"#":"v_clearScreen"},{"#":"s_audio/Farm_m"},{"#":"v_act4/westDoorOpen"},"^You drive up to a decrepit old farm. It’s definitely not Dad’s parents’ place by the water. Grandpa answers your question before you ask it.","\n","ev",3,"/ev",{"temp=":"coin","re":true},"^:grandpa: “This is Audhumbla Ívarsdóttir’s house. She is the only remaining member of my kindred. Everyone else abandoned us to live with comforts, they abandoned the ways of our forefathers. I want you to see the life that we have.”:","\n","ev","str","^What about other grandparents?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Are we going to stay here for long?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:”What about my other grandparents?”: you ask.","\n","^:grandpa:”They can wait. I don’t care to see them. It’s been two years since I talked to them last.”:","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :grandpa:”That is up to you.”:","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^You pull in and get out of the car. It takes Grandpa a second. You both walk over to the house and Grandpa knocks on her door.","\n","^:audie:”Halló Jorgur“: you hear from inside.","\n","^:grandpa: “Halló Audie. [I have a visitor with me.]”","\n","^Suddenly the door swings open, and Audhumbla towers over you. She’s younger than Grandpa but still pretty old. She looks you up and down for a long time.","\n","^:audie:”You are  the one I have been waiting to meet... Hmph. You look nothing like your grandfather.”:","\n","^:grandpa:”This one has been out exploring. She thinks she’s one of the kindred.”:","\n","^She smiles.","\n","^:audie: ”I guess she’ll have to work like one. Go on, child. Go...:","\n",{"#":"t_speedDown"},{"#":"t_speedDown"},"^:audie:milk the cows.”:","\n",{"#":"v_act4/barnEx"},"^Grandpa heads inside and they slam the door in your face, laughing.","\n",{"->":"west"},{"#f":7}]}],{"#f":3}],"grandpayelling":[[{"#":"v_clearScreen"},"^You knock on the door and show Grandpa the bucket of milk. He looks at you and looks at the bucket and snarls.","\n","^:grandpa: \"What is this? You call this milk? You are useless! Just like the rest of them, useless burdens on our town! Look at this, its pink! How dare you hurt those cows with your stupid city boy hands. Did you even strip them? Are you trying to make me sick?\"","\n","ev","str","^Try to explain","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ You stammer trying to find a response but you're too scared. You don't know what he's capable of. You don't want him to hurt you. ","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:grandpa: \"Useless, stupid boy! I'll show you how someone of my blood should milk a cow.\"","\n","^Audhumbla calls from inside - :audie:\"That's enough, Jorgur. Bring the boy inside!\":","\n","^Grandpa snaps back, :grandpa:\"Quiet Audhumbla! This is my grandchild and I will do as I please.\":","\n","^He pulls you by the ear and you yelp in pain. He does not let go. You have trouble breathing and your eyesight is getting blurry. You are terrified.","\n","ev","str","^Cry out","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["^ You try to call out for someone to help but you can't get the words out.","\n",{"#":"v_act4/inBarnOne"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^By the time you reach the barn tears stream down your face. You feel light headed. He continues to yell at you, now mostly in icelandic. He shoves you too the ground, picks you up by the collar, and pushes you toward a cow. You panic, trapped with no one to help you. You feel like blacking out.","\n",{"#":"v_act4/inBarnTwo"},"^:grandpa: \"You want to be a real man of Iceland use this!\" He pulls out a hideous creature out of a nearby crate. It looks like a long, hairy snake made of wrapped in old, crusty fur. On its two ends are wrinkled and swolen screaming faces. Their lips are cracked and swolen, its mouth gaping wide. Grandpa wiggles it around infront of you and you see its beady eyes glazed over with puss.","\n","ev","str","^Scream","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["^ You scream and Grandpa laughs. ","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^:grandpa: \"What's the matter? You've never seen a Tilberi before? What have you parents been teaching you? This is our culture! This is how we use to milk the cows! You coward, children here are raised properly, to not fear such silly things.\"","\n","^He shoves the Tilberi in your hands and you panic. You don't know whats real and whats fake any more. You breath heavily, unable to tell if he's joking or not.","\n","ev","str","^Shut your eyes","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["^ You squeeze your eyes shut and wish to be anywhere else but here. ","\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^Suddenly Grandpa perks up and shushes you. He lets the Tilberi go and it slithers away and begins to suckle on the cow. Grandpa hides behind the door. ",{"->":"dadEnter"},"\n",{"#f":7}]}],{"#f":3}],"dadEnter":[["^You wait, shocked and unable to move. He turns to you and grins. :grandpa:\"Scream if you want child.\":","\n",{"#":"v_act4/inBarnThree"},"^The door of your barn busts open. It's your dad, you call out to him.","\n","^:dad:\"There you are! Oh no... What did he do?!\": He starts to move towards you, you try to warn him but it's too late.","\n","^Grandpa swings back and knocks out your father with a shovel.","\n",{"#":"v_act4/inBarnFour"},"^:player:\"Dad!\":","\n","^Grandpa laughs, winded. :grandpa:\"You're not going anywhere,\": he wheezes. His hands are on his knees. You have to act now.","\n","ev","str","^Sprint for the door","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Knock him over","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You make a break for the door. He tries to lunge at you but he misses. ","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ You run at Grandpa full tilt, lower your shoulder, and try to knock him off his feet. He tries to grab you but you manage to bring him to the ground.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^You barely make it to the door.","\n",{"->":"barnAudy"},{"#f":7}]}],{"#f":3}],"barnAudy":[["^You tear out of the barn and run straight into Audhumbla. She looks down at you with fear in her eyes.","\n","^:audie:\"I'm so sorry,\": she croaks. She means it. :audy:\"I didn't think it would go this far, I...\":","\n","ev","str","^Get out of my way!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Then help me!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:audie:\"Wait okay! To the south, down that road... some old members of the kindred run a ski mountain - find them!\":","\n","^With no time to think, you take off towards the mountains.","\n",{"->":"ACT5"},{"#f":7}]}],{"#f":3}],"ACT5":[{"->":"act5Road"},{"#f":3}],"act5Road":[[{"#":"check_act5"},{"#":"v_clearScreen"},{"#":"v_act5/road"},"^You've run out onto the road, heading for the mountains. You hope to god or gods that Audhumbla isn't tricking you. You're freezing cold and soon praying to see any sort of car on the road.","\n","^Sure enough, you see a pickup truck coming up from behind you.","\n","ev","str","^Stick your thumb up","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Walk in front of car","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You stick your thumb up and the car rolls to a stop next to you.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ The car slows down in front of you and you walk around to the driver's side. You prepare to use what little Icelandic you know.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad:\"[Hello, child! What are you doing out here?]\":","\n","ev","str","^Lost my parents","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Running from crazy man","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Need to go skiing","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["^ :player:\"I lost my parents,\": you say.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ :player:\"I'm running from a crazy man,\": you say.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["^ :player:\"I need to get to the ski resort,\": you say.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:dad:[Huh, well if you're heading up this way then I would have to be a monster not to help a child such as yourself from the cold. Hop in.]\":","\n","ev","str","^Get in","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"#":"v_fadeOut"},{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^You drive for a few miles and it's clear you've entered the mountains. The ground is covered in snow as far as the eye can see.","\n",{"#":"v_fadeIn"},"^\"This as far as I can go.\" they say \"Good luck out there, kid. You have a rough trip ahead of you.\" They hand you a blanket and tell you to keep warm.","\n",{"->":"mountainBase"},{"#f":7}]}],{"#f":3}],"mountainBase":[{"->":"mountain1"},{"#f":3}],"act5Arrival":[[{"#":"v_act5/snowyhouse"},{"#":"v_clearScreen"},"^You finally see the small wooden cabin, just where Kari's map said it would be. The lights are on, but it's quiet.","\n","ev","str","^Knock on door","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ You knock on the cabin door and hear commotion inside. A woman around your mother's age opens the door. She looks at you like she's seen a ghost.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:brynja:\"...Kari? Is that you?\":","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^No","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Say nothing","/str","/ev",{"*":".^.c-3","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:brynja:\"Wait, you're not Kari. Who are you?\":","\n","ev","str","^Kari's cousin","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Sigrún's daughter","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^Jorgur's granddaughter","/str","/ev",{"*":".^.c-6","flg":20},{"c-4":["^ :player:\"Kari's cousin,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-5":["^ :player:\"Sigrún's daughter,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-6":["^:player:\"Jorgur's granddaughter,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Her face turns white. :brynja:\"Odin's spear... come in, quickly\":","\n","ev","str","^Go inside","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":[{"->":".^.^.^.^.act5insideHouse"},"\n",{"#f":7}],"#f":7}]}],{"act5insideHouse":[["^You enter the small cabin and the warmth instantly makes you feel safe and secure. There are two rooms - one a sort of kitchen and one lined with beds (in which there are two kids sleeping). It's a lovely home. The woman whispers into the house in Icelandic and someone comes out from the kitchen.","\n","^:brynja:\"My name is Brynja,\": the woman says. :brynja:\"This is my wife, Ásta.\"","\n","^:asta:\"What are you doing here, little one?\":","\n","ev","str","^Trying to find Kari","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Grandpa has gone crazy","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I'm in danger","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"I'm trying to find Kari,\": you say. :player:\"Have you seen him?\":","\n","^:brynja:\"No, but...\" They share a look.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^:player:\"Grandpa has gone crazy,\": you say. :player:\"He's attacked my dad.\":","\n","^They share a look. :brynja:\"We assumed as much.\"","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^ :player:\"Grandpa attacked my dad.\",: you say. :player:\"I needed help.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^They share a look. :\"asta\":\"How did you find us?\": Ásta asks. You tell them about how Audhumbla helped you escape. Brynja is stunned.","\n","^:brynja:\"Audhumbla went against Jorgur?\":","\n","^:asta:\"He must have really gone insane.\":","\n","^:brynja:\"We sort of knew about this... Your cousin left us this note. We didn't see him but it was on our doorstep this morning.\": They hand you a piece of paper.","\n","ev","str","^Read letter","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"#":"v_clearScreen"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:kari:\"Dear Jóhannson family,","\n","^i hope you are well. i am sorry for writing in english but grandpa jorgur cannot read it. i wanted to tell you that grandma Fjola died but we are doing ok. my cousin and aunt and uncle have come to visit. grandpa tells me they are bad people but i really like to see them. i have been staying outside away from our house to fool them like he told me. grandpa said my cousin will help the kindred get strong again. the blót is tomorrow. he told me never to talk to you again but i miss playing with björn and margrét and wanted to say i hope you and grandpa make up and join us again.\":","\n","^You look up at Brynja and Ásta. ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"chatpt1":[["ev","str","^Why does grandpa hate me?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What was the kindred like?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^What is Grandpa going to do?","/str","/ev",{"*":".^.c-2","flg":4},{"*":".^.c-3","flg":24},{"c-0":["^:brynja:\"The way he sees it, his kindred betrayed him. We survived for years by fishing but we couldn't keep up with the times. The tourism industry is a betrayal of what he thinks is an authentic Icelandic life.\": ",{"->":".^.^.^.^.grandpaHateAsk"},"\n",{"#f":7}],"c-1":["^ Ásta and Brynja both start to speak, then Brynja motions to Ásta. :asta:\"For a time it was nice. It was like a family, we shared everything. We could nearly sustain ourselves... I had so much time to enjoy life. We felt like rebels, and Jorgur was our mighty leader. In our eyes he could do no wrong. Things really changed.\": ","\n",{"->":".^.^.^.^.kindredAsk"},{"#f":7}],"c-2":["^ Brynja looks at Ásta. :asta:\"We're not sure, but.. he is planning a blot.\":","\n","^:brynja:\"A sacrifice.\":","\n","^Ásta glares at Brynja. :asta:\"Who knows, he's a crazy old man. If Audhumbla really did send you here, he's alone. He can't hurt you.\": ",{"->":".^.^.^"},"\n",{"#f":7}],"c-3":[{"->":".^.^.^.^.chatpt2"},"\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"grandpaHateAsk":[["ev","str","^Ask about fishing","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ask about \"authentic\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Ask about skiing","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Ask other questions","/str",{"VAR?":"hateAskNum"},0,">","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ :player:\"What happened with the fishing?\":","\n","^Ásta sighs. :asta:\"We would sell our fish to the town across the bay, Dalvík. They didn't like us pagans but they still bought our fish. It started to grow and they got new fishing technology. Suddenly our fish were worth less and less.\":","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"What does that mean, authentic?\":","\n","^:asta:\"Jorgur talked about 'hard virtues.' Courage, honor, endurance, control. He thought that only those who lived like we did - worshiping the old gods, living off the land - were real Icelandic. To him, working in tourism is soft. We also started to realize that he hated the idea of anyone not 'true icelandic' invading his soil.\"","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-2":["^ :player:\"So... people ski here?\": you ask.","\n","^:asta:\"Yes, it's quite popular. We have a great website.\" She looks lovingly at Brynja.","\n","^:brynja:\"I do freelance web development. And most of the management. Ásta handles the tourists but mainly she is a writer.\":","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"kindredAsk":[["ev","str","^Ask why they joined","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about leaving","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Ask about skiing","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Ask other questions","/str",{"VAR?":"kindredAskNum"},0,">","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ :player:\"So why did you join the kindred in the first place?\":","\n","^Brynja answers. \"In Dalvík we kept a low profile... We were gay and back then there was, well, contempt for us. We met your grandfather in town one day and he offered us something too good to be true.\"","\n","^:asta:\"A place where we didn't have to hide, and didn't have to worry about money.\"","\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"Why did you leave the kindred?\": ","\n","^:brynja:\"Your parents had already run away and everyone was on edge. Tour guides started bringing people in to see the \"untouched nature\" and it made Jorgur crazy. We were poor and sad and when your father's father sold some land to a tour agency it was time for us to find our own way. We still practice Asatru, but not like Jorgur.\":","\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"grandpaPlanAsk":[["ev","str","^Ask other questions","/str",{"CNT?":".^.^"},0,">","/ev",{"*":".^.c-0","flg":5},{"c-0":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"chatpt2":[{"->":".^.^.chatend"},{"#f":3}],"chatend":["^:brynja:\"Come, we have to get to your mother,\": Brynja says. You start to get up but Brynja quiets you.","\n",{"#":"t_speedDown"},{"#":"t_speedDown"},"^:grandpa:\"Ásta. Brynja.\"","\n",{"#":"t_reset"},"^:asta:\"Ye gods, Jorgur. You look awful.\":","\n","^He does.","\n","^:grandpa:\"There you are, you little asni.\": Grandpa lurches forward but Brynja steps between you. The sleeping kids jolt awake.","\n","^:brynja:\"What are you doing with this child, Jorgur?\":","\n","^:grandpa:\"Agh, stop speaking in his ugly language.\":","\n","^:brynja:\"I'll speak so the child can understand it. This is madness. You sent Kari out into the wilds? Why?\":","\n","^:grandpa:\"It's the design of the gods. I needed to distract the parents so the child can be brought to our ritual site. Don't you see? My Fjola died just before the Dísablót falls upon us!\":","\n","^:asta:\"You will not make this innocent child a part of your perversion of our sacred rituals! It won't bring her back, Jorgur!\"","\n","^:grandpa:\"Innocent? He dares to live as an American You don't understand,\":","\n","end",{"#f":3}],"#f":3}],"sacrifice":["^fdsgad","\n","end",{"#f":3}],"entrance":[{"#":"v_clearScreen"},{"#":"s_audio/ThunderRain"},{"#":"s_audio/SpoopyPiano_m"},{"#":"v_act2/entrance"},"^:player:\"Kari!\":","\n","^Alex desperately called for Kari, but heard no response. She was completely lost. Thunder crashed up above while the rain seeped through her shoes. Alex wandered around confused and hopeless, Occationally she would cry out for her cousin, fruitlessly.","\n",{"->":".^.main"},{"main":[["^:player:\"Kaaarrriiii!\":","\n",["ev",{"^->":"entrance.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex wanders north","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,5:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"entrance.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ",{"->":"wood2"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"wood2":[{"#":"v_act2/forest2"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex's tears stung from the cold. She noticed some strange runes but was to exausted and scared to care. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: EAST"},["ev",{"^->":"wood2.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,6:7 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood2.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,7:8 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood2.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^G:H,9:10 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood2.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"^Alex walked on for what felt like forever... ","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-1":["ev",{"^->":"wood2.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ",{"->":"wood3"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood2.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"^ Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}]}],{"#f":3}],"#f":3}],"wood3":[{"#":"v_act2/forest3"},{"#":"s_audio/FootStep(Outside)_s"},"^The storm brooded directly over Alex, as if it was conspiring against her. It roared and growled, pushed and pulled at her, but she pushed on. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: SOUTH"},["ev",{"^->":"wood3.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,5:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,7:8^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^G:H,9:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^A:B,6:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood3.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-1":["ev",{"^->":"wood3.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ","\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-2":["ev",{"^->":"wood3.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"^  ",{"->":"wood4"},"\n",{"#f":7}],"c-3":["ev",{"^->":"wood3.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}]}],{"#f":3}],"#f":3}],"wood4":[{"#":"v_act2/forest4"},{"#":"s_audio/FootStep(Outside)_s"},"^The winds were cruel and endless. Every rock or bushed looked like Kari from a distance, Alex would run after them only to be met with dispair. Everytime Alex would stop and try to piece together her surroundings. The thought of never making it home dug at her from the back of her mind. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: EAST"},["ev",{"^->":"wood4.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,6:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,6:8^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^G:H,9:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^A:B,6:7^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood4.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-1":["ev",{"^->":"wood4.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ",{"->":"wood5"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood4.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"^ ","\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-3":["ev",{"^->":"wood4.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}]}],{"#f":3}],"#f":3}],"wood5":[{"#":"v_act2/forest5"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex stumbled, her feet in pain from the cold, the walking, the guilt. Perhaps two kids would be found missing this night. She tried to push on but then everything would weigh on her. She trudged on, delerious. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: NORTH"},["ev",{"^->":"wood5.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,5:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,6:8^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^G:H,9:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^A:B,6:7^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood5.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"act2Home_outside"},"\n",{"#f":7}],"c-1":["ev",{"^->":"wood5.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ","\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-2":["ev",{"^->":"wood5.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"^ ","\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}],"c-3":["ev",{"^->":"wood5.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Alex walked on for what felt like forever...","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"entrance"},{"#f":7}]}],{"#f":3}],"#f":3}],"trails":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},{"#":"s_audio/WindStooorm"},{"#":"s_audio/Somber_m"},{"#":"v_act3/northClimbingUpHills"},"^Alex tried to follow Kari's map as best she could, just looking at it gave her hope that Kari was okay. She could still feel her heart pounding from the escape. Staying inside just did not sit right with her. The air was chilly but refreshing, a perfect time to explore the beautiful landscape around her, but she was on a mission. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex looked at map again","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex took in the scenery","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex ventured on","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ Kari's drawings were crude but surprisingly helpful when it came to finding the hideout. From what Alex could tell it was some kind of boat. Alex felt a little envious after that, she wished she could have a secret boat hideout. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ Alex's mom would always talk about how beautiful Iceland was and looking around, she could finally see why. The landscape was so vast and colorful, it gave her a sense of clarity she had never felt before. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ Kari had to be at this hideout, where else would he have run off to? Alex was just glad that she found his drawings when she did. She thought that maybe when she found him, he could show her more sights around iceland.  ",{"->":"trails2"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"trails2":["^Alex climbed up and down hills hoping to spot her cousin's secret hideout. This hill in particular is precariously steep, but she could hear the ocean just ahead. Her feet began to slip under the loose gravel of the trail; she didn't feel safe. ",{"->":".^.main"},"\n",{"main":[["ev","str","^Alex pushed forward","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^She pushed forward again","/str",{"VAR?":"Gone_forth"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^Alex paced herself","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex used her hands","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["^ Alex took a deep breath and attacked the trail. Hiking as fast as she could, ignoring the burning in her calves. She was almost at the top when she tripped and tumbled down. ","\n","^She got back up at the foot of the trail with some scratches and a bruise. She felt a bit worse.","\n","ev",1,"/ev",{"temp=":"Gone_forth","re":true},"ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ She threw caution to the wind and tried again. This time running up the slope at full speed. She squeezed her eyes shut, preparing mentally for a fall, but when she opened them she realized that she had actually made it to the top.","\n",{"->":"cliff"},{"#f":7}],"c-2":["^ She decided to hike this steep trail slowly and safely. She zig-zagged across the slope so she didn't fall. She eventually got to the top but it ate up far more time than she wanted it to.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"cliff"},{"#f":7}],"c-3":["^ She used her hands to secure herself, out of fear of stubling down the hill. She kept her body low to the ground and scampered up the hill. She just knew that she looked absolutely ridiculous.","\n","^When she got to the top and unclenched her hands, finally noticing that they were raw and bloody, but she made it and that was the most important part.","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"fucked_hands","re":true},{"->":"cliff"},{"#f":7}]}],{"#f":3}],"#f":3}],"cave":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},{"#":"v_act3/northBoat"},"^She approached the boat from Kari's drawings and called out his name. There was no answer. That can't be right, he had to be here. He must be sleeping. This place was in all of his drawings. Where else could he have gone?","\n","^She tried to get a closer look and finally noticed the massive eagle that had nested on the hull of the boat, right near the entrance. It sat at the helm staring at Alex, menacingly waiting for her to make a move. Maybe Kari wouldn't come out because he was afraid. Alex needed to get rid of it. ",{"->":"cave.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex approached the eagle","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex threw a pebble at the eagle","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex looked for another way in","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex kicked up sand","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex shouted","/str",{"VAR?":"eagle_attempts"},2,">","/ev",{"*":".^.c-4","flg":21},"ev","str","^Alex entered the boat","/str",{"VAR?":"eagle_gone"},"/ev",{"*":".^.c-5","flg":21},{"c-0":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^Alex approached the boat slowly, carefully eyeing the eagle. As soon as she got close, it flapped its wings and brandished its sharp talons. She wouldn't be getting in with the eagle still there. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^She chucked a pebble near the eagle, hoping that that would scare it. She was shocked when it actually hit. And even more shocked when the eagle does not react. It just continued to look at her with its piercing gaze.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^She walked around to the front of the boat, making sure she kept her distance from the bird. ","ev",{"VAR?":"hurt_leg"},"/ev",[{"->":".^.b","c":true},{"b":["^She suddenly felt a sharp pain in the leg she hurt while jumping. It brings her to her knees and Alex laid in the sand until it went away. She limped the rest of the way there.",{"->":".^.^.^.12"},null]}],"nop","^ The hull of the boat, with its warped and rusted metal, towered over her.","\n","^Alex found no way in.","\n",{"->":".^.^.^"},{"#f":7}],"c-3":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^Alex started stomping and kicking, hoping that if she caused enough commotion the eagle would just leave. But it didn't, it just stared at her, unamused by her tantrum.","\n",{"->":".^.^.^"},{"#f":7}],"c-4":["\n",{"#":"t_speedUp"},"^She was tired and in pain and she just wanted to find Kari and go home. You was so frustrated that she started to cry. Alex yelled out for Kari. He has to be there, she had worked so hard to get here.","\n","^It screeched back, flapped its wings, and swooped toward Alex. She closed her eyes and ducked.","\n","^She felt wind rush over her head and a talon slash into her shoulder.","\n",{"#":"t_reset"},"^Alex stayed folded over in fear for a while until she no longer heard the flapping of the eagle's wings, leaving only a feather behind. She took it, as a reminder.","\n","ev",1,"/ev",{"temp=":"eagle_gone","re":true},{"->":".^.^.^"},{"#f":7}],"c-5":[{"->":"act3Boat"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"cliff":[{"->":".^.intro"},{"intro":[{"#":"v_act3/northHilltop"},"^The summit of this very steep hill overlooked the shore. It ended in a rocky ledge high over the beach. In the distance, she could see the boat Kari that must have been talking about sitting on the shore. She had to find a way down this cliff. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex climbed down the rocky cliff","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex looked for a smaller ledge","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex jumped down","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","ev",{"VAR?":"fucked_hands"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ She found some stable footing on the side of the cliff and thought she might be able to climb down safely. That didn't keep her hands from shaking though. She was almost to the bottom when her hand slipped and she fell backwards. She landed in the sand with no injuries but the wind knocked out of her.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^She found some stable footing on the side of the cliff and thought she might be able to climb down safely. She moved carefully only changing her grip when she knew it was safe. The cuts in her hands started burning, in a lapse of focus she let go and fell back on the sand. She felt the impact rattle every bone in her body. ",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^Stamina = Stamina - 10",{"->":".^.^.11"},null],"#f":5}],{"->":".^.^.^.18"},null]}],"nop","^ ",{"->":"shore"},"\n",{"#f":7}],"c-1":["^ She walked along the edge of the cliff looking for a safer point to get onto the beach. She walked along the coast for what seemed like forever until the ledge dropped to a safe distance down. She eventually lost sight of the boat. ",{"->":"cliff.longWalk"},"\n",{"#f":7}],"c-2":["^ There was no time, Alex just knew Kari was down there! She hastily jumped off the ledge, hoping the soft sand would cushion her fall. She nearly landed on her feet, but collapsed to the ground when she landed. She felt a serious pain in her leg, and thought it would be best to keep off of it the rest of the journey.","\n","ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"hurt_leg","re":true},{"->":"shore"},{"#f":7}]}],{"#f":3}],"longWalk":[["^Alex was lost.","\n","^She walked along the shore hoping to pick up on any landmark that would lead her back to the boat. She wandered for so long she began to doubt she was going in the right direction.","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev","str","^Alex turned around","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex carried on","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",1,"/ev",{"temp=":"forward","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ ","\n","ev",{"VAR?":"forward"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",0,"/ev",{"temp=":"forward","re":true},{"->":".^.^.^.^.^"},{"->":".^.^.^.6"},null]}],"nop","\n","^Alex finally found the boat. She was out of breath, tired, and trembling but she made it.","\n",{"->":"shore"},{"#f":7}]}],{"#f":3}],"#f":3}],"shore":[{"->":".^.intro"},{"intro":[{"#":"s_audio/waves"},{"#":"v_act3/northCoveBoatFAR"},"^Walking upon the sandy shore, Alex saw the rotting old boat up ahead and it reminded her of going to the Rockaways with her parents. Pebbles lined the shore, smooth as sin as the waves washed over them. She thoguht it might finally be a good time to look around. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[[["ev",{"^->":"shore.main.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex skipped a stone","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^D:F,9:10 ^",{"->":"$r","var":true},null]}],"ev","str","^Alex took a break","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex listened to the waves","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex walked to the boat","/str",{"VAR?":"shore_attempts"},0,">","/ev",{"*":".^.c-3","flg":5},["ev",{"^->":"shore.main.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex examined the boat","/str","/ev",{"*":".^.^.c-4","flg":22},{"s":["^^I:J,4:5^",{"->":"$r","var":true},null]}],["ev",{"^->":"shore.main.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex examined the cliff","/str","/ev",{"*":".^.^.c-5","flg":22},{"s":["^^I:J,2:3^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"shore.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"^ She took a moment to just skip some rocks like she used to do with Dad. Everything so far had been so scary and Alex just now realized how much she wished her parents were here with her now. ","ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^ The salt water from the pebble stung her hands.",{"->":".^.^.^.11"},null]}],"nop","\n","^She started to feel a little better after a while and took a breath.","\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ Alex sat by the shore and watched the waves as they crashed onto the sand. She regained some strength from her long journey.","\n","ev",{"VAR?":"long_walk"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ She remembered what her mother told her and take in the sounds of the ocean. She thought back to the ordeal at the cliff and shuddered. She wished her mom was actually there with her.","\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},"ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":"cave"},"\n",{"#f":7}],"c-4":["ev",{"^->":"shore.main.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"^ The rickety boat wass probably missing more planks than it still had left, Alex wasn't exactly sure how it was still standing. The mildewy flag was swaying in the ocean breeze. ","\n","ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}],"c-5":["ev",{"^->":"shore.main.0.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"^ Alex took a minute to look back at what she just did and shudder. That was so dangerous! How does Kari do this? But all the cuts and bruises would be worth it once she brought Kari home.","\n","ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"west":[{"#":"t_reset"},"^Looking around, the fields around you feel quiet and empty.","\n",{"->":"lady"},{"#f":3}],"lady":[{"->":".^.intro"},{"intro":[{"#":"s_audio/COW OUTSIDE"},{"#":"v_act4/barnEx"},"^You can still see Grandpa and Audi talking through the window. Every once in a while, he will glance over at you and give you a look you don't understand. With the barn behind you, you are disgusted by the smell of manure drifting through the air.","\n","^You don't even know how to milk a cow, but to protest would be pointless. You roll your sleeves up.","\n",{"->":"lady.main"},{"#f":3}],"main":[["ev","str","^Examine Grandpa","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go to pasture","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Show Grandpa","/str",{"VAR?":"cow1milked"},{"VAR?":"cow2milked"},"&&",{"VAR?":"cow3milked"},"&&","/ev",{"*":".^.c-2","flg":5},{"c-0":["^ He feels like a stranger to you now. You've only known him for a a day or so and he already hates you. Why? What did you do? He changed so quickly, it really scares you. Now you have to milk a cow? You don't even know how to milk a cow! You need to be looking for Kari but you're too scared to tell him that.  ","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^You head towards the cow smell reluctantly. You don't want to do this, your stomach churns at the thought of what you have to do. ",{"->":"pasture"},"\n",{"#f":7}],"c-2":["^ ",{"->":"grandpayelling"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},"^You stop at foot of some rolling hills. You are astonished by the size of this farm. You see cows roaming all around, lazily chewing grass. Speckled bushes sprout wildly along the field to your right. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[[{"#":"v_act4/hillBushes"},["ev",{"^->":"pasture.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine bushes","/str",{"VAR?":"eatenBerries"},"!",{"VAR?":"hasBerries"},"!","||","/ev",{"*":".^.^.c-0","flg":7},{"s":["^^H:J,7:9 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^A:F,6:7 ^A:D,8:10 ^E,8^",{"->":"$r","var":true},null]}],"ev","str","^Go forward","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Go right","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Go back","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["ev",{"^->":"pasture.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"^ ",{"->":"pasture.bushes"},"\n",{"#f":7}],"c-1":["ev",{"^->":"pasture.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow1milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was a nice cow ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture.cow1"},{"->":".^.^.^.17"},null]}],"nop","^ You don't feel like your ready to do that yet. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ ",{"->":"pasture2"},"\n",{"#f":7}],"c-3":["^ ",{"->":"pasture3"},"\n",{"#f":7}],"c-4":["^ ",{"->":"lady"},"\n",{"#f":7}]}],{"#f":3}],"bushes":[["^You look at the bushes and find brightly colored berries hanging from the branches.","\n","ev","str","^Eat Berries","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Put Berries in Pocket","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Step Away","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ You shove some berries in your mouth. Their sweet taste make you feel a little better and they make you feel light headed.","\n","ev",{"VAR?":"stamina"},10,"+",{"temp=":"stamina","re":true},"/ev","ev",1,"/ev",{"temp=":"eatenBerries","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ You pocket some berries for later, they have to be here for a reason. ","\n","ev",1,"/ev",{"temp=":"hasBerries","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["^ You remind yourself of the task at hand and decide to move on. ","\n",{"->":"pasture.main"},{"#f":7}]}],{"#f":3}],"cow1":[["^You feel the body heat of the cow on your skin. It exhales loudly once you crouch down. You seem more nervous than it does.","\n","ev","str","^Pet the Cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Scratch Behind Its Ears","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Milk Cow","/str",{"VAR?":"cow1milked"},"!","/ev",{"*":".^.c-2","flg":5},"ev","str","^Step Away","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^Your hands tremble a little bit as you pet the cow. You have never seen an animal of this size in person before. This whole trip has been a stark change from your New York home, leaving you nervous and uncomphotable. The cow, on the other hand, seems at ease even going so far as to move closer to you.","\n","ev",1,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["\n","^You try scratching behind her ears, like a dog. It snorts furiously and trashs her head angrily. This scares you even more. You don't know how to approach these animals. If you can't even soothe them properly, how are you going to milk them?","\n","ev",{"VAR?":"stamina"},5,"-",{"temp=":"stamina","re":true},"/ev","ev",0,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow1milked","re":true},{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow1Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You pull out the bucket, sit down, and stare at the udders. You don't like how they feel in your hands. They're fleshy, moist, and warm to the touch. You feel sick every time you squeeze them. You try not to gag while the bucket fills. ",{"->":"pasture.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow1Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You reach down and the cow stomps her foot. You are scared to go any further. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.37"},null]}],"nop","\n",{"#f":7}],"c-3":["^ ",{"->":"pasture.main"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture2":[{"->":".^.intro"},{"intro":["^Audi's property goes on for what seemes like miles. You have yet to even see a fence anywhere. The cows seem to just wander where they please.","\n",{"->":".^.^.main"},{"#f":3}],"main":[[{"#":"v_act4/hill"},["ev",{"^->":"pasture2.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine sky","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^A:J,1:4^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture2.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^H:J,5:10^",{"->":"$r","var":true},null]}],"ev","str","^Go back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"pasture2.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^The clouds are thin, as if they were smeared across the sky. It looks like its getting late. You are cold, you want to go home.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"pasture2.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow2milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was also a nice cow. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture2.cow2"},{"->":".^.^.^.17"},null]}],"nop","^ You don't feel like your ready to do that yet. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow2":[["^You see the cow periodically rustle through the bushes looking for something. It immediately stops and stares at you when you approach.","\n","ev","str","^Give The Cow What It Wants","/str",{"VAR?":"cow2Soothed"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Milk Cow","/str",{"VAR?":"cow2milked"},"!",{"VAR?":"cow2Soothed"},"&&","/ev",{"*":".^.c-1","flg":5},"ev","str","^Step Away","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",{"VAR?":"hasBerries"},"/ev",[{"->":".^.b","c":true},{"b":["^ You take some berries out of your pocket to feed the cow some berries. You feel its tounge brush up against your hand as it takes them. It nuzzles your hand once it finishes chewing.",{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"hasBerries"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow2Soothed","re":true},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBerries"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You don't know what you can do.",{"->":".^.^.^.18"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"cow2Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow2milked","re":true},{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You tug on the udders hoping to get this over with as soon as possible. The cow cries out in pain and knocks you to the ground when you get up you see the bucket contains drops of blood. ",{"->":"pasture2.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow2Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"stamina"},5,"-",{"temp=":"stamina","re":true},"/ev",{"->":".^.^.^.37"},null]}],"nop","\n","ev",{"VAR?":"cow2Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You get closer and the cow squeals and stomps off angrily, stepping on your foot on the way out. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.44"},null]}],"nop","\n",{"#f":7}],"c-2":["^ ",{"->":"pasture2.main"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture3":[{"->":".^.intro"},{"intro":["^Your feet start to hurt again. You haven't really had a chance to fully recover from yesterday. Everything is moving so fast but it feels like you have made so little progress in finding your cousin.","\n",{"->":".^.^.main"},{"#f":3}],"main":[[{"#":"v_act4/hillnonebucket"},"ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n",{"#":"v_act4/hillBucket"},{"->":".^.^.^.6"},null]}],"nop","\n",["ev",{"^->":"pasture3.main.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine bucket","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^B:C,8:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture3.main.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^F:H,6:9 ^E:F,8:10 ^",{"->":"$r","var":true},null]}],"ev","str","^Go back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"pasture3.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^You see a metal bucket just lying on the floor. It is dented all over and a little dirty but it should do the trick.","\n","ev",1,"/ev",{"temp=":"hasBucket","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"pasture3.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow3milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was the nicest cow of all. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture3.cow3"},{"->":".^.^.^.17"},null]}],"nop","^","\n","^You don't feel like your ready to do that yet.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow3":[["^This cow fidgets constantly, sporadically swatting its tail and kicking its feet.","\n","ev","str","^Talk to the cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Milk Cow","/str",{"VAR?":"cow3milked"},"!","/ev",{"*":".^.c-1","flg":5},"ev","str","^Step Away","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^You apologize for what you are about to do. You don't want to hurt it and your not here by choice. It seems to stop kicking and stay still.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow3milked","re":true},{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"pasture3.cowtail"},{"#f":7}],"c-2":["^ ",{"->":"pasture3.main"},"\n",{"#f":7}]}],{"#f":3}],"cowtail":[["^You sit down to milk the cow and the cow turns away. You try to move with it, being careful of its feet. Once you finally settle it down, the cow slaps you in the face with its tail. You move around hoping to get out of its reach but the cow moves with you. You start to get angry.","\n","ev",1,"/ev",{"temp=":"cow3milked","re":true},"ev","str","^Swat the tail away","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ignore it","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You get frustrated and slap the tail out of your face. This startles the cow and it kicks its hind legs. They narrowly miss you. But if it hadn't you would have been seriously injured. You hastily squeeze the milk you need ignoring every swat in the face.","\n","ev",{"VAR?":"stamina"},15,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":"pasture3.main"},{"#f":7}],"c-1":["^ As best you can you try to ignore the tail in your face. Its hairs are coarse scratching up your face, getting in your eyes and mouth. Your face itches after every hit and you start to notice how bad this cow smells. You can hardly see, sometimes your hands jerk in reaction and milk sprays all over you. Despite this you get your milk even if most of it ended up on you. ","\n","ev",{"VAR?":"stamina"},10,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":"pasture3.main"},{"#f":7}]}],{"#f":3}],"#f":3}],"mountain1":[{"->":".^.intro"},{"intro":[{"#":"v_act5/snowentrance"},"^You are already very high up. Behind you, you can see the glint of the ocean in the horizon. Snow crunches beneath your feet. Coming from New York, you were prepared for snow but not like this. Sleet slashes at your face. The blanket helps but not much. You now face foreward, looking up at the mountain top. A muddy road lies ahead of you. You feel closer to Kari than ever before. Audi told you there would people up here who can help.","\n",{"->":".^.^.main"},{"#f":3}],"main":[["ev","str","^Examine Sign","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine Rocks","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Walk Up The Trail","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ The sign point toward the trail. \"Stay On The Path! -Jóhannson Ski\" ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ Everything here is covered in dense ice. Its a much crueler cold here than it is in New York. The ice is harder and the winds are stronger. Everything is so open, making you feel more vulerable than ever before.",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ You trudge up the hill, slowly bracing yourself against the wind. ",{"->":"fork"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"fork":["^With the wind blowing in your face, its hard to tell whats in front of you. Looking ahead hurts your eyes and any exposed skin stings whenever the ice touches it. You think the trail ends here but your not entirely sure. You don't know were to go but you know you need to push foreward.","\n",{"->":".^.main"},{"main":[["ev","str","^Go Left","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go Right","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ You veer left searching for anything that can point you in the correct direction. You thought you saw a trail here but everything just seems muddy and wet. The ground under you feels soft though kind of like gravel. You take that as a good sign. ",{"->":"mountain2"},"\n",{"#f":7}],"c-1":["^ You stomp through the wet ground veering right. You have no idea where you are going, but you know you are headed up hill. The house is definitely uphill, all you can do is climb up and hope for the best.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain2"},{"#f":7}]}],{"#f":3}],"#f":3}],"mountain2":[[{"#":"v_act5/snowymountain"},"^The higher you climb the icier it gets. The ground has slowly been hardening beneath you and it is now to the point where you start to slip.","\n","ev","str","^Walk in the Snow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Slow your Pace","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Grab a Walking Stick","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ","\n","^You remember what happened on the beach and you decide not to take you chances. You move away from the rocky terrain and find an area that is covered in snow. Its is surprisingly deep and some snow seeps into your boots. You feel a shock as the snow starts to chill your feet, but its still better than slipping and falling.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain3"},{"#f":7}],"c-1":["\n","^You keep your steps light and careful. You are so high up and the last thing you want is to loose your balance. You carry on in the same direction hopeful this whole ordeal will be over soon. It doesn't feel right slowing down. You feel like your grandpa could be right behind you, but there is no way he knows where you are.","\n",{"->":"mountain3"},{"#f":7}],"c-2":["\n","^You find an old branch on the ground and decide it would make the perfect companion to traversing this mountain. When you put your weight on it, you immediately slip and fall. You land on your arm sevearly bruising it. You brace yourself ready to tumble down the side of the mountain but that moment never happens. You just get back up and push your self to go further.","\n","ev",{"VAR?":"Stamina"},10,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain3"},{"#f":7}]}],{"#f":3}],"mountain3":[{"#":"v_act5/snowyrockypath"},"^You no longer know where you are and the terrain ahead is not exactly walkable. Boulders about the size of you seem to have fallen over the cliff above blocking your path forward. You stop and take in the situation- Lost in the mountains, alone. If you die, no one will be able to find your body. Your parents will have two lost children and it will have been all your fault. You have no idea how you're going to climb over these massive rocks but you need to, you need to end this no matter what happens to you.","\n",{"->":".^.main"},{"main":[["ev","str","^Use Your Blankets A Rope","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Squeeze through the Gaps","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Find a Safer Path","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^You wrap your blanket around sharp point in the rocks and pull yourself up on top. You make it through safely but your blanket is now mangled and soaking wet. You throw it aside and soon realize how warm it was keeping you. You are shivering the rest of the way.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"ending"},{"#f":7}],"c-1":["\n","^You try to squeeze through the gaps of the boulders. Very quickly you realize how tight these gaps are but you don't want to risk climbing again. You desperately squeeze yourself as far as you can.","\n","^And then you stop. You can't push any further. You're stuck. You thrash violently trying to pull the left half of your body through. You're so close, so close, please. You cry for your parents, for anybody but nobody comes. You go limp. You are tired, confused and scared. You just want to give up and just as you start to slide down the gap and fall to the floor. It takes you a second to realize what happened. You wiggle free, sit down,  take a breath, and force yourself foreward.","\n","ev",{"VAR?":"Stamina"},10,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"ending"},{"#f":7}],"c-2":["^ You walk around the cliffside looking for a better path. You frantically pace around not ready to risk your life climbing something again. You search a bit more. And then a bit more. There has to be a better way. You are unable to find one. ","\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"ending":["^You wipe away the tears see lights in the distance. You realize what they are and start running to the house.","\n",{"->":"act5Arrival"},{"#f":3}],"epilogue":["end",{"#f":3}],"global decl":["ev",0,{"VAR=":"has_drawing"},0,{"VAR=":"given_drawing"},0,{"VAR=":"wight_drawn"},0,{"VAR=":"followedKari"},0,{"VAR=":"hasLighter"},0,{"VAR=":"hasPapers"},0,{"VAR=":"foundClues"},0,{"VAR=":"hurt_leg"},0,{"VAR=":"long_walk"},0,{"VAR=":"fucked_hands"},0,{"VAR=":"Gone_forth"},0,{"VAR=":"eagle_attempts"},0,{"VAR=":"shore_attempts"},1,{"VAR=":"forward"},0,{"VAR=":"eagle_gone"},0,{"VAR=":"hasBerries"},0,{"VAR=":"eatenBerries"},0,{"VAR=":"givenBerries"},100,{"VAR=":"stamina"},0,{"VAR=":"hasBucket"},0,{"VAR=":"cow1Soothed"},0,{"VAR=":"milk"},0,{"VAR=":"cow2Soothed"},0,{"VAR=":"cow3Soothed"},0,{"VAR=":"cow1milked"},0,{"VAR=":"cow2milked"},0,{"VAR=":"cow3milked"},100,{"VAR=":"Stamina"},0,{"VAR=":"coin"},0,{"VAR=":"seenBoat"},0,{"VAR=":"hateAskNum"},0,{"VAR=":"kindredAskNum"},0,{"VAR=":"grandpaPlanNum"},"/ev","end",null],"#f":3}],"listDefs":{}}