{"inkVersion":18,"root":[["^[player:5da4b3ff:voices/","\n","^[kari:a88533ff:voices/","\n","^[mom:9b67a7ff:voices/","\n","^[dad:677b46ff:voices/","\n","^[grandpa:ae2a19ff:voices/","\n","^[audie:ef8100ff:voices/","\n","^[brynja:df48c1ff:voices/","\n","^[asta:156546ff:voices/","\n","^BEGIN","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n",{"->":"start"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"start":[{"->":"beginning"},{"#f":3}],"beginning":[[{"#":"s_audio/waves"},{"#":"s_audio/WAVESMENUSPROLOGUE_m"},{"#":"v_prologue/kariColdOpen"},{"#":"v_wait"},"^The Offering","\n",{"#":"v_prologue/alexCarShot"},"^Alex found a nook in the ferry where she couldn't see the water. Even though her dad told her that being inside would only make her more seasick, she would rather be here than on the deck.","\n","^Looking at the desolate coast of rural Iceland just made Alex want to go home. She wished her parents hadn't come from a town so far away, and her stomach churned thinking about how much time she'd have to spend in the rental car before arriving at her Grandfather's house.","\n","^At least here it was quiet, and she could draw until her mother found her.","\n",{"#":"v_prologue/momCarShot"},"^:mom:\"Jesus, Alex, what are you doing down here? I can barely breathe with these fumes, and - if a brake malfunctions? A car could start rolling and run you over. Look at me when I’m talking to you.\":","\n","^Alex's mom took away her journal and pencils.","\n","^:mom:\"I know you don't want to be here, but you have to trust me. I'll explain soon, but you have to do exactly what I say until we leave here. No running off. Just be good for two days. Understand?\":","\n",["ev",{"^->":"beginning.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Alex nodded yes.",{"->":"$r","var":true},null]}],["ev",{"^->":"beginning.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Alex rolled her eyes. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"beginning.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["ev",{"^->":"beginning.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"^ Her mom scoffed before saying, ","<>","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom:\"Come back up to the deck with me.\":","\n",["ev",{"^->":"beginning.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^go up","/str","/ev",{"*":".^.^.c-2","flg":22},{"s":["^^B:C,4:5 ^",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"beginning.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"#":"v_prologue/ferry"},{"#":"v_clearScreen"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^Alex and her mom walked onto the deck and found her father.","\n","^:mom:\"Einar. She was hiding by the cars,\": she said.","\n","^Dad frowned.","\n","^:dad:\"Alex, I told you not to move from the bench.\":","\n","ev","str","^Alex tried to explain herself","/str","/ev",{"*":".^.c-3","flg":20},["ev",{"^->":"beginning.0.g-1.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^Alex kept quiet. ",{"->":"$r","var":true},null]}],{"c-3":["^ Alex tried to explain herself. :player:\"I wanted to draw,\": she said. Mom gave dad an angry look, and they silently decided that he would be the one to talk to Alex.","\n","^:dad:\"I understand, but I need you to stay with us. Look, until the end of the trip, you can only draw in the car. Otherwise, you have to pay attention, krútt. I need you to talk to me, and I promise this trip will be over soon.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["ev",{"^->":"beginning.0.g-1.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","^Mom and Dad looked at eachother and silently decided that he would be the one to talk to Alex.","\n","^:dad:\"Until the end of the trip, you can only draw in the car. Otherwise, you have to pay attention, krútt. I need you to talk to me, and I promise this trip will pass by fast.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Not quite satisfied but too anxious to continue, Mom stepped away to smoke a cigarette. Dad started to say something to her, then decided against it.","\n","^:dad:\"Are you excited to meet your cousin?\":","\n",["ev",{"^->":"beginning.0.g-2.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^Alex answered yes. ",{"->":"$r","var":true},null]}],["ev",{"^->":"beginning.0.g-2.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":18},{"s":["^Alex answered no.",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"beginning.0.g-2.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^:player:\"I think so,\": she said.","\n","^:dad:\"I definitely am,\": dad said. :dad:\"He was born after your mom and I moved away, but his mother was a great woman, and I'm sure he takes after her. Kari is two years younger than you, but I think you two will get along famously.\":","\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-6":["ev",{"^->":"beginning.0.g-2.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^:player:\"Not really. I don't know what he's like,\": she said.","\n","^:dad:\"To tell you the truth, I don't know either. He was born after your mother and I moved away, so I've never met him. But he's family, so we ought to give him a chance, right? His mother was a great woman. I bet you two will get along famously.\":","\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":[{"->":"ACT1"},{"#f":7}]}],{"#f":3}],"ACT1":[{"->":"town"},{"#f":3}],"town":[{"->":".^.intro"},{"intro":[[{"#":"s_stop"},{"#":"v_act1/dock"},"^The ferry pulled into the harbor and Alex's family drove off in their rental car. The town of Fjallvík is small, it took less than five minutes to drive slowly to its limits. On the way Alex noticed a fish market, school house, and general store, along with some tour advertisements for hiking, skiing, horse stables, and fishing.","\n","ev","str","^Alex sat in silence","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex started sketching","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad:\"When I was a kid, there wasn't anything here except for a small dock that your grandfather built. I would go out fishing with him every morning and sell what we caught at the market back across the bay in Dalvík.","\n","ev","str","^Alex drew","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex looked at the floor","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex stared out the window","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:dad:\"Now there are lots of tourists coming to see the mountains. They're even developing the area for skiing. My father lives in town here. After dinner we'll go to their place to stay the night.\":","\n",{"->":"arrival"},{"#f":7}]}],{"#f":3}],"#f":3}],"arrival":[["^Alex spent the next forty minutes managing her nausea as her father drove them through vast expanses of completely empty land - a tunnel burrowed through the snowy grey mountains behind the port to reveal a wide green valley with no civilization in sight.  Eventually, Alex's family pulled up to a small house. An old man who Alex knew must be her grandfather stood out front.","\n",{"#":"v_act1/houseExterior"},"^:mom:\"Leave your things in the car, Alex.\":","\n","^Her parents got out of the car, and to prove a point Alex waited for her mother's approval to follow. Grandfather shook dad's hand, and then him and Mom looked at eachother and said a few words. Alex watched intently. Grandfather gestured towards her, and mom motioned for her to come out of the car.","\n","ev","str","^Alex got out of the car","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex refused to get out of the car","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^     Alex got out of the car and walked to the house, getting a better look at her Grandfather - she realized that were he not hunched over a cane he would be an enormously tall man. Even decrepit like this he was a very imposing figure, but Alex couldn't get a read on his expression. It was the kind of disapproving frown that was typical for old men, but there was something so relaxed about Grandpa Jorgur that Alex felt even more small. ","\n","^To his right, she realized, was her younger cousin, Kari, hiding behind her grandfather's legs. He looked to be around 11 years old. Kari stared at her, mesmerized.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ Alex refused to get out of the car, and slowly her mom walked over to her. She jerked the door open. Alex flinched, but when she looked up, her mom wouldn't meet her gaze. Alex slid out of the back seat and walked to the porch, Fjola following behind.","\n","^Alex got out of the car and walked to the house, getting a better look at her Grandfather - she realized that were he not hunched over a cane he would be an enormously tall man. Even decrepit like this he was a very imposing figure, but Alex couldn't get a read on his expression. It was the kind of disapproving frown that was typical for old men, but there was something so relaxed about Grandfather Jorgur that Alex felt even more small.","\n","^To his right was Alex's younger cousin, Kari, who looked to be around 11 years old. He gawked at her, mesmerized.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandfather spoke to Alex in English, fumbling with through the words-","\n","^:grandpa: \"So... you are the one I've waited so long to meet. You look just like your mother.\":","\n","^They all stood there while Alex's Grandfather eyed her up and down before making sullen eye contact with Fjola.","\n","^:grandpa:\"My name is Jorgur. I am absolutely thrilled you are here. Kari, introduce yourself.\":","\n","^Kari spoke deliberately. Alex assumed he was nervous.","\n","^:kari:\"Hello cousin, my name is Kari. Good to meet you.\":","\n","^:grandpa:\"Come inside, everyone.\":","\n","ev","str","^Alex followed","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex introduced herself to her cousin","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["^ ",{"->":"intro_livingroom"},"\n",{"#f":7}],"c-3":["\n","^Alex decided to introduce herself to her cousin.","\n","^:player:\"Hey, I'm Alex,\": she said. Kari lowered his voice.","\n","^:kari:\"Hey! It's so amazing to meet you. Wow, okay, come inside!\":","\n",["ev","str","^Alex followed","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Alex followed Kari in.","\n",{"->":"intro_livingroom"},{"#f":7}]}],{"#f":7}],"#f":7}]}],{"#f":3}],"intro_livingroom":[[{"#":"v_act1/houseInterior"},"^Jorgur walked into the house and took a seat.","\n","^:grandpa:\"Welcome back.\":","\n","^:dad:\"It looks just like it did when we left,\": Dad said.","\n","^Mom squeezed Alex's shoulder.","\n","^:grandpa:\"Kari, show your cousin around the house.\":","\n","^Kari's head shot down towards his feet.","\n","^:kari:\"Yes, grandfather.\": He looks at you.","\n","^:kari:\"Cousin, follow me upstairs?\":","\n",["ev",{"^->":"intro_livingroom.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go upstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"intro_livingroom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],"\n",{"->":"intro_upstairs"},{"#f":7}]}],{"#f":3}],"intro_upstairs":[[{"#":"v_act1/bedroomKari"},{"#":"s_audio/FootStep(Inside)_s"},["^:kari:\"...and this is my room! What do you think?\":","\n","^Alex stepped into her cousin's room. There were drawings scattered everywhere, on almost every surface. Alex might have wished she was allowed to keep her drawings on display like this, but something about Kari's room made her uneasy. Maybe it was the fact that the drawings were so incongruous. Looking closer, she realized that almost all the drawings were of the same four creatures over and over- a dragon, a bird, a bull, and a giant.","\n","ev","str","^It's nice","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Weird drawings","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Boring","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"It's a nice room. I like your drawings.\":","\n","^:kari:\"Thank you! Drawing is my favorite. Grandpa likes them too. He says I could be a famous artist one day. Here. I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player:\"Your drawings are strange.\":","\n","^:kari:\"You think so? Drawing is my favorite. Grandpa likes them too. He says I could be a famous artist one day. I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["^ :player:\"There's nothing fun up here.\":","\n","^:kari:\"I think drawing is fun. Grandpa likes my sketches, too. He says I could be a famous artist one day. Here, I made this for you.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^He handed Alex a crude drawing of a whale swimming towards an island with the four creatures on it.","\n","ev",1,"/ev",{"temp=":"has_drawing","re":true},"ev","str","^Alex thanked him","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex smiled awkwardly","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["^ Alex thanked Kari for the drawing. She wasn't sure what this meant, but she wanted to be polite. ","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["^ Alex smiled awkwardly. She wasn't sure what this meant, exactly.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Kari shifted a bit as he prepared to explain.","\n","^:kari:\"So this is - wait, um, do you speak Icelandic?\":","\n","^:player:\"A bit, but... not really,\": Alex admitted.","\n","^:kari:\"Oh! That's okay. So... this is a drawing of the four landvættir. I love to draw them. They are spirits that protect the land, and help the people who live with them. There are many different wights but these four are the most important.\":","\n","ev","str","^Alex remembered the story","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^Alex started to remember the story her father had told her once when she was very little. :player:\"And an evil king sent his wizard to attack Iceland in the form of a whale?\":","\n","^:kari:\"Yes!\": Kari replied. :kari:\"Wow... I am so happy you know the story.\":","\n","^Kari lowered his voice. :kari:\"Listen Alex, I need to tell you something. There are not any wights around this house anymore. They were driven away from here, but Grandpa says drawing them is a good way to pay tribute and invite them. I like to hang my drawings on the clothesline for them to see. I sit by the window and watch them move in the wind like they are here protecting us, and soon they will come. Would you like to draw landvættir with me?\":","\n",["ev",{"^->":"intro_upstairs.0.g-3.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":18},{"s":["^Alex accepted.",{"->":"$r","var":true},null]}],{"c-6":["ev",{"^->":"intro_upstairs.0.g-3.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":7}],"#f":7}],"g-4":["^Kari got Alex some charcoal and paper and the two cousins started to draw.","\n","ev","str","^Alex started with the dragon","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Alex started with the bird","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Alex started with the giant","/str","/ev",{"*":".^.c-9","flg":20},{"c-7":["^ Alex started by drawing the dragon wight.","\n","^:kari:\"Ooh, that's good! The dragon is super cool - it guards the east side of Iceland with other lizards and worms and snakes.\":","\n","ev",1,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"c-8":["^ Alex started by drawing the bird wight.","\n","^:kari:\"Ooh, that's good! The bird is super amazing - it guards the north side of Iceland with many other birds, great and small.\":","\n","ev",2,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"c-9":["^ Alex started by drawing the giant wight.","\n","^:kari:\"Ooh, that's good! The giant is super cool - he guards the south side of Iceland with many other jötnar.\":","\n","ev",4,"/ev",{"temp=":"wight_drawn","re":true},{"->":".^.^.^.g-5"},{"#f":7}],"#f":7}],"g-5":[{"->":".^.^.^.drawingConvo"},{"#f":7}]}],{"drawingConvo":[["ev","str","^Alex complimented Kari's drawing","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex asked his favorite wight","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Some time passed as they drew together.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ Alex complimented Kari's drawing. :player:\"Your cow is really cool too.\":","\n","^Kari giggled at this. :kari:\"It's not a cow, it's a bull! The bull is HUGE, and he wades into the water to the west and bellows out at the whale, with all the land wights behind him!\": At this, Kari jumped up and made the biggest roar he could - until he started coughing and collapsed onto the floor in a laughing fit. Alex tried to imagine a bull making a sound anything like this hyper little boy, and she started laughing along with him.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"Which is your favorite wight, Kari?\":","\n","^:kari:\"Ooh, that's hard. I think probably the bird. The birds can go anywhere they want.\":","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["\n",{"->":".^.^.^.^.predinner"},{"#f":7}]}],{"#f":3}],"predinner":[["^Some time passed as the pair studiously drew creatures of all sorts.","\n","^:kari:\"Hey Alex, what do you think of my English? I learn at school but Grandpa never allows me to use it. He hates English.\":","\n",{"#":"v_enter_act1/dadFade"},"^Before Alex could respond, her dad entered the room. :dad:\"Dinner is ready, kids.\":","\n","^:kari:\"Coming!\": Kari cheerfully replied.","\n",["ev",{"^->":"intro_upstairs.predinner.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go downstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^I:I,3:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"intro_upstairs.predinner.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],{"->":"dinner"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"dinner":[[{"#":"v_exit"},{"#":"v_act1/houseInterior"},{"#":"s_audio/FootStep(Inside)_s"},"^Alex walked downstairs to find Jorgur ladeling out fish stew and hunks of bread. Alex still felt sort of sick from traveling, and the strong odor just made it worse.","\n","ev","str","^Alex took a seat","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Alex sat at the small dinner table next to her cousin. The room until Einar cleared his throat.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad: \"Jorgur, I'm so sorry about Lilja. We wish we could have been here.\":","\n","^Grandpa looked at his plate. :grandpa:\"It was never the same after you left. She fell into a deep depression, and on top of the illness… it’s a shame you couldn’t see her before she died. It would have meant a lot to her.\":","\n","ev","str","^Alex ate her bread","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex tried the stew","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex didn't eat","/str","/ev",{"*":".^.c-3","flg":20},{"c-1":["^ Alex nibbled her bread, which was somewhat stale.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["^ Alex tried the stew, which was fishy and thin but warmed her up.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ Alex stared at her bowl without touching her food.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^Mom didn't look up from the table. :mom:\"Didn't you know she was sick? And yet you didn't take her to a single doctor?\":","\n","^:grandpa:\"You know it is not my way.\":","\n","^:mom:\"I should have been here to do something about it,”: she said. :mom:”We're only staying here for two days. After the funeral, we're leaving.\":","\n","^:grandpa: \"As you do.\":","\n","^After a moment, he turned to look at Alex and asked, :grandpa:\"What do you think of Iceland so far, little one?\":","\n","ev","str","^It's cold","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^It's beautiful","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^It's alright I guess","/str","/ev",{"*":".^.c-6","flg":20},{"c-4":["^ :player:\"It's very cold,\": she replied.","\n","^Grandfather laughed. :grandpa:\"You'll adjust to it soon! The Icelandic blood in you will come to the fore.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-5":["^ :player:\"It's beautiful,\": she replied.","\n","^:grandpa:\"This is the home of your forefathers, it is right for you to respect it.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-6":["^ :player:\"It's alright, I guess.\":","\n","^Grandfather squinted at Alex. :grandpa:\"You'll learn to love it. It's part of who you are. Right, Kari?\": Kari nodded in return. :kari:\"Yes, grandfather.\":","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Alex finished her dinner and was instructed to place her dish in the sink.","\n","^:grandpa:\"Kari, go play outside with Alex. Don't go too far.\":","\n","^Kari nodded. :kari:\"Yes, grandfather!\": he said. Kari and Alex started putting their shoes on.","\n","^:mom:\"Hold on, Alex. I think it's time for us to leave. We really need to be getting to Ólafur's.\":","\n","^At the mention of Ólafur's name, Jorgur grimaced. :grandpa:\"Fjola, let the children play for a little while. Ólafur is hardly any concern of mine, and after all, it's been years since I've seen you.\":","\n","^:mom:\"Alex, just... don't go far.\":","\n","^:player:\"I won't.\":","\n",["ev",{"^->":"dinner.0.g-2.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex followed Kari outside","/str","/ev",{"*":".^.^.c-7","flg":22},{"s":["^^I:I,3:7 ^",{"->":"$r","var":true},null]}],{"c-7":["ev",{"^->":"dinner.0.g-2.c-7.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],{"->":"ACT2"},"\n","done",{"#f":7}],"#f":7}]}],{"#f":3}],"ACT2":[{"->":"afterDinner"},{"#f":3}],"afterDinner":[[{"#":"v_clearScreen"},{"#":"v_act2/houseExteriorKari"},{"#":"s_audio/FootStep(Outside)_s"},"^:kari:\"Did you enjoy dinner?\":","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player: \"Yeah. Besides the smell.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player: \"How can you stand eating that fish? I feel like I'll never get the smell out of my nose\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Kari laughed.","\n","^:kari:\"We eat that almost every day though. I like it best when it's thicker. Anyway, I want to show you something. Follow me over here!\":","\n","^Before Alex could protest, Kari sped off toward the grassy hills behind the house. She figured she might as well follow.","\n",["ev",{"^->":"afterDinner.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Follow","/str","/ev",{"*":".^.^.c-2","flg":22},{"s":["^^I:J,3:5 ^",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"afterDinner.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],{"->":"enterwood1"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"enterwood1":[[{"#":"v_act2/east5Reverse"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex cleared the hill and couldn't believe how wide open everything was. The hills seemed to roll on for miles and miles, but it all seemed within reach.","\n","^:kari:\"This way, cousin! It's not too far!\": Kari ran along a brook and Alex tried to keep up.","\n",["ev",{"^->":"enterwood1.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Follow","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^H:I,7:9^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"enterwood1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],{"->":"campfire"},"\n",{"#f":7}]}],{"#f":3}],"campfire":[{"#":"v_act2/campfireKari"},{"#":"s_audio/Piano LeadUp_m"},"ev",{"VAR?":"coin"},1,"+",{"temp=":"coin","re":true},"/ev","^Alex wasn't sure how far she'd gone or how long it took by the time the cousins arrived at their destination. A lean-to and some logs sat around a fire pit. Kari stood proudly in the center of the campsite.","\n","^:kari:\"We made it, cousin! This is a very special place. Grandfather and I come here to pray, and sometimes camp! A few times a year, we gather with his friends for some bigger celebrations. There is always music and singing and good food! We used to do it more often. There used to be more people too.\": ",{"->":"cousinConvo_campfire"},"\n",{"#f":3}],"cousinConvo_campfire":[["ev","str","^Who else comes here?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Camping?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Celebrations?","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"Who else comes here?\": ","\n","^:kari:\"Well, it used to be Aunt Sigrún, Grandfather, Grandmother, Einar, Ólafur, Helga, Björn, Margrét, Ásta, Brynja, and Audhumbla.\": Kari looked around, some apprehension in his eyes. :kari:\"Now it’s just me, Audhumbla, and Grandfather.\": ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ :player:\"Camping?\": she asked. ","\n","^:kari:\"It's so nice and fun. We stay here for a few days and just relax and pray.\":","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ :player:\"Celebrations?\": ","\n","^:kari:\"Well, we perform the blót here, and make an offering to the gods or wights. On holidays we do one for all the gods.\":","\n",["ev","str","^How does it work?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ :player:\"How does it work?\": she asked.","\n",{"->":"wightPower"},{"#f":7}]}],{"#f":7}]}],{"#f":3}],"wightPower":[[{"#":"s_audio/ThunderRain"},["^Kari pulls out a piece of bread he’s bitten into the shape of a horse","\n","^:kari:\"Do you want to meet one of the land wights?\":","\n","ev","str","^Alex wanted to","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex asked if they were real","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex was scared","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^:player:\"Yeah.\":","\n","^:kari:\"Okay. They can be mischievous, so we have to be very polite.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["\n","^:player:\"Are they real?\":","\n","^:kari:\"Of course they're real!\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["\n","^:kari:\"I promise they won’t hurt you, it’ll be okay! We just have to remember to be super polite. They are a bit mischievous.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:kari:\"Here,\": he said, :kari:\"take a bite of this.:\"","\n","ev","str","^Take a bite","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Refuse","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n","^Alex bit off a chunk of the bread horse and handed it back to Kari, who chewed off one of the legs.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-4":["\n","^:player:\"Um, I don't think I want to. My stomach hurts.\":","\n","^:kari:\"Oh, that's okay. I'll take your bite,\": he said. Kari then chewed off two of the bread horse's legs.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^:kari:\"Now, we put our wishes into the bread. You go first. You don't have to tell me what you wish for.\":","\n","ev","str","^I wish I was home","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^I wish my parents would stop fighting","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^I wish I knew why my parents left this place","/str","/ev",{"*":".^.c-7","flg":20},{"c-5":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-6":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"c-7":["\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^:player:\"Okay, I made my wish.\":","\n","^:kari:\"I always wish for the wights to come back to our house to protect us. Okay, come here.\":","\n","^Kari led Alex over to a big rock. He got on his knees next to it and Alex followed. He started to speak in Icelandic. From what Alex knew of the language, it sounded like he was asking permission for something and introducing her. Kari finished, and the two stared at the rock in silence.","\n","^:player:\"Is something going to-\":","\n","^Sure enough, the biggest lizard Alex had ever seen crawled out from under the rock and sat on the top, eating the bread right out of Kari's hand. Alex couldn't take her eyes off of it.","\n","^:kari:\"I call this one Smorble,\": he whispered.","\n","^The lizard finished the bread, and started to stare right into Kari's eyes. Kari stared back.","\n","^:kari:\"I think he wants to show us something.\":","\n","^It turned to Alex. Alex forced herself to meet its gaze. Slowly, it crawled off the rock and onto Alex's leg.","\n","ev","str","^Remain calm","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Freak out","/str","/ev",{"*":".^.c-9","flg":20},{"c-8":["^ Alex took a deep breath and let the lizard crawl up her leg onto her stomach. From there, it seemed to stare even deeper into her soul. She kept her cool, and eventually it crawled down off of her, and started to slink towards the tree line.","\n","^:kari:\"We should follow it. Come on Alex!\":","\n",{"->":".^.^.^.g-4"},{"#f":7}],"c-9":["^ Alex couldn't handle the lizard on her body and frantically shook it off with a yelp.","\n","^:kari:\"Alex!\":","\n","^The lizard fell to the ground and started to crawl away towards the tree line.","\n","^:kari:\"Come on, it's leaving, we have to follow it!\":","\n",{"->":".^.^.^.g-4"},{"#f":7}],"#f":7}],"g-4":["^Alex wasn't sure this was a good idea. She had already gone much farther than her parents would have liked. On the other hand, Alex was curious to see what would happen if they followed this lizard.","\n","ev","str","^Alex followed Kari","/str","/ev",{"*":".^.c-10","flg":20},"ev","str","^Alex turned back","/str","/ev",{"*":".^.c-11","flg":20},{"c-10":["^ Kari had made up his mind, and Alex felt safer with him than without him. She started to chase after him.","\n","ev",1,"/ev",{"temp=":"followedKari","re":true},{"->":"eaststart"},{"#f":7}],"c-11":["^ Kari had made up his mind, and Alex knew that to protest would be pointless. Her parents would already be mad at her for being gone so long, following Kari now would be too much. She figured she could get back to Grandfather's house if she followed the stream. ","\n","ev",0,"/ev",{"temp=":"followedKari","re":true},{"->":"eaststart"},{"#f":7}],"#f":7}]}],{"#f":3}],"act2Home_outside":[[{"#":"v_clearScreen"},{"#":"s_audio/WAVESMENUSPROLOGUE_m"},{"#":"v_act2/houseExteriorParents"},"^Alex emerged from the trees and her parents ran to embrace her. She'd never seen them this upset. Dad was seemingly unable to speak.","\n","^:mom:\"Are you okay?\":","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"Yeah, I think so\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I was scared.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom: \"You look hurt... where is your cousin?\":","\n","ev",{"VAR?":"followedKari"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^.whereKariLeft"},{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"VAR?":"followedKari"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^.whereKariFollowed"},{"->":".^.^.^.16"},null]}],"nop","\n",{"#f":7}]}],{"whereKariFollowed":[["ev","str","^I lost him","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^He just disappeared","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I don't know","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player: \"It's all my fault, I tried to follow him but I couldn't keep up.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I ran after him and he just vanished\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^ :player:\"I don't know!\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":[{"->":".^.^.^.^.momScaredCont"},{"#f":7}]}],{"#f":3}],"whereKariLeft":[["ev","str","^I left him","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I don't know","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"He ran off... I didn't follow him because you told me not to go far\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I don't know!\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":[{"->":".^.^.^.^.momScaredCont"},{"#f":7}]}],{"#f":3}],"momScaredCont":[[["^:mom:\"Okay, okay. We're going to go look for him. Just go to bed and we'll find Kari.\":","\n","ev","str","^Okay","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I want to help","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:\"Okay.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player:\"I want to help.\" :","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:mom: \"We need you to stay here. I left some clothes for you in Kari's room. Just get into bed, don't go anywhere. We'll be back soon, krútt.\":","\n","ev","str","^Go inside","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":[{"->":"act2Home_inside"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"#f":3}],"act2Home_inside":[[{"#":"v_act2/houseInteriorGrandpa"},"^Alex walked inside with Grandpa.","\n","^:grandpa: \"Just you and me now, child.\":","\n","ev","str","^Are you concerned?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Do you know where Kari is?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Okay","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^:player:\"Are you scared about Kari?\": you ask.","\n","^:grandpa:\"Kari could not have gotten far. He is too weak. Here.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :player:\"I'm sure he is just out playing. He knows the area well, and does not have the determination to run away. Here.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^:player:\"Okay.\":","\n","ev",{"VAR?":"Stamina"},15,"+",{"temp=":"Stamina","re":true},"/ev",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandpa wets a cloth in the sink and cleans you up a bit. He gives you a bandage.","\n","^:grandpa:\"Okay, time for bed. Go upstairs.\":","\n",["ev",{"^->":"act2Home_inside.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go to bed","/str","/ev",{"*":".^.^.c-3","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"act2Home_inside.0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"act2Home_bedroom"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"act2Home_bedroom":[[{"#":"v_clearScreen"},{"#":"v_act2/bedroom"},"^Alex was exhausted. Her mom had left some clothes for her, as promised.","\n",["ev",{"^->":"act2Home_bedroom.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex changed and tried to sleep","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^A:F,5:8 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"act2Home_bedroom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Alex changed and tried to sleep. Not knowing when her parents would be back, Alex tossed and turned for the next few hours, hoping Kari would come through the door.","\n",{"#":"v_fadeOut"},{"#":"t_speedDown"},{"#":"t_speedDown"},{"#":"v_clearScreen"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:mom: \"Krútt... wake up...\":","\n",{"#":"t_reset"},{"#":"vact2/bedroomMom"},{"#":"v_fadeIn"},"^Alex's mother shook her awake.","\n","^She couldn't tell what time it was, but she knew she asleep longer than her mom told her she would be.","\n","^:mom: \"We went to the police across the bay. They're going to come in the morning to search for Kari but in the meantime Dad and I are going to keep looking. I left you some food in the fridge. Please stay here. I love you. \":","\n",{"#":"v_exit"},["ev",{"^->":"act2Home_bedroom.0.g-0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Alex drifted back to sleep. ",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"act2Home_bedroom.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],{"->":"ACT3"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"ACT3":[[{"#":"v_clearScreen"},{"#":"v_act3/bedroom"},{"#":"v_enter_act3/grandpaFade"},{"#":"v_fadeIn"},{"#":"s_audio/Somber_m"},"^:grandpa: \"Wake up child. While you stay here you will live like a member of our kindred.\":","\n","ev","str","^Alex refused to get up","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex got up","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Alex refused to get up.","\n","^:grandpa:\"I will not ask you again.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Alex begrudgingly got out of bed.","\n","ev","str","^Ask about Kari","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["^ Alex got up in a daze, and suddenly remembered the events of the previous night. She asked if Kari was back.","\n","^:grandpa: \"He didn't come home last night. Probably sleeping over at Audhumbla's. You don't understand. If you grew up here, you would not be afraid of the land. Come downstairs. Make yourself something to eat.\"","\n",{"->":"ACT3.0.g-1"},{"#f":7}],"#f":7}],"g-1":[["ev",{"^->":"ACT3.0.g-1.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go downstairs","/str","/ev",{"*":".^.^.c-3","flg":22},{"s":["^^I:J,3:7 ^",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"ACT3.0.g-1.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"ACT3.leaveHouse"},"\n",{"#f":7}],"#f":7}]}],{"leaveHouse":[{"#":"v_exit"},{"#":"v_act3/houseInterior"},"^Grandpa headed out the front door. Alex found some bread in the cabinet and started to eat it. Her parents still weren't back, and she was getting worried.","\n","^:grandpa: \"\":","\n",{"->":"ACT3.livingRoomPuzzle"},{"#f":3}],"livingRoomPuzzle":[[{"#":"v_act3/houseInterior"},["ev",{"^->":"ACT3.livingRoomPuzzle.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Climb through the window","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^B:C,2:3^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Cabinets","/str","/ev",{"*":".^.^.c-1","flg":22},{"s":["^^D:F,2:3^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Fireplace","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^A:B,4:7^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.livingRoomPuzzle.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Stairs","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"^ You could climb out the window but Grandpa would see you. You are going to need to do something more drastic. Cause a distraction, find a way to lure him into the house.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ You open up some cabniets to get some ideas. You see a lighter and take it.","\n","ev",1,"/ev",{"temp=":"hasLighter","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"^ ","ev",{"VAR?":"hasPapers"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You need something to burn if you're going to start a fire.",{"->":".^.^.^.12"},null]}],"nop","\n","ev",{"VAR?":"hasLighter"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You need something to start a fire.",{"->":".^.^.^.19"},null]}],"nop","\n","ev",{"VAR?":"hasPapers"},"!",{"VAR?":"hasLighter"},"!","||","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^"},{"->":".^.^.^.29"},null]}],"nop","\n","ev",{"VAR?":"hasPapers"},{"VAR?":"hasLighter"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You frantically throw in every thing you can into the fire place and light it on fire. Then hide around the corner.",{"->":".^.^.^.37"},null]}],"nop","\n",{"->":"ACT3.puzzleEnd"},{"#f":7}],"c-3":["ev",{"^->":"ACT3.livingRoomPuzzle.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"^ ",{"->":"ACT3.UpstairsPuzzle"},"\n",{"#f":7}]}],{"#f":3}],"UpstairsPuzzle":[[{"#":"v_act3/bedroom"},["ev",{"^->":"ACT3.UpstairsPuzzle.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Click Papers","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^G:H,8:8 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"ACT3.UpstairsPuzzle.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^down","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,3:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ACT3.UpstairsPuzzle.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"^ You pick up Kari's drawings. He wouldn't mind losing a few drawings if it meant saving his life. You glance over the papers and realize one of them features a map to a spot north of the house. You decide to pocket it.","\n","ev",1,"/ev",{"temp=":"hasPapers","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"ACT3.UpstairsPuzzle.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],{"->":"ACT3.livingRoomPuzzle"},"\n",{"#f":7}]}],{"#f":3}],"puzzleEnd":[["^Grandpa rushes in clearly confused about the fire. You take that chance to bolt through the door, knowing he won't ever be able to catch up. You can hear his shouting in the distance but you don't care. You have to find your cousin.","\n","ev","str","^Head North","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"trails"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"act3Boat":[{"#":"v_act3/boatInterior"},{"#":"v_clearScreen"},"ev",{"VAR?":"coin"},1,"+",{"temp=":"coin","re":true},"/ev","^Alex finally entered the boat to find a mess of drawings, notes, and trinkets. Kari had fashioned this place into a home, or maybe a studio. From the amount of stuff lying around, Alex assumed he must spend a lot of his time here.","\n",{"->":".^.Insideboat"},{"Diary":[["^Alex picked up a notebook and opened it to the first page.","\n","^:kari:\"I am writing this in english to practice. english feels more secret too. Last night mom was coughing a lot after dinner. I wanted to draw the wights with her but she said she had to rest. I made soup for mom and she went to bed early. I could hear her coughing in her room. I wanted to go lay with her but I don’t want to get sick too.\":","\n","ev","str","^Next entry","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex kept looking","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ Alex decided to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:kari:\"Grandfather let me stay home from school today so we could pray for mom to get better. Yesterday a friend in school said that when they got sick, they went to the doctor in Dalvík. I told Grandfather but he said that our family has been cursed since the landvættir fled and that doctors cannot help. I want the landvættir to come back because they would be able to help mom.\":","\n","ev","str","^Next entry","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Keep looking","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ Alex decided to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:kari: \"Mother passed to Valhalla last night. I know I should not be sad because she is with the spirits now, but I miss her. Breakfast always tasted best when she made it and she knew exactly how to put my socks on my feet so it was not uncomfortable. . Maybe she can talk to the landvættir and ask them to come back to our house and things will be a little better. I am excited because my cousin and aunt and uncle are coming to celebrate her. I really want to meet my cousin and I hope I can show her how great Asatru is. I hope what Grandfather says about them being traitors is not true. I have a good feeling about them, even though I have not met them yet.\":","\n","ev","str","^Keep looking","/str","/ev",{"*":".^.c-4","flg":4},{"c-4":["^ Alex decided to keep looking through the boat. ","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":"act3Boat.Insideboat"},{"#f":7}],"#f":7}]}],{"#f":3}],"Insideboat":[["ev","str","^Examine drawings","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Examine journal","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine trinkets","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Go Home","/str",{"VAR?":"seenBoat"},2,">","/ev",{"*":".^.c-3","flg":21},{"c-0":["^Alex examined the drawings.","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},"^Heaps of half-finished papers lay around the boat. Alex recognized them as his wight drawings, but these were far more intricate than the ones in Kari's bedroom. Many of the drawings were frantically scribbled out. In a few drawings, the wights appeared dead, with Xs in their eyes. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":[{"->":"act3Boat.Diary"},"\n",{"#f":7}],"c-2":["^ Scattered around the boat, Alex saw a bowl with some runes carved in it, some little hammers, twigs, a knife, and a hollowed-out wooden horn.","\n","ev",{"VAR?":"seenBoat"},1,"+","/ev",{"temp=":"seenBoat","re":true},{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":"act3HomeOutside"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"act3HomeOutside":[[{"#":"v_clearScreen"},{"#":"s_stop"},{"#":"v_act3/houseExterior"},"^Alex had seen enough in the boat and decided to go home. When she arrived back at Jorgur's house, she was bruised and thoroughly exhausted. Through the window she could see Grandpa napping in his chair.","\n","ev","str","^Alex walked right in","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex attempted to sneak in","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":".^.^.^.act3walkIn"},"\n",{"#f":7}],"c-1":[{"->":".^.^.^.act3Sneak"},"\n",{"#f":7}]}],{"act3Sneak":[[{"#":"v_act3/houseInterior"},"^Alex opened the door and couldn't mask the loud creak. She looked toward Grandpa’s chair, but he was nowhere to be seen.","\n",["ev",{"^->":"act3HomeOutside.act3Sneak.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Go upstairs","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^H:H,2:5 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"act3HomeOutside.act3Sneak.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":".^.^.^.^.act3SneakUpstairs"},"\n",{"#f":7}]}],{"#f":3}],"act3SneakUpstairs":[[{"#":"v_clearScreen"},{"#":"v_enter_act3/grandpaFade"},{"#":"v_act3/bedroom"},"^Grandpa stood in Kari's room with an angry look on his face.","\n","^:grandpa:\"Where have you been?\"","\n","ev","str","^Out looking for Kari","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Just getting some air","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Wanted to look at the mountains","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","\n",{"#":"t_speeddown"},"^:grandpa: \"You were told to stay in the house. Come downstairs. You will eat lunch, and then we leave.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#":"t_reset"},{"#f":7}],"c-1":["\n","^:grandpa: \"You should not leave the house without my permission. Come downstairs, I am to give you lunch and then we leave.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}],"c-2":["\n","^:grandpa: \"Hm. They are beautiful. Come downstairs, I am to give you lunch and then we leave.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}]}],{"#f":3}],"act3walkIn":[[{"#":"v_clearScreen"},{"#":"v_act3/houseInterior"},{"#":"v_enter_act3/grandpaFade"},"^Alex strolled into the house. Jorgur was sitting in his chair.","\n","^:grandpa: \"Oh, hello.\":","\n",{"#":"t_speeddown"},"ev","str","^Hello Grandpa","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Sup","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Hey","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"Hello grandpa\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^:player:\"Sup.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^:player:\"Hey.\":","\n",{"#":"t_reset"},{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Grandpa seemed unconcerned.","\n","^:grandpa:\"Hrmph. Where did you go? You seem hurt.\":","\n",{"#":"t_speeddown"},"ev","str","^Just getting some air","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Exploring","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Looking for Kari","/str","/ev",{"*":".^.c-5","flg":20},{"c-3":["^ :player:\"Just... getting some air.\":","\n",{"#":"t_reset"},"^:grandpa: \"Ah, good. The air here is the best you will find in the world.\"","\n",{"#":"t_speeddown"},{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["^:player:\"Um... exploring.\":","\n",{"#":"t_reset"},"^:grandpa: \"Ah. It's good for you.\":","\n",{"#":"t_speeddown"},{"->":".^.^.^.g-1"},{"#f":7}],"c-5":["^:player:\"I was looking for Kari\":","\n",{"#":"t_reset"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:grandpa: \"Hrmph. I told you he is just out playing.\":","\n",{"->":".^.^.^.^.act3Leaving"},{"#f":7}]}],{"#f":3}],"act3Leaving":[[["^:grandpa: \"Your parents asked I bring you to your father's family in the village. I do not go there anymore.\":","\n","ev","str","^Why?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Okay","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player: \"Why?\":","\n","^:grandpa:\"His family betrayed the kindred. They paid money to a foreigner for the land that is rightfully ours, to employ tourist guides to let them invade and deface our land.\":","\n","^:player: \"Huh.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-1":["^ :player: \"Okay.\":","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^:grandpa:\"Time to go.\":","\n",{"->":".^.^.^.^.act3car"},{"#f":7}]}],{"#f":3}],"act3walk":[{"->":".^.^.act3car"},{"#f":3}],"act3car":[[["^Alex and Jorgur got in his car and started to drive west.","\n",{"#":"v_exit"},{"->":"ACT4"},{"#f":7,"#n":"g-0"}],null],{"#f":3}],"#f":3}],"ACT4":[[{"#":"v_clearScreen"},{"#":"s_audio/Farm_m"},{"#":"v_act4/barnExterior"},"^Jorgur drove up to an old farm.","\n","ev",{"VAR?":"coin"},1,"+",{"temp=":"coin","re":true},"/ev","^:grandpa: “This is Audhumbla Ívarsdóttir’s house. She is the only remaining member of my kindred. Everyone else abandoned us to live with comforts, they abandoned the ways of our forefathers. I want you to see the life that we have.”:","\n","ev","str","^What about other grandparents?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Are we going to stay here for long?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ :player:”What about my other grandparents?”: Alex asked.","\n","^:grandpa:”They can wait.”:","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ :grandpa:”That is up to you.”:","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Jorgur pulled in and got out of the car. It took him a second. You both walk over to the house and Grandpa knocked on her door.","\n","^:audie:\"Halló, Jorgur,\": Alex heard from inside.","\n","^:grandpa: “Halló, Audie. [I have a visitor with me.]”","\n","^Suddenly the door swung open, and Audhumbla appeared before Alex. She was younger than Jorgur but still pretty old. She looked Alex up and down for a long time.","\n","^:audie:”You are the one I have been waiting to meet... Hm. You look nothing like your grandfather.”:","\n","^:grandpa:”This one has been out exploring. She thinks she’s one of the kindred.”:","\n","^She smiled.","\n","^:audie: ”I guess she’ll have to work like one. Go on, child. Go...:","\n",{"#":"t_speedDown"},{"#":"t_speedDown"},"^:audie:milk the cows.”:","\n","^Grandpa heads inside and they slam the door in your face.","\n",{"->":"west"},{"#f":7}]}],{"#f":3}],"grandpayelling":[[{"#":"v_clearScreen"},"^Alex knocked on the door and showed Grandpa the bucket of milk. He looks at you and looks at the bucket and snarled.","\n","^:grandpa: \"What is this? You call this milk? You are useless! Just like the rest of them, useless burdens on our town! Look at this, it's pink! Blood! How dare you hurt those cows with your stupid city girl hands. Did you even strip them? Are you trying to make me sick?\"","\n","ev","str","^Try to explain","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Alex stammered trying to find a response but was too scared. ","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:grandpa: \"Useless, stupid girl! I'll show you how someone of my family should milk a cow.\"","\n","^Audhumbla calls from inside - :audie:\"That's enough, Jorgur. Bring her inside!\":","\n","^Grandpa snapped back, :grandpa:\"Quiet! This is my grandchild and I will do as I please.\":","\n","^He pulled Alex by the ear and she yelped in pain. He did not let go. She pulled against his grip, but he was shockingly strong","\n","ev","str","^Cry out","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["^ Alex tried to call out for someone to help but couldn't get the words out as she was jostled around.","\n",{"#":"v_act4/barnInterior"},{"#":"v_enter_act4/barn1Fade"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^By the time they reached the barn tears were streaming down Alex's face. She felt light-headed. Jorgur shoved her to the ground, picked her up by the collar, and pushed her toward a cow.","\n",{"#":"v_enter_act4/barn2Fade"},"^:grandpa: \"You want to be a part of the folk? Use this!\" He pulled a hideous, writhing creature out of a nearby crate. It looked like a snake made of matted fur. On its two ends were wrinkled and swollen faces, frozen in screams, their lips cracked, mouths gaping wide. Grandpa wiggled it in front of Alex and its beady eyes glazed over with pus.","\n","ev","str","^Scream","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["^ Alex screamed. ","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^:grandpa: \"What's the matter? You've never seen a Tilberi before? What have your parents been teaching you? This is our culture! This is how our ancestors milked the cows.\"","\n","^Jorgur shoved the Tilberi in her hands. She could no longer tell if this was real.","\n","ev","str","^Shut your eyes","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["^ Alex squeezed her eyes shut and wished to be anywhere else but here. ","\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^Suddenly Grandpa looked up and shushed her. He let the Tilberi go and it slithered away to suckle on a cow. Grandpa pressed himself against the wall, out of view behind the door. ",{"->":"dadEnter"},"\n",{"#f":7}]}],{"#f":3}],"dadEnter":[["^Alex waited, shocked and unable to move. Jorgur turned to her and grinned, his fist wrapped around a shovel.","\n",{"#":"v_enter_act4/barn3Fade"},"^The door of the barn burst open to reveal Alex's father Einar.","\n","^:dad:\"There you are! Oh no... What did he do?!\": Alex tried to warn him, but it was too late.","\n","^Jorgur stepped forward, lifting the shovel over his head, and let it come down with all his force on the back of Einar’s skull. He collapsed.","\n",{"#":"v_enter_act4/barnFade4"},"^:player:\"Dad!\":","\n","^Jorgur laughed, winded. :grandpa:\"You're not going anywhere,\": he wheezes.","\n","ev","str","^Alex sprinted for the door","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex ran to her father","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Terrified, Alex made a break for the door. Jogur grabbed her arm in an attempt to stop her, but she yanked herself free and ran for her life.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ Alex ran to Einar's side. He was still breathing but knocked out cold. Jorgur grabbed a hold of Alex before she could do anything. She broke free.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Alex barely made it to the door.","\n",{"->":"barnAudy"},{"#f":7}]}],{"#f":3}],"barnAudy":[[{"#":"v_act4/barnExterior"},{"#":"v_enter_act4/audieFade"},"^Alex tore out of the barn and ran straight into Audhumbla. She looked down at you with fear in her eyes.","\n","^:audie:\"I'm so sorry,\": she croaked. She meant it. :audy:\"I didn't think it would go this far, I...\":","\n","ev","str","^Get out of my way!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Then help me!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:audie:\"To the south, down that road... some old members of the kindred run a ski mountain - find them!\":","\n","^With no time to think, Alex took off toward the mountains.","\n",{"->":"ACT5"},{"#f":7}]}],{"#f":3}],"ACT5":[{"->":"act5Road"},{"#f":3}],"act5Road":[[{"#":"v_clearScreen"},{"#":"v_act5/road"},"^Alex ran out onto the road, headed for the mountains. She hoped to god or gods that Audhumbla wasn't tricking her. Alex was freezing cold and soon praying to see any sort of car on the road.","\n","^Sure enough, she saw a pickup truck coming up from behind her.","\n","ev","str","^Alex stuck her thumb up","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex walked in front of the car","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Alex stuck her thumb up and the car rolled to a stop next to her.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^ The car slowed down in front of her and she walked around to the driver's side. Alex prepared to use what little Icelandic she knew.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:dad:\"[Hello, child! What are you doing out here?]\":","\n","ev","str","^Lost my parents","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Running from crazy man","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Need to go skiing","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["^ ","<>","\n","^:player:\"[I lost my parents,]\": she said.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["^ ","<>","\n","^:player:\"[I'm running from a crazy man,]\": she said.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["^ ","<>","\n","^:player:\"[I need to get to the ski resort,]\": she said.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:dad:[Well, if you're heading up this way then I would have to be a monster not to help a child such as yourself from the cold. Hop in.]\":","\n","ev","str","^Get in","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"#":"v_fadeOut"},{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^You drive for a few miles and it's clear you've entered the mountains. The ground is covered in snow as far as the eye can see.","\n",{"#":"v_fadeIn"},"^\"This as far as I can go.\" they say \"Good luck out there, kid. You have a rough trip ahead of you.\" They hand you a blanket and tell you to keep warm.","\n",{"->":"mountainBase"},{"#f":7}]}],{"#f":3}],"mountainBase":[{"->":"mountain1"},{"#f":3}],"act5Arrival":[[{"#":"v_act5/snowyhouse"},{"#":"v_clearScreen"},"^Alex finally saw the small wooden cabin, just where Audhumbla said it would be. The lights were on, but everything was totally still.","\n","ev","str","^Alex knocked on the door","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Alex knocked on the cabin door and heard commotion inside. A woman around her mother's age opened the door. She looked at Alex like she'd seen a ghost.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:brynja:\"...Kari? Is that you?\":","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^No","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Say nothing","/str","/ev",{"*":".^.c-3","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:brynja:\"Wait, you're not Kari. Who are you?\":","\n","ev","str","^Kari's cousin","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Sigrún's daughter","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^Jorgur's granddaughter","/str","/ev",{"*":".^.c-6","flg":20},{"c-4":["^ :player:\"Kari's cousin,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-5":["^ :player:\"Sigrún's daughter,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"c-6":["^:player:\"Jorgur's granddaughter,\": you say.","\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":["^Her face turned white. :brynja:\"Oh gods... come in, quickly. But be quiet, my kids are asleep.\":","\n","ev","str","^Go inside","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":[{"->":".^.^.^.^.act5insideHouse"},"\n",{"#f":7}],"#f":7}]}],{"act5insideHouse":[[{"#":"v_act5/lesbianHouse1"},"^Alex entered the small cabin and the warmth instantly made her feel safe and secure. There were two rooms - one a sort of kitchen and one lined with beds. Alex was struck by how welcoming this home was. The woman whispered into the house in Icelandic and someone came out from the kitchen.","\n","^:brynja:\"My name is Brynja,\": the woman said. :brynja:\"This is my wife, Ásta.\"","\n","^:asta:\"What are you doing here, little one?\":","\n","ev","str","^Trying to find Kari","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Grandpa has gone crazy","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I'm in danger","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ :player:\"I'm trying to find Kari,\": Alex said. :player:\"Have you seen him?\":","\n","^:brynja:\"No, but...\" They shared a look.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["^:player:\"Grandpa has gone crazy,\": Alex said. :player:\"He's attacked my dad.\":","\n","^They shared a look. :brynja:\"We assumed as much.\"","\n",{"->":".^.^.g-0"},{"#f":7}],"c-2":["^ :player:\"Grandpa attacked my dad.\",: you say. :player:\"I need help.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^They shared a look. :\"asta\":\"How did you find us?\": Ásta asked. Alex told them about how Audhumbla helped you escape. Brynja is stunned.","\n","^:brynja:\"Audhumbla went against Jorgur?\":","\n","^:asta:\"He must have really gone insane.\":","\n","^:brynja:\"We sort of knew about this... Your cousin left us this note. We didn't see him but it was on our doorstep this morning.\": They hand you a piece of paper.","\n","ev","str","^Read letter","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"#":"v_clearScreen"},{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:kari:\"Dear Jóhannson family,","\n","^:kari:i hope you are well. i am sorry for writing in english but grandpa jorgur cannot read it. i wanted to tell you that grandma Fjola died but we are doing ok. my cousin and aunt and uncle have come to visit. grandpa tells me they are bad people but i really like to see them. i have been staying outside away from our house to fool them like he told me. grandpa said my cousin will help the kindred get strong again. the blót is tomorrow. he told me never to talk to you again but i miss playing with björn and margrét and wanted to say i hope you and grandpa make up and join us again.\":","\n","^You look up at Brynja and Ásta. ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"chatpt1":[["ev","str","^Why does grandpa hate me?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^What was the kindred like?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^What is Grandpa going to do?","/str","/ev",{"*":".^.c-2","flg":20},{"*":".^.c-3","flg":24},{"c-0":["^:brynja:\"The way he sees it, his kindred betrayed him. We survived for years by fishing but we couldn't keep up with the times. The tourism industry is a betrayal of what he thinks is an authentic Icelandic life.\": ",{"->":".^.^.^.^.grandpaHateAsk"},"\n",{"#f":7}],"c-1":["^ Ásta and Brynja both start to speak, then Brynja motions to Ásta. :asta:\"For a time it was nice. It was like a family, we shared everything. We could nearly sustain ourselves... I had so much time to enjoy life. We felt like rebels, and Jorgur was our mighty leader. In our eyes he could do no wrong. Things really changed.\": ","\n",{"->":".^.^.^.^.kindredAsk"},{"#f":7}],"c-2":["^ Brynja looks at Ásta. :asta:\"We're not sure, but.. he is planning a blot.\":","\n","^:brynja:\"A sacrifice.\":","\n","^Ásta glares at Brynja. :asta:\"Who knows, he's a crazy old man. If Audhumbla really did send you here, he's alone. He can't hurt you.\": ",{"->":".^.^.^"},"\n",{"#f":7}],"c-3":[{"->":".^.^.^.^.chatpt2"},"\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"grandpaHateAsk":[["ev","str","^Fishing","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Authentic\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Skiing","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Ask other questions","/str",{"VAR?":"hateAskNum"},0,">","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ :player:\"What happened with the fishing?\":","\n","^Ásta sighs. :asta:\"We would sell our fish to the town across the bay, Dalvík. They didn't like us pagans but they still bought our fish. It started to grow and they got new fishing technology. Suddenly we couldn't catch anything. Jorgur thought we were cursed.\":","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"What does that mean, authentic?\":","\n","^:asta:\"Jorgur talked about 'hard virtues.' Courage, honor, endurance, control. He thought that only those who lived like we did - worshiping the old gods, living off the land - were real Icelandic. To him, working in tourism is soft. We also started to realize that he hated the idea of anyone not 'true icelandic' invading his soil.\"","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-2":["^ :player:\"So... people ski here?\": you ask.","\n","^:asta:\"Yes, it's quite popular. We have a great website.\" She looks lovingly at Brynja.","\n","^:brynja:\"I do freelance web development. And most of the management. Ásta handles the tourists but mainly she is a writer.\":","\n","ev",{"VAR?":"hateAskNum"},1,"+",{"temp=":"hateAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"kindredAsk":[["ev","str","^Why would you join the kindred?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Why did you leave the kindred?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Why did my parents leave the kindred?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Ask other questions","/str",{"VAR?":"kindredAskNum"},0,">","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ :player:\"So why would you join the kindred in the first place?\":","\n","^Brynja answers. \"In Dalvík we kept a low profile... We are gay and back then there was contempt for us. We met your grandfather in town one day and he offered us something too good to be true.\"","\n","^:asta:\"A place where we didn't have to hide, and didn't have to worry about money.\"","\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-1":["^ :player:\"Why did you leave the kindred?\": ","\n","^:brynja:\"Your parents had already run away and everyone was on edge. Tour guides started bringing people in to see the \"untouched nature\" and it made Jorgur crazy. We were poor and sad and when your father's father started buying and selling land to tour agencies it was time for us to find our own way. We still practice Asatru, but not like Jorgur.\":","\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-2":["^ Your mother became fell in love once with a man from London. He promised to show her the world, and one day he just disappeared. It only made her more determined to leave.","\n","ev",{"VAR?":"kindredAskNum"},1,"+",{"temp=":"kindredAskNum","re":true},"/ev",{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"grandpaPlanAsk":[["ev","str","^Ask other questions","/str",{"CNT?":".^.^"},0,">","/ev",{"*":".^.c-0","flg":5},{"c-0":["^ ",{"->":".^.^.^.^.chatpt1"},"\n",{"#f":7}]}],{"#f":3}],"chatpt2":[{"->":".^.^.chatend"},{"#f":3}],"chatend":[["^:brynja:\"Come,\": Brynja said, putting on her coat, :brynja:\"we have to get you back to your mother.\":","\n","^:asta:\"Wait,\": said Ásta. :asta:\"Don't move.\":","\n","^Alex felt a chill move through the air.","\n",{"#":"v_act5/lesbianHouse2"},{"#":"t_speedDown"},{"#":"t_speedDown"},"^:grandpa:\"Ásta. Brynja.\"","\n",{"#":"t_reset"},"^:asta:\"Ye gods, Jorgur. You look awful.\":","\n","^He did. Jorgur's skin was ghostly white. He brandished a shotgun in the doorway of the house.","\n","^:grandpa:\"There you are, asni.\": Jorgur started to move forward but Brynja stepped between him and Alex.","\n","^:brynja:\"What are you doing with this child, Jorgur?\":","\n","^:grandpa:\"[Agh, stop speaking in her ugly language. She is a worthless American.]\":","\n","^:brynja:\"I'll speak so Alex can understand me. This is insane. Leave the girl alone.\":","\n","^:grandpa:\"I will do as I wish. My daughter died because of Fjola's sin. It drove the landvættir from my land and placed a curse on my family.\":","\n","^:asta:\"You would rather make yourself a martyr than rejoin society?\":","\n","^:grandpa:\"Asatru must rebuild our ancestral tribes. We cannot falter in this mission, we must regain our native freedom if we are to survive. I will not let you get in my way.\": Jorgur pointed the gun at Brynja. :grandpa:\"Kari. Put Alex in the car.\":","\n","^To his right, hiding behind his Grandfather's legs, was Kari. He looked terrified, but well.","\n","^:player:\"Kari!\": cried Alex. He didn't look at her. Jorgur gestured with his gun and the wives stepped back against the wall.","\n","^:grandpa:\"Now, Kari!\":","\n","^:kari:\"Yes, grandfather.\": Kari walked over to Alex with a rope and tried to tie her hands.","\n","ev","str","^Alex resisted","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex let him tie her","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Alex struggled and pushed Kari away. ","\n","^:kari:\"Just let me do it, Alex. If I don't, he'll hurt us.\":","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Kari tied Alex's hands behind her back and led her over to Jorgur.","\n","^:grandpa:\"[Come, we are leaving.]\":","\n",{"#":"v_fadeOut"},{"->":"sacrifice"},"end",{"#f":7}]}],{"#f":3}],"#f":3}],"sacrifice":[[{"#":"v_act6/campfire"},"^:grandpa:\"[Tie her to the tree, Kari. Useless brat.]\":","\n",{"#":"v_fadeIn"},"^Kari tied Alex to the tree, hands trembling. Her bonds felt slightly looser than they did before.","\n","ev","str","^What are you doing?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You don't have to do this.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Alex yelled what are you doing?","\n","^Kari didn't answer, only fumbled with the bonds around Alex's body.","\n",{"->":".^.^.g-0"},{"#f":7}],"c-1":["\n","^Alex looked at Kari earnestly, telling him \"You don't have to do this.\" Kari didn't respond, only looked down intently at the ropes in his hands.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:grandpa:“[Mighty ones in Asgard, Vanahiem, shining gods and goddesses of my folk, Alfur, landvættir, and my ancestors. I call upon you in all of your names to be here with me today]”:","\n","ev","str","^Alex struggled against the bonds","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Please, Grandfather! Stop!","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Kari do something!","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-3":["\n","^\"Please, Grandfather! Stop!\" Alex cried, twisting beneath her bonds as Kari backed up timidly, his eyes avoiding her.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-4":["\n","^\"Kari do something!\" Alex called to her cousin. He pretended not to hear her as he backed away timidly.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:grandpa:“[We are here today to give honor to the landvættir, guardians of my ancestors. I ask that they return to my home, that they bestow their gifts upon me, and that they cast out all foreigners in the name of faith, family, and folk.]\":","\n",["^Grandfather finishes his speech, closing his eyes for a moment in silent prayer before unsheathing the dagger in his belt. Before Alex or Kari could react, he thrust the hilt out to Kari, beckoning for him to take it. Kari looked back up at his grandfather in shock. His eyes darted between Alex and Grandfather, as if waiting for something to happen.","\n",["^grandpa: \"[Take it, boy.] he urged him, [You are the future of our people. The trueblooded Icelanders must not hesitate to strike at those who trespass. Go, and cut the palm of her hand for sacrifice.]\"","\n",["^Kari hesitated.","\n","ev","str","^Don't listen to him!","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^say nothing","/str","/ev",{"*":".^.c-6","flg":20},{"c-5":["\n","^\"Don't listen to him!\" Alex shouted in desperation, causing Kari to meet her gaze, if only for a moment. He looked at a loss for words, terrified. At the behest of Grandfather, he grasps the knife.","\n",{"->":"sacrifice.0.g-5"},{"#f":7}],"c-6":["\n","^Alex watched silently, the hairs on the back of her neck raised. Kari looked from her to the knife, almost in a daze. Shaken, he takes the knife.","\n",{"->":"sacrifice.0.g-5"},{"#f":7}],"#f":7,"#n":"g-4"}],{"#f":7,"#n":"g-3"}],{"#f":7,"#n":"g-2"}],{"#f":7}],"g-5":["^:grandpa:“[This is no time for hesitation, boy. You're an Icelander, like your Mother and Father before you.]\":","\n",["^Kari took a deep breath at the mention of his parents, becoming lost in thought, if only for a moment. Grandfather loomed over him, and there was no room for childish behavior or time to think, only do as adults do.","\n",["^Seemingly resolute, he turned to Alex, blade in his small fist.","\n","ev","str","^Grandfather is wrong! All of this is wrong! Don't let him fool you.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Your mom didn't want this. She'd want you to come home with my parents and I.","/str","/ev",{"*":".^.c-8","flg":20},{"c-7":["\n","^\"Grandfather is wrong! All of this is wrong! Don't let him fool you.\" Alex told her cousin as he stood in front of her. ",{"->":"beliefinself"},"\n",{"#f":7}],"c-8":["\n","^\"Your mom didn't want this. She'd want you to come home with my parents and I.\" Alex reasoned with him. ",{"->":"beliefinmom"},"\n",{"#f":7}],"#f":7,"#n":"g-7"}],{"#f":7,"#n":"g-6"}],{"#f":7}]}],{"#f":3}],"beliefinself":[[["^:Kari: \"[He's my Grandfather though, he always tells me how good the past was and, well, if he knows how to get us back there...\"]","\n",["^He trailed off, unsure where the dogma ended and his own beliefs began.","\n","ev","str","^The past isn't perfect.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"The past isn't perfect. You should take the good and leave the bad behind. And this is bad, Kari!\" Alex spoke, pulling against the rope around her until her chest hurt. Kari silently mulled her words over, looking over the knife in his hands. Finally, he looked Alex in the eyes and spoke.","\n",{"->":".^.^.^.^.g-2"},{"#f":7}],"#f":7,"#n":"g-1"}],{"#f":7,"#n":"g-0"}],{"g-2":["^Kari: \"[I just want the bad things to stop.]\" ",{"->":"moreact6"},"\n",{"#f":7}]}],{"#f":3}],"beliefinmom":[["^:Kari: \"But Grandpa says where you come from there's no honor in pureblooded families, that the States are a mess.\"","\n","ev","str","^That stuff's in the past.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"Where my family's from, it doesn't matter. That stuff's in the past. People are happy, even if they aren't all the same.\" Alex told him, speaking from her heart. Kari silently mulled her words over, looking over the knife in his hands. Finally, he looked Alex in the eyes and spoke.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:Kari: \"I just want to go home.\" ",{"->":"moreact6"},"\n",{"#f":7}]}],{"#f":3}],"moreact6":[["^Before Alex can respond, Kari cut the rope that tied her back. She looked at him in bewilderment, and so did Granfather.","\n","^:grandfather: \"[Kari!]\" he shouted. yet before he could react, Kari turned around and rushed at him, knife brandished. In one swift move the blade was dug into Grandfather's knee, causing him to cry out in pain before falling on his side. He grasped his knee as he spewed dozens of foreign curses.","\n","ev","str","^We need to run.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"We need to run.\" Alex said. For the first time without hesitation, Kari grabbed Alex's hand, running to the woods where they had come from. Grandfather's cries became more distant as the two raced through the winding thicket, following the runes like Alex had before not long ago. Finally they came out of the other side, the cries no longer audible, instead replaced by the hum of a car.","\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^:Mom: \"[Alex! Kari!] Alex's mother calls out, opening the passenger door of the car and jumping up out of her seat. She rushed to the two kids, embracing them.","\n","^:Brynja: \"[We gotta go, Fjola!] Brynja calls from the driver's seat. Fjola turns back to her and nods, taking a deep breath before hurrying Alex and Kari into the back of the car and getting back into the passenger seat.","\n","ev","str","^Where are we going?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I'm scared.","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^\"Where are we going?\" Alex asked as Brynja made a u-turn.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"c-2":["\n","^\"I'm scared.\" Alex near-whispered from the back of the car.","\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":["^:Mom: \"[Everything's gonna be fine. We're going to the airport and when we're there, we can talk.] Alex's mom explained as she looked through each window, almost expecting something to be there. As the car began to drive away from the forest, Alex looked through the back window, heart racing as the treeline faded, along with every dark shadow in it.","\n",{"->":"epilogue"},"end",{"#f":7}]}],{"#f":3}],"epilogue":[[{"#":"v_act6/epilogue"},"^Kari and Alex sat on the plane in silence.","\n","^:kari:\"Hey, Alex.\":","\n",["ev",{"^->":"epilogue.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^First, Kari drew a dragon.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"epilogue.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":[["ev",{"^->":"epilogue.0.g-0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Then, an eagle.",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"epilogue.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7}],"g-1":[["ev",{"^->":"epilogue.0.g-1.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Next, a bull.",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"epilogue.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":7}],"#f":7}],"g-2":[["ev",{"^->":"epilogue.0.g-2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^And finally, a giant.",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"epilogue.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":7}],"#f":7}],"g-3":["^They all stood on a great island, but this one had skyscrapers. Kari and Alex stood in the middle of the photo, safe.","\n","^She handed it to him.","\n","^Kari took the photo, folded it twice, and slipped it in his pocket.","\n","^END","\n","end",{"#f":7}]}],{"#f":3}],"eaststart":[{"#":"v_clearScreen"},{"#":"s_act2/Audio/ThunderRain"},{"#":"s_act2/Audio/SpoopyPiano_m"},{"#":"v_act2/east1"},"ev",{"VAR?":"followedKari"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^:player:\"Kari!\": Alex desperately called for Kari, but heard no response. ","<>","\n",{"#":"v_enter_act2/east1KariFade"},{"->":".^.^.^.8"},null]}],"nop","^","\n","^She was completely lost. Thunder crashed above her while the rain seeped through her shoes. Alex wandered around confused and hopeless, Occationally she would cry out for her cousin, fruitlessly. ",{"->":"entrance"},"\n",{"#f":3}],"entrance":[{"->":".^.main"},{"main":[["ev",{"VAR?":"followedKari"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^:player:\"Kaaarrriiii!\":","\n",{"->":".^.^.^.4"},null]}],"nop","\n",["ev",{"^->":"entrance.main.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex wandered north","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,5:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"entrance.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"^ ",{"->":"wood2"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"lost":["ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^Alex walked on for what felt like forever...",{"->":".^.^.17"},null],"s1":["pop","^Alex walked on for what felt like forever...",{"->":".^.^.17"},null],"#f":5}],"\n",{"->":"entrance"},{"#f":3}],"wood2":[{"#":"v_act2/east2"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex's tears stung from the cold. She noticed some strange runes but was too exhausted and scared to care. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: EAST"},["ev",{"^->":"wood2.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^D:E,5:6 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood2.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,7:8 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood2.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^G:H,9:10 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood2.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-1":["ev",{"^->":"wood2.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ",{"->":"wood3"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood2.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"wood3":[{"#":"v_act2/east3"},{"#":"s_audio/FootStep(Outside)_s"},"^The storm brooded directly over Alex, as if it was conspiring against her. It roared and growled, pushed and pulled at her, but she pushed on. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: SOUTH"},["ev",{"^->":"wood3.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,4:5^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,7:8^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^D:D,8:9^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood3.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^A:B,6:7 ^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood3.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-1":["ev",{"^->":"wood3.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood3.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"wood4"},"\n",{"#f":7}],"c-3":["ev",{"^->":"wood3.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"wood4":[{"#":"v_act2/east4"},{"#":"s_audio/FootStep(Outside)_s"},"^The winds were cruel and endless. ","ev",{"VAR?":"followedKari"},"/ev",[{"->":".^.b","c":true},{"b":["^Every rock or bush looked like Kari from a distance, Alex would run after them only to be met with dispair. ",{"->":"wood4.7"},null]}],"nop","^Everytime Alex would stop and try to piece together her surroundings. The thought of never making it home dug at her from the back of her mind. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: EAST"},["ev",{"^->":"wood4.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^G:H,3:4^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:I,5:5^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^E:F,9:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood4.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^A:B,6:7^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood4.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-1":["ev",{"^->":"wood4.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"^ ",{"->":"wood5"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood4.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-3":["ev",{"^->":"wood4.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"wood5":[{"#":"v_act2/east5"},{"#":"s_audio/FootStep(Outside)_s"},"^Alex stumbled, her feet in pain from the cold, the walking, the guilt. Perhaps two kids would be found missing this night. She tried to push on but then everything would weigh on her. She trudged on, delirious. ",{"->":".^.main"},"\n",{"main":[[{"#":"CORRECT ANSWER: NORTH"},["ev",{"^->":"wood5.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO NORTH","/str","/ev",{"*":".^.^.c-0","flg":6},{"s":["^^D:E,4:5^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO EAST","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^I:J,6:8^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO SOUTH","/str","/ev",{"*":".^.^.c-2","flg":6},{"s":["^^F:G,9:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"wood5.main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^GO WEST","/str","/ev",{"*":".^.^.c-3","flg":6},{"s":["^^B:C,7:8^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wood5.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"act2Home_outside"},"\n",{"#f":7}],"c-1":["ev",{"^->":"wood5.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-2":["ev",{"^->":"wood5.main.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}],"c-3":["ev",{"^->":"wood5.main.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"lost"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"trails":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},{"#":"s_act3/Audio/WindStooorm"},{"#":"s_act3/Audio/Somber_m"},{"#":"v_act3/north1"},"^Alex tried to follow Kari's map as best she could, just looking at it gave her hope that Kari was okay. She could still feel her heart pounding from the escape. Staying inside just did not sit right with her. The air was chilly but refreshing, a perfect time to explore the beautiful landscape around her, but she was on a mission. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex looked at map again","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex took in the scenery","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex ventured on","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ Kari's drawings were crude but surprisingly helpful when it came to finding the hideout. From what Alex could tell it was some kind of boat. Alex felt a little envious after that, she wished she could have a secret boat hideout. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ Alex's mom would always talk about how beautiful Iceland was and looking around, she could finally see why. The landscape was so vast and colorful, it gave her a sense of clarity she had never felt before. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ Kari had to be at this hideout, where else would he have run off to? Alex was just glad that she found his drawings when she did. She thought that maybe when she found him, he could show her more sights around iceland.  ",{"->":"trails2"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"trails2":["^Alex climbed up and down hills hoping to spot her cousin's secret hideout. This hill in particular is precariously steep, but she could hear the ocean just ahead. Her feet began to slip under the loose gravel of the trail; she didn't feel safe. ",{"->":".^.main"},"\n",{"main":[["ev","str","^Alex pushed forward","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^She pushed forward again","/str",{"VAR?":"Gone_forth"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^Alex paced herself","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex used her hands","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["^ Alex took a deep breath and attacked the trail. Hiking as fast as she could, ignoring the burning in her calves. She was almost at the top when she tripped and tumbled down. ","\n","^She got back up at the foot of the trail with some scratches and a bruise. She felt a bit worse.","\n","ev",1,"/ev",{"temp=":"Gone_forth","re":true},"ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ She threw caution to the wind and tried again. This time running up the slope at full speed. She squeezed her eyes shut, preparing mentally for a fall, but when she opened them she realized that she had actually made it to the top.","\n",{"->":"cliff"},{"#f":7}],"c-2":["^ She decided to hike this steep trail slowly and safely. She zig-zagged across the slope so she didn't fall. She eventually got to the top but it ate up far more time than she wanted it to.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"cliff"},{"#f":7}],"c-3":["^ She used her hands to secure herself, out of fear of stubling down the hill. She kept her body low to the ground and scampered up the hill. She just knew that she looked absolutely ridiculous.","\n","^When she got to the top and unclenched her hands, finally noticing that they were raw and bloody, but she made it and that was the most important part.","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"fucked_hands","re":true},{"->":"cliff"},{"#f":7}]}],{"#f":3}],"#f":3}],"cave":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},{"#":"v_act3/boatExterior"},"^She approached the boat from Kari's drawings and called out his name. There was no answer. That can't be right, he had to be here. He must be sleeping. This place was in all of his drawings. Where else could he have gone?","\n","^She tried to get a closer look and finally noticed the massive eagle that had nested on the hull of the boat, right near the entrance. It sat at the helm staring at Alex, menacingly waiting for her to make a move. Maybe Kari wouldn't come out because he was afraid. Alex needed to get rid of it. ",{"->":"cave.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex approached the eagle","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex threw a pebble at the eagle","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex looked for another way in","/str",{"VAR?":"eagle_attempts"},0,">","/ev",{"*":".^.c-2","flg":21},"ev","str","^Alex kicked up sand","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Alex shouted","/str",{"VAR?":"eagle_attempts"},2,">","/ev",{"*":".^.c-4","flg":21},"ev","str","^Alex entered the boat","/str",{"VAR?":"eagle_gone"},"/ev",{"*":".^.c-5","flg":21},{"c-0":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^Alex approached the boat slowly, carefully eyeing the eagle. As soon as she got close, it flapped its wings and brandished its sharp talons. She wouldn't be getting in with the eagle still there. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^She chucked a pebble near the eagle, hoping that that would scare it. She was shocked when it actually hit. And even more shocked when the eagle does not react. It just continued to look at her with its piercing gaze.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^She walked around to the front of the boat, making sure she kept her distance from the bird. ","ev",{"VAR?":"hurt_leg"},"/ev",[{"->":".^.b","c":true},{"b":["^She suddenly felt a sharp pain in the leg she hurt while jumping. It brings her to her knees and Alex laid in the sand until it went away. She limped the rest of the way there.",{"->":".^.^.^.12"},null]}],"nop","^ The hull of the boat, with its warped and rusted metal, towered over her.","\n","^Alex found no way in.","\n",{"->":".^.^.^"},{"#f":7}],"c-3":["\n","ev",{"VAR?":"eagle_attempts"},1,"+",{"temp=":"eagle_attempts","re":true},"/ev","^Alex started stomping and kicking, hoping that if she caused enough commotion the eagle would just leave. But it didn't, it just stared at her, unamused by her tantrum.","\n",{"->":".^.^.^"},{"#f":7}],"c-4":["\n",{"#":"t_speedUp"},"^She was tired and in pain and she just wanted to find Kari and go home. You was so frustrated that she started to cry. Alex yelled out for Kari. He has to be there, she had worked so hard to get here.","\n","^It screeched back, flapped its wings, and swooped toward Alex. She closed her eyes and ducked.","\n","^She felt wind rush over her head and a talon slash into her shoulder.","\n",{"#":"t_reset"},"^Alex stayed folded over in fear for a while until she no longer heard the flapping of the eagle's wings, leaving only a feather behind. She took it, as a reminder.","\n","ev",1,"/ev",{"temp=":"eagle_gone","re":true},{"->":".^.^.^"},{"#f":7}],"c-5":[{"->":"act3Boat"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"cliff":[{"->":".^.intro"},{"intro":[{"#":"v_act3/northHilltop"},"^The summit of this very steep hill overlooked the shore. It ended in a rocky ledge high over the beach. In the distance, she could see the boat Kari that must have been talking about sitting on the shore. She had to find a way down this cliff. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Alex climbed down the rocky cliff","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex looked for a smaller ledge","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex jumped down","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","ev",{"VAR?":"fucked_hands"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ She found some stable footing on the side of the cliff and thought she might be able to climb down safely. That didn't keep her hands from shaking though. She was almost to the bottom when her hand slipped and she fell backwards. She landed in the sand with no injuries but the wind knocked out of her.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^She found some stable footing on the side of the cliff and thought she might be able to climb down safely. She moved carefully only changing her grip when she knew it was safe. The cuts in her hands started burning, in a lapse of focus she let go and fell back on the sand. She felt the impact rattle every bone in her body. ",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^Stamina = Stamina - 10",{"->":".^.^.11"},null],"#f":5}],{"->":".^.^.^.18"},null]}],"nop","^ ",{"->":"shore"},"\n",{"#f":7}],"c-1":["^ She walked along the edge of the cliff looking for a safer point to get onto the beach. She walked along the coast for what seemed like forever until the ledge dropped to a safe distance down. She eventually lost sight of the boat. ",{"->":"cliff.longWalk"},"\n",{"#f":7}],"c-2":["^ There was no time, Alex just knew Kari was down there! She hastily jumped off the ledge, hoping the soft sand would cushion her fall. She nearly landed on her feet, but collapsed to the ground when she landed. She felt a serious pain in her leg, and thought it would be best to keep off of it the rest of the journey.","\n","ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"hurt_leg","re":true},{"->":"shore"},{"#f":7}]}],{"#f":3}],"longWalk":[["^Alex was lost.","\n","^She walked along the shore hoping to pick up on any landmark that would lead her back to the boat. She wandered for so long she began to doubt she was going in the right direction.","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev","str","^Alex turned around","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex carried on","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",1,"/ev",{"temp=":"forward","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ ","\n","ev",{"VAR?":"forward"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",0,"/ev",{"temp=":"forward","re":true},{"->":".^.^.^.^.^"},{"->":".^.^.^.6"},null]}],"nop","\n","^Alex finally found the boat. She was out of breath, tired, and trembling but she made it.","\n",{"->":"shore"},{"#f":7}]}],{"#f":3}],"#f":3}],"shore":[{"->":".^.intro"},{"intro":[{"#":"s_act3/Audio/WavesWav"},{"#":"v_act3/boatFar"},"^Walking upon the sandy shore, Alex saw the rotting old boat up ahead and it reminded her of going to the Rockaways with her parents. Pebbles lined the shore, smooth as sin as the waves washed over them. She thoguht it might finally be a good time to look around. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[[["ev",{"^->":"shore.main.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex skipped a stone","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^D:F,9:10 ^",{"->":"$r","var":true},null]}],"ev","str","^Alex took a break","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex listened to the waves","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Alex walked to the boat","/str",{"VAR?":"shore_attempts"},0,">","/ev",{"*":".^.c-3","flg":5},["ev",{"^->":"shore.main.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex examined the boat","/str","/ev",{"*":".^.^.c-4","flg":22},{"s":["^^I:J,4:5^",{"->":"$r","var":true},null]}],["ev",{"^->":"shore.main.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Alex examined the cliff","/str","/ev",{"*":".^.^.c-5","flg":22},{"s":["^^I:J,2:3^",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"shore.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"^ She took a moment to just skip some rocks like she used to do with Dad. Everything so far had been so scary and Alex just now realized how much she wished her parents were here with her now. ","ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^ The salt water from the pebble stung her hands.",{"->":".^.^.^.11"},null]}],"nop","\n","^She started to feel a little better after a while and took a breath.","\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ Alex sat by the shore and watched the waves as they crashed onto the sand. She regained some strength from her long journey.","\n","ev",{"VAR?":"long_walk"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ She remembered what her mother told her and take in the sounds of the ocean. She thought back to the ordeal at the cliff and shuddered. She wished her mom was actually there with her.","\n","ev",{"VAR?":"Stamina"},3,"+","/ev",{"temp=":"Stamina","re":true},"ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}],"c-3":["^ ",{"->":"cave"},"\n",{"#f":7}],"c-4":["ev",{"^->":"shore.main.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"^ The rickety boat wass probably missing more planks than it still had left, Alex wasn't exactly sure how it was still standing. The mildewy flag was swaying in the ocean breeze. ","\n","ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}],"c-5":["ev",{"^->":"shore.main.0.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"^ Alex took a minute to look back at what she just did and shudder. That was so dangerous! How does Kari do this? But all the cuts and bruises would be worth it once she brought Kari home.","\n","ev",{"VAR?":"shore_attempts"},1,"+","/ev",{"temp=":"shore_attempts","re":true},{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"west":[{"#":"t_reset"},"^Alex looked around, the fields around her feeling quiet and empty.","\n",{"->":"lady"},{"#f":3}],"lady":[{"->":".^.intro"},{"intro":[{"#":"s_act4/Audio/COW OUTSIDE"},{"#":"s_stop_m"},{"#":"v_act4/barnExterior"},"^Alex could still see Grandfather and Audi talking through the window. Every once in a while, he would glance over at her and gave her a look she didn't understand. With the barn behind her, she was disgusted by the smell of manure drifting through the air.","\n","^She didn't even know how to milk a cow, but to protest would be pointless. She rolled her sleeves up.","\n",{"->":"lady.main"},{"#f":3}],"main":[["ev","str","^Alex examined her Grandfather","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex went to the pasture","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Alex showed her Grandfather the milk","/str",{"VAR?":"cow1milked"},{"VAR?":"cow2milked"},"&&",{"VAR?":"cow3milked"},"&&","/ev",{"*":".^.c-2","flg":5},{"c-0":["^ Alex realized that he felt like a stranger to her now. She had only known him for a day or so and he already hated her. Why? What did she do? He changed so quickly, it really scared her. Now she had to milk a cow? She didn't even know how to milk a cow! She needed to be looking for Kari but she was too scared to tell him that.  ","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^She headed towards the cow smell reluctantly. She didn't want to do this, her stomach churned at the thought of what she had to do. ",{"->":"pasture"},"\n",{"#f":7}],"c-2":["^ ",{"->":"grandpayelling"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture":[{"->":".^.intro"},{"intro":[{"#":"v_clearScreen"},"^She stopped at the foot of some rolling hills. She was astonished by the size of this farm. She saw cows roaming all around, lazily chewing grass. Speckled bushes sprouted wildly along the field to her right. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[[{"#":"v_act4/pasture1"},["ev",{"^->":"pasture.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine bushes","/str",{"VAR?":"eatenBerries"},"!",{"VAR?":"hasBerries"},"!","||","/ev",{"*":".^.^.c-0","flg":7},{"s":["^^H:J,7:9 ^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^A:F,6:7 ^A:D,8:10 ^E,8^",{"->":"$r","var":true},null]}],"ev","str","^Alex went forward","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Alex went right","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Alex headed back to the barn.","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["ev",{"^->":"pasture.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"^ ",{"->":"pasture.bushes"},"\n",{"#f":7}],"c-1":["ev",{"^->":"pasture.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow1milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was a nice cow ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture.cow1"},{"->":".^.^.^.17"},null]}],"nop","^ She didn't feel like she was ready to do that yet. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ ",{"->":"pasture2"},"\n",{"#f":7}],"c-3":["^ ",{"->":"pasture3"},"\n",{"#f":7}],"c-4":["^ ",{"->":"lady"},"\n",{"#f":7}]}],{"#f":3}],"bushes":[["^Alex looked at the bushes and found brightly colored berries hanging from the branches.","\n","ev","str","^Alex ate some berries","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex put some berries in her pocket","/str","/ev",{"*":".^.c-1","flg":20},{"*":".^.c-2","flg":24},{"c-0":["^ Alex shoved some berries in her mouth. Their sweet taste made her feel a little better and they made her feel light headed.","\n","ev",{"VAR?":"stamina"},10,"+",{"temp=":"stamina","re":true},"/ev","ev",1,"/ev",{"temp=":"eatenBerries","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ Alex pocketed some berries for later, they had to be here for a reason, right?","\n","ev",1,"/ev",{"temp=":"hasBerries","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":[{"->":"pasture.main"},"\n",{"#f":7}]}],{"#f":3}],"cow1":[["^Alex felt the body heat of the cow on her skin. It exhaled loudly once she crouched down. It seemed more nervous than she did, but she could barely believe it.","\n","ev","str","^Alex pet the cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Alex scratched behind its ears","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Alex milked the cow","/str",{"VAR?":"cow1milked"},"!","/ev",{"*":".^.c-2","flg":5},{"*":".^.c-3","flg":24},{"c-0":["\n","^Alex's hands trembled a little bit as she pet the cow. She had never seen an animal of this size in person before. This whole trip had been a stark change from her New York home, leaving her nervous and uncompfortable. The cow, on the other hand, seemed at ease even going so far as to move closer to you.","\n","ev",1,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["\n","^Alex tried scratching behind her ears, like a dog. It snorted furiously and trashed her head angrily. This scared her even more. She didn't know how to approach these animals. If she couldn't even soothe them properly, how was she going to milk them?","\n","ev",{"VAR?":"stamina"},5,"-",{"temp=":"stamina","re":true},"/ev","ev",0,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow1milked","re":true},{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow1Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ She pulled out the bucket, sat down, and stared at the udders. She didn't like how they felt in her hands. They were fleshy, moist, and warm to the touch. She felt sick every time she squeezed them. Alex tried not to gag while the bucket filled. ",{"->":"pasture.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ She was not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow1Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ She reached down and the cow stomped her foot. She was scared to go any further. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.37"},null]}],"nop","\n",{"#f":7}],"c-3":[{"->":"pasture.main"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture2":[{"->":".^.intro"},{"intro":["^Audi's property went on for what seemed like miles. She had yet to even see a fence anywhere. The cows seemed to just wander where they pleased.","\n",{"->":".^.^.main"},{"#f":3}],"main":[[{"#":"v_act4/pasture2"},["ev",{"^->":"pasture2.main.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine sky","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^A:J,1:4^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture2.main.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^H:J,5:10^",{"->":"$r","var":true},null]}],"ev","str","^Alex went back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"pasture2.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^The clouds were thin, as if they were smeared across the sky. It looked like it was getting late. Alex was cold, you wanted to go home.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"pasture2.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow2milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was also a nice cow. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture2.cow2"},{"->":".^.^.^.17"},null]}],"nop","^Alex didn't feel like she was ready to do that yet. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow2":[["^Alex saw the cow periodically rustle through the bushes looking for something. It immediately stopped and stared at her when she approached.","\n","ev","str","^Alex fed the cow some berries","/str",{"VAR?":"cow2Soothed"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Milk Cow","/str",{"VAR?":"cow2milked"},"!",{"VAR?":"cow2Soothed"},"&&","/ev",{"*":".^.c-1","flg":5},{"*":".^.c-2","flg":24},{"c-0":["\n","ev",{"VAR?":"hasBerries"},"/ev",[{"->":".^.b","c":true},{"b":["^ You take some berries out of your pocket to feed the cow some berries. You feel its tounge brush up against your hand as it takes them. It nuzzles your hand once it finishes chewing.",{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"hasBerries"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow2Soothed","re":true},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBerries"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You don't know what you can do.",{"->":".^.^.^.18"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"cow2Soothed"},{"VAR?":"hasBucket"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow2milked","re":true},{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You tug on the udders hoping to get this over with as soon as possible. The cow cries out in pain and knocks you to the ground when you get up you see the bucket contains drops of blood. ",{"->":"pasture2.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow2Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"stamina"},5,"-",{"temp=":"stamina","re":true},"/ev",{"->":".^.^.^.37"},null]}],"nop","\n","ev",{"VAR?":"cow2Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ Alex got closer and the cow squealed and stomped off angrily, stepping on her foot on the way out. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.44"},null]}],"nop","\n",{"#f":7}],"c-2":[{"->":"pasture2.main"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture3":[{"->":".^.intro"},{"intro":["^Alex's feet started to hurt again. She hadn't really had a chance to fully recover from yesterday. Everything was moving so fast but she felt like she had made such little progress in finding Kari.","\n",{"->":".^.^.main"},{"#f":3}],"main":[[{"#":"v_act4/pasture3"},"ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n",{"#":"v_enter_bucketFade"},{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"#":"v_exit"},{"->":".^.^.^.12"},null]}],"nop","\n",["ev",{"^->":"pasture3.main.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine bucket","/str","/ev",{"*":".^.^.c-0","flg":22},{"s":["^^B:C,8:10^",{"->":"$r","var":true},null]}],["ev",{"^->":"pasture3.main.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","str","^Examine cow","/str","/ev",{"*":".^.^.c-1","flg":6},{"s":["^^F:H,6:9 ^E:F,8:10 ^",{"->":"$r","var":true},null]}],"ev","str","^Alex went back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["ev",{"^->":"pasture3.main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","^Alex saw a metal bucket just lying on the floor. It was dented all over and a little dirty but it should do the trick.","\n","ev",1,"/ev",{"temp=":"hasBucket","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["ev",{"^->":"pasture3.main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"cow3milked"},"/ev",[{"->":".^.b","c":true},{"b":["^ This was the nicest cow of all. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.11"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture3.cow3"},{"->":".^.^.^.17"},null]}],"nop","^","\n","^Alex didn't feel like she was ready to do that yet.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow3":[["^The cow fidgeted constantly, sporadically swatting its tail and kicking its feet.","\n","ev","str","^Alex talked to the cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Milk Cow","/str",{"VAR?":"cow3milked"},"!","/ev",{"*":".^.c-1","flg":5},{"*":".^.c-2","flg":24},{"c-0":["\n","^Alex apologized for what she was about to do. She didn't want to hurt it and she wasn'tt here by choice. It seemed to stop kicking and stay still.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"temp=":"cow3milked","re":true},{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ Alex was not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"pasture3.cowtail"},{"#f":7}],"c-2":[{"->":"pasture3.main"},"\n",{"#f":7}]}],{"#f":3}],"cowtail":[["^Alex sat down to milk the cow and the cow turned away. She tried to move with it, being careful of its feet. Once she finally managed to settle it down, the cow slapped her in the face with its tail. She moved around hoping to get out of its reach but the cow moved with her. Alex began to get angry.","\n","ev",1,"/ev",{"temp=":"cow3milked","re":true},"ev","str","^Alex swatted the tail away","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Alex ignored it","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ She got frustrated and slapped the tail out of her face. This startled the cow and it kicks its hind legs. They narrowly missed hitting her in the side. But if it hadn't she would have been seriously injured. Alex hastily squeezed the milk she needed, ignoring every swat in the face.","\n","ev",{"VAR?":"stamina"},15,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":"pasture3.main"},{"#f":7}],"c-1":["^ As best as she could Alex tried to ignore the tail in her face. Its hairs were coarse, scratching up her face, getting in her eyes and mouth. Her face itched after every hit and she started to notice how bad the cow smelled. She could hardly see, sometimes her hands jerked in reaction and milk sprayed everywhere. Despite this she got her milk even if most of it ended up on her or the ground. ","\n","ev",{"VAR?":"stamina"},10,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":"pasture3.main"},{"#f":7}]}],{"#f":3}],"#f":3}],"mountain1":[{"->":".^.intro"},{"intro":[{"#":"v_act5/snowentrance"},"^You are already very high up. Behind you, you can see the glint of the ocean in the horizon. Snow crunches beneath your feet. Coming from New York, you were prepared for snow but not like this. Sleet slashes at your face. The blanket helps but not much. You now face foreward, looking up at the mountain top. A muddy road lies ahead of you. You feel closer to Kari than ever before. Audi told you there would people up here who can help.","\n",{"->":".^.^.main"},{"#f":3}],"main":[["ev","str","^Examine Sign","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine Rocks","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Walk Up The Trail","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ The sign point toward the trail. \"Stay On The Path! -Jóhannson Ski\" ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ Everything here is covered in dense ice. Its a much crueler cold here than it is in New York. The ice is harder and the winds are stronger. Everything is so open, making you feel more vulerable than ever before.",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ You trudge up the hill, slowly bracing yourself against the wind. ",{"->":"fork"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"fork":["^With the wind blowing in your face, its hard to tell whats in front of you. Looking ahead hurts your eyes and any exposed skin stings whenever the ice touches it. You think the trail ends here but your not entirely sure. You don't know were to go but you know you need to push foreward.","\n",{"->":".^.main"},{"main":[["ev","str","^Go Left","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go Right","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ You veer left searching for anything that can point you in the correct direction. You thought you saw a trail here but everything just seems muddy and wet. The ground under you feels soft though kind of like gravel. You take that as a good sign. ",{"->":"mountain2"},"\n",{"#f":7}],"c-1":["^ You stomp through the wet ground veering right. You have no idea where you are going, but you know you are headed up hill. The house is definitely uphill, all you can do is climb up and hope for the best.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain2"},{"#f":7}]}],{"#f":3}],"#f":3}],"mountain2":[[{"#":"v_act5/snowymountain"},"^The higher you climb the icier it gets. The ground has slowly been hardening beneath you and it is now to the point where you start to slip.","\n","ev","str","^Walk in the Snow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Slow your Pace","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Grab a Walking Stick","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ","\n","^You remember what happened on the beach and you decide not to take you chances. You move away from the rocky terrain and find an area that is covered in snow. Its is surprisingly deep and some snow seeps into your boots. You feel a shock as the snow starts to chill your feet, but its still better than slipping and falling.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain3"},{"#f":7}],"c-1":["\n","^You keep your steps light and careful. You are so high up and the last thing you want is to loose your balance. You carry on in the same direction hopeful this whole ordeal will be over soon. It doesn't feel right slowing down. You feel like your grandpa could be right behind you, but there is no way he knows where you are.","\n",{"->":"mountain3"},{"#f":7}],"c-2":["\n","^You find an old branch on the ground and decide it would make the perfect companion to traversing this mountain. When you put your weight on it, you immediately slip and fall. You land on your arm sevearly bruising it. You brace yourself ready to tumble down the side of the mountain but that moment never happens. You just get back up and push your self to go further.","\n","ev",{"VAR?":"Stamina"},10,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"mountain3"},{"#f":7}]}],{"#f":3}],"mountain3":[{"#":"v_act5/snowyrockypath"},"^You no longer know where you are and the terrain ahead is not exactly walkable. Boulders about the size of you seem to have fallen over the cliff above blocking your path forward. You stop and take in the situation- Lost in the mountains, alone. If you die, no one will be able to find your body. Your parents will have two lost children and it will have been all your fault. You have no idea how you're going to climb over these massive rocks but you need to, you need to end this no matter what happens to you.","\n",{"->":".^.main"},{"main":[["ev","str","^Use Your Blankets A Rope","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Squeeze through the Gaps","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Find a Safer Path","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^You wrap your blanket around sharp point in the rocks and pull yourself up on top. You make it through safely but your blanket is now mangled and soaking wet. You throw it aside and soon realize how warm it was keeping you. You are shivering the rest of the way.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"ending"},{"#f":7}],"c-1":["\n","^You try to squeeze through the gaps of the boulders. Very quickly you realize how tight these gaps are but you don't want to risk climbing again. You desperately squeeze yourself as far as you can.","\n","^And then you stop. You can't push any further. You're stuck. You thrash violently trying to pull the left half of your body through. You're so close, so close, please. You cry for your parents, for anybody but nobody comes. You go limp. You are tired, confused and scared. You just want to give up and just as you start to slide down the gap and fall to the floor. It takes you a second to realize what happened. You wiggle free, sit down,  take a breath, and force yourself foreward.","\n","ev",{"VAR?":"Stamina"},10,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"ending"},{"#f":7}],"c-2":["^ You walk around the cliffside looking for a better path. You frantically pace around not ready to risk your life climbing something again. You search a bit more. And then a bit more. There has to be a better way. You are unable to find one. ","\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"ending":["^You wipe away the tears see lights in the distance. You realize what they are and start running to the house.","\n",{"->":"act5Arrival"},{"#f":3}],"global decl":["ev",0,{"VAR=":"has_drawing"},0,{"VAR=":"given_drawing"},0,{"VAR=":"wight_drawn"},0,{"VAR=":"followedKari"},0,{"VAR=":"hasLighter"},0,{"VAR=":"hasPapers"},0,{"VAR=":"hurt_leg"},0,{"VAR=":"long_walk"},0,{"VAR=":"fucked_hands"},0,{"VAR=":"Gone_forth"},0,{"VAR=":"eagle_attempts"},0,{"VAR=":"shore_attempts"},1,{"VAR=":"forward"},0,{"VAR=":"eagle_gone"},0,{"VAR=":"hasBerries"},0,{"VAR=":"eatenBerries"},0,{"VAR=":"givenBerries"},100,{"VAR=":"stamina"},0,{"VAR=":"hasBucket"},0,{"VAR=":"cow1Soothed"},0,{"VAR=":"milk"},0,{"VAR=":"cow2Soothed"},0,{"VAR=":"cow3Soothed"},0,{"VAR=":"cow1milked"},0,{"VAR=":"cow2milked"},0,{"VAR=":"cow3milked"},100,{"VAR=":"Stamina"},0,{"VAR=":"coin"},0,{"VAR=":"seenBoat"},0,{"VAR=":"hateAskNum"},0,{"VAR=":"kindredAskNum"},0,{"VAR=":"grandpaPlanNum"},"/ev","end",null],"#f":3}],"listDefs":{}}