{"inkVersion":18,"root":[["^NORTH","\n","^You know your cousin's hide out is nearby. Hes been gone for so long its starting to scare you. You really hope hes in there.","\n",{"->":"trails"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"trails":[{"->":".^.intro"},{"intro":["^The further north you go, the steeper it gets, the more your ankles hate you. Underbrush and vegetation become more common the further you go. You climb up and down hills hoping to spot you cousin's hide out from so far up. This hill inparticular is precariously steep, but you can hear the ocean just ahead. Your feet begin to slip the higher you climb under the lose gravel of the trail, you don't feel safe. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Push forward","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Push forward again","/str",{"VAR?":"Gone_forth"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^Pace yourself","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Use your hands","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["^ You take a deep breath and attack the trail. Hiking as fast as you can, ignoring the burning in you calves. You are almost at the top when you trip and tumble down. ","\n","^You get back up at the foot of the trail with some scratches and a bruise. You feel a bit worse.","\n","ev",1,"/ev",{"temp=":"Gone_forth","re":true},"ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ You throw caution to the wind and try again. This time running up the slope at full speed. You brace yourself mentally for a fall, but you soon realize that you've actually made it. ","\n",{"->":"cliff"},{"#f":7}],"c-2":["^ You decide to hike this steep trail slowly and safely. You zig zag across the slope so you don't fall. You eventually get to the top but it ate up far more time than you wanted it to.","\n","ev",{"VAR?":"Stamina"},5,"-",{"temp=":"Stamina","re":true},"/ev",{"->":"cliff"},{"#f":7}],"c-3":["^ You use your hands to secure yourself, out of fear of stubling down this hill. You keep your body low to the ground and scramper up the hill. You look ridiculous.","\n","^When you get to the top, You see your hands are a scraped up, but you made it and thats the most important part.","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"fucked_hands","re":true},{"->":"cliff"},{"#f":7}]}],{"#f":3}],"#f":3}],"cave":[{"->":".^.intro"},{"intro":["^The boat looks just as your cousin described it. You would try and get a closer look but a massive eagle has nested right near the entrance. She sits at the helm staring at you menacingly waiting for you to make a move. ",{"->":"cave.main"},"\n",{"#f":3}],"main":[["ev","str","^Approach the eagle","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Throw a pebble at the eagle","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Shout at it","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ You approach the boat slowly, carefully eyeing the eagle. As soon as you get close it flaps its wings and brandishes its sharp talons. You wont be getting in with the eagle there. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ You chuck your rock near the eagle, hoping that will scare it. You are shocked when it actually hits and even more shocked when does not react. It just continues to look at you with a piercing gaze. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ Your tired and in pain and you just want to find your cousin and go home. You scream and let out all your anger the best you can. It screaches back flaps its wings and swoops toward you. You close your eyes and duck. You feel wind rush over your head and a talon slash into your shoulder. You stay folded over in fear for a while until you realize the eagle is gone, leaving only a feather behind. You take it, as a reminder and climb into the boat. ",{"->":"shack"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"cliff":[{"->":".^.intro"},{"intro":["^The summit of this very steep hill overlooks the shore. You find that it ends in a rocky ledge high over the beach. In the distance, you can see, not only the shore but the boat your cousin must have been talking about. You have to find a way down this cliff. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Climb down the rocky cliff","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Find a safer route","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Jump down","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","ev",{"VAR?":"fucked_hands"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You find some stable footting on the side of the cliff and decide to may be able to climb down safely. You move carfully only changing your grip when you know its safe. That doesn't stop your hands from shaking though. You are almost to the bottom when your hand slips and you fall backwards. You land in the sand with no injuries but the wind knocked out of you.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"Stamina"},5,"-","/ev",{"temp=":"Stamina","re":true},"ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^You find some stable footting on the side of the cliff and decide to may be able to climb down safely. You move carfully only changing your grip when you know its safe. The cuts in your hands start burning, in a laps of focus you let go and fall back on the sand. You feel the impact rattle every bone in your body. You get up in serious pain. ",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^Stamina = Stamina - 10",{"->":".^.^.11"},null],"#f":5}],{"->":".^.^.^.18"},null]}],"nop","^","\n",{"->":"shore"},{"#f":7}],"c-1":["^ You walk along the edge of the cliff looking for a safer point to get onto the  beach. You walk along the coast for what seems like forever until the ledge drops to a safe distance down. You eventually find yourself farther from the boat than ever before. It takes you a very long time to get close.","\n","^You are very tired but safe.","\n","ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"long_walk","re":true},{"->":"shore"},{"#f":7}],"c-2":["^ There is no time, you know your cousin is down there! You hastily jump of the ledge, hoping the soft sand will cushion your fall. You nearly land on your feet, but collapse to the floor when you land. You feel a serious pain in your leg, its best to keep off of it the rest of the journey.","\n","ev",{"VAR?":"Stamina"},10,"-","/ev",{"temp=":"Stamina","re":true},"ev",1,"/ev",{"temp=":"hurt_leg","re":true},{"->":"shore"},{"#f":7}]}],{"#f":3}],"#f":3}],"shore":[{"->":".^.intro"},{"intro":["^Walking upon the sandy shore, you see the rotting old boat up ahead and remember spending time at the beach with your foster parents. You see a cliff jutting out over the waterline and swear you can hear something over the sound of waves. Pebbles line the shore made smooth my the waves washing over them. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Skip a stone","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Take a break","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Walk to the boat","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Examine boat","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Examine water","/str","/ev",{"*":".^.c-4","flg":20},{"c-0":["^ You take a moment to just skip some rocks like you used to do with your dad. This whole ordeal has been so scary and you just now realize how much you wish they were there with you. ","ev",{"VAR?":"fucked_hands"},"/ev",[{"->":".^.b","c":true},{"b":["^ The salt water from the pebble stings your hands.",{"->":".^.^.^.5"},null]}],"nop","\n","^You start to feel a little better after a while and head over to the boat.","\n","ev",{"VAR?":"Stamina"},10,"+","/ev",{"temp=":"Stamina","re":true},{"->":"cave"},{"#f":7}],"c-1":["^ You sit at the shore and watch the waves crash on to the sand. You regain some strength from your long journey.","\n","ev",{"VAR?":"long_walk"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",["ev","visit",1,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"nop",{"s0":["pop","^Stamina = Stamina + 5",{"->":".^.^.11"},null],"#f":5}],{"->":".^.^.^.6"},null]}],"nop","^","\n","ev",{"VAR?":"Stamina"},5,"+","/ev",{"temp=":"Stamina","re":true},{"->":"cave"},{"#f":7}],"c-2":["^ ",{"->":"cave"},"\n",{"#f":7}],"c-3":["^ This rickety boat is probably missing more planks than it still has left, you’re not sure how its still standing. The mildewy flag swaying in the lake breeze. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-4":["^ The water seems to be rushing to shore harder than usual. In the distance, you can see waves continously crashing into each other. ",{"->":".^.^.^"},"\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"shack":[{"->":".^.intro"},{"intro":["^As you enter the dusty, grimy shack you instantly understand why your new parents want you to clean your room so often. Apart from the rusting bedframe and what might once have been food on a desk, you see a pile of rope in fairly good condition on top of a shelf. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Examine bed","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Examine desk","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Examine shelf","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ The bed sits under a thick layer of dust, still made. You can’t tell the last time someone used it, but you’re betting it wasn’t last night. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-1":["^ On top of the desk you see the mottled old remains of a sketch of an man with a thick beard. Maybe a self portrait? ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ The shelf seems to be almost twice your height, you wonder why the shack’s owner put it so high. You see a pair of boots. ",{"->":".^.^.^"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"global decl":["ev",100,{"VAR=":"Stamina"},0,{"VAR=":"hurt_leg"},0,{"VAR=":"long_walk"},0,{"VAR=":"fucked_hands"},0,{"VAR=":"Gone_forth"},"/ev","end",null],"#f":3}],"listDefs":{}}