{"inkVersion":18,"root":[["^NORTH","\n","^You know your cousin's hide out is nearby. Hes been gone for so long its starting to scare you. You really hope hes in there.","\n",{"->":"trails"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"trails":[{"->":".^.intro"},{"intro":["^The further north you go, the hillier it gets, the more your ankles hate you. Underbrush and vegetation become more common the further you go. In the distance, you can see the briny shore. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^GO NORTH","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^GO EAST","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^GO SOUTH","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^GO WEST","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"snowyHilltop1"},"\n",{"#f":7}],"c-1":["^ ",{"->":"shore"},"\n",{"#f":7}],"c-2":["^ There is no going back. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-3":["^ ",{"->":"cave"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"cave":[{"->":".^.intro"},{"intro":["^You wander down the shoreline until you find a cove just as your cousin described it. You would try and enter but a massive eagle has nested right near the entrance, its nest made from ripped apart branches and rotten wooden planks. It stares at you menacing, waiting for you to make a move. ",{"->":"cave.main"},"\n",{"#f":3}],"main":[["ev","str","^GO EAST","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ENTER CAVE","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^THROW ROCK AT EAGLE","/str",{"VAR?":"has_rock"},"/ev",{"*":".^.c-2","flg":21},"ev","str","^SWING STICK","/str",{"VAR?":"has_stick"},"/ev",{"*":".^.c-3","flg":21},"ev","str","^Blow horn","/str",{"VAR?":"has_horn"},"/ev",{"*":".^.c-4","flg":21},{"c-0":["^ ",{"->":"trails"},"\n",{"#f":7}],"c-1":["\n","ev",{"VAR?":"eagle_here"},"/ev",[{"->":".^.b","c":true},{"b":["^ You approach the entrance slowly, carefully eyeing the eagle. As soon as you get close it flaps its wings and brandishes its sharp talons. You wont be getting in with it there. ",{"->":"cave.main"},{"->":".^.^.^.5"},null]}],"nop","\n","^You are in. ","end","\n",{"#f":7}],"c-2":["^ You chuck your rock near the eagle, hoping that will scare it. Yor are shocked when it actually hits and even more shocked when does not react. It just sits there staring at you, as if it wants something. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-3":["^ The more you look at the creature, the more it scares you. Its eyes pierce right through you, you dont know what it wants. You just want it to go away you swing the stick towards the eagle hoping it would at least flinch. It does not. You are running out of options. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-4":["^ You take a long and deep breath and blow the horn desperately. Its loud, low tone seems to ring throughout the seaside. There is a long pause. Then, the eagle screaches in return, flaps its winds, and launches out towards you. You duck just in time but one of its talons digs into your shoulder. You remain folded over in fear for a whilem until you realize the eagle is gone leaving only a feather behind. You take it, as a reminder and enter the cave.","\n","ev",0,"/ev",{"temp=":"has_horn","re":true},"ev",1,"/ev",{"temp=":"has_feather","re":true},"end",{"#f":7}]}],{"#f":3}],"#f":3}],"snowyHilltop1":[{"->":".^.intro"},{"intro":["^More and more frozen vegetation crunches under your foot. A dense patch of thorns blocks the path ahead. Next to you is an old decaying tree. Its branches, large and grey, swing precariously in the wind as if the whole thing was ready to fall apart. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^GO NORTH","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^GO SOUTH","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine tree","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Take branch","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Knock down branch","/str",{"VAR?":"has_rock"},"/ev",{"*":".^.c-4","flg":21},{"c-0":["^ ","\n","ev",{"VAR?":"wearing_boots"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You take a step onto the bushes and a thorn drives right through your shoe and into the sole of your foot. You stumble back and pull it out. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.7"},null]}],"nop","\n","^You start to wade through the bushes. The boots protect the soles of your feet but every step you take drives more thorns into your legs and waist. Eventually you make it to the tree line.","\n",{"->":"cliff"},{"#f":7}],"c-1":["^ ",{"->":"trails"},"\n",{"#f":7}],"c-2":["^ The tree seems to be withering right in front of you. You can hear it creak and crack in the wind. Its branches are long and thin ready to snap off at any moment.","\n",{"->":".^.^.^"},{"#f":7}],"c-3":["^ You can reach any of the branches and climbing the tree seems just as dangerous for it as it would be for you. Its best not to stand under it like this something might just fall on you.","\n",{"->":".^.^.^"},{"#f":7}],"c-4":["^ You chuck a rock at one of the branches. You hear the rock hit with a crunch and a branch almost as tall as you falls to your feet.","\n","ev",1,"/ev",{"temp=":"has_stick","re":true},"ev",0,"/ev",{"temp=":"has_rock","re":true},{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"cliff":[{"->":".^.intro"},{"intro":["^You exit the brambles unto a sheer cliff over looking the chaoic sea. At the ledge lies a pure white horn decarated with metal orniments. The cold bites at your face as the ocean roars below you. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^GO SOUTH","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine horn","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Get horn","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"snowyHilltop1"},"\n",{"#f":7}],"c-1":["^ It is some kind of animal part fassioned into a horn. It seems to be in pristine condition despite looking as if it was left here by vikings.",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ You walk toward the edge of the cliff to grab the horn. The winds tug at you harder the closer you get to the raging sea. Just a little bit closer. You bend over to pick it up and a blast of air throws you off balance. You stumble forward and a heart stops. You regain you balance at the last minute, but at least you got the horn.  ","\n","ev",1,"/ev",{"temp=":"has_horn","re":true},{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"shore":[{"->":".^.intro"},{"intro":[{"#":"k_shore"},"^Walking upon the sandy shore, you see a rotting old shack and remember spending time at the beach with your foster parents. You see a cliff jutting out over the waterline and swear you can hear something over the sound of waves. Pebbles line the shore made smooth my the waves washing over them. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^Take a pebble","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^GO WEST","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^GO INTO SHACK","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Examine shack","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Examine water","/str","/ev",{"*":".^.c-4","flg":20},{"c-0":["^ You take one of the many pebbles. Its cold to the touch so you drop it in your pocket quickly. ","\n","ev",1,"/ev",{"temp=":"has_rock","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ ",{"->":"trails"},"\n",{"#f":7}],"c-2":["^ ",{"->":"shack"},"\n",{"#f":7}],"c-3":["^ This wooden shack is probably missing more planks than it still has left, you’re not sure how its still standing. The mildewy door swaying in the lake breeze. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-4":["^ The water seems to be rushing to shore harder than usual. In the distance, you can see waves continously crashing into each other. ",{"->":".^.^.^"},"\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"shack":[{"->":".^.intro"},{"intro":["^As you enter the dusty, grimy shack you instantly understand why your new parents want you to clean your room so often. Apart from the rusting bedframe and what might once have been food on a desk, you see a pile of rope in fairly good condition on top of a shelf. ",{"->":".^.^.main"},"\n",{"#f":3}],"main":[["ev","str","^GO OUT","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine bed","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Examine desk","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Examine shelf","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Examine boots","/str",{"VAR?":"has_stick"},"!","/ev",{"*":".^.c-4","flg":21},"ev","str","^Take boots","/str",{"VAR?":"has_stick"},"!","/ev",{"*":".^.c-5","flg":5},"ev","str","^Use stick on shelf","/str",{"VAR?":"has_stick"},"/ev",{"*":".^.c-6","flg":21},{"c-0":["^ ",{"->":"shore"},"\n",{"#f":7}],"c-1":["^ The bed sits under a thick layer of dust, still made. You can’t tell the last time someone used it, but you’re betting it wasn’t last night. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["^ On top of the desk you see the mottled old remains of a sketch of an man with a thick beard. Maybe a self portrait? ",{"->":".^.^.^"},"\n",{"#f":7}],"c-3":["^ The shelf seems to be almost twice your height, you wonder why the shack’s owner put it so high. You see a pair of boots. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-4":["^ Lined with fur and blackened with age, they seem to high to reach. They are problably too big for you, but that doesn't mean they won't be useful. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-5":["^ The shelf is too high for you to reach. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-6":["^ You knock over the boots, picking up the pair and putting them on. You feet slide around inside, but these will keep them nice and safe.","\n","ev",0,"/ev",{"temp=":"has_stick","re":true},"ev",1,"/ev",{"temp=":"wearing_boots","re":true},{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"global decl":["ev",1,{"VAR=":"eagle_here"},0,{"VAR=":"wearing_boots"},0,{"VAR=":"has_stick"},0,{"VAR=":"has_rock"},0,{"VAR=":"has_horn"},0,{"VAR=":"boat_docked"},0,{"VAR=":"has_feather"},"/ev","end",null],"#f":3}],"listDefs":{}}