{"inkVersion":18,"root":[[{"->":"west"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"west":["^You have been told to milk a cow. You don't even know how to milk a cow, but Grandpa seemed angry at you so its best to go do it. The fields around you feel quiet and empty.","\n",{"->":"lady"},{"#f":3}],"lady":[{"->":".^.intro"},{"intro":["^You can still see Grandpa and Audi talking through the window. Everyonce in a while, he will glance over at you and give you a look you don't understand. With the barn behind you, the horizon is comprised  of  and the smell of manure drifting through the air.","\n",{"->":"lady.main"},{"#f":3}],"main":[["ev","str","^Examine Grandpa","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine Audi","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go to pasture","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Show Grandpa","/str",{"VAR?":"milk"},2,">","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ He feels like a stranger you now. You've only know him for a couple days and he already hates you. Why? What did you do? He changed so quickly, it really scared you. Now you have to milk a cow? You don't even know how to milk a cow You need to be looking for Kari but you're too scared to tell him that.  ","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^ You would talk to her but you don't want get close to Grandpa right now. No one here will help. Your parents are gone, your friends are miles away, your Grandpa refuses to talk to you, and you cousin has dissapeared. You feel so alone.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ You head towards the cow smell reluctantly. You don't want to do this, your stomach churns at the thought of what you have to do. ","\n",{"->":"pasture"},{"#f":7}],"c-3":["^ You knock on the door and show grandpa the bucket of milk. He looks at you and looks at the bucket and snarls. ","\n","^:Grandpa: \"What is this? You call this milk? You are useless! Just like the rest of them, useless burdens on our town! Look at this, its pink! How dare you hurt those cows with your stupid city boy hands. Did you even strip them? Are you trying to make me sick?\"","\n","^You stammer trying to find a response but you're too scared. You don't know what hes capable of. You don't want him to hurt you.","\n","^:Grandpa: \"Useless, stupid boy! I'll show you how someone of my blood should milk a cow.\"","\n","^He pulls you by the ear and you yelp in pain. He does not let go. You can feel the blood course through your veins. You are terrified. You have trouble breathing and your eyesight is getting blurry.","\n","^By the time you reach the barn tears stream down your face. You feel light headed. He continues to yell at you, but this time its mostly in icelandic. He shoves you too the ground picks, you up by the collar, and pushes you toward a cow. You panic, you feel trapped with no one to help you. You feel like blacking out.","\n","^:Grandpa: \"You want to be a real man of iceland use this!\" He pulls out a hideous creature out of a nearby crate. It looks like a long, hairy snake made of wrapped in old, crusty fur. On its two ends are wrinkled and swolen screaming faces. Their lips are cracked and swolen, its mouth gaping wide. Grandpa wiggles it around infront of you and you see its beady eyes glazed over with puss. You scream and Grandpa laughs.","\n","^:Grandpa: \"Whats the matter? You've never seen the Tilberi before? What have you parents been teaching you? This is our culture! This is how we use to milk the cows! You coward, children here are raised properly, to not fear such silly things.\"","\n","^He shoves the Tilberi in your hands and you panic. You don't know whats real and whats fake any more. You breath heavily, unable to tell if hes joking or not.","\n",{"->":"dadEnter"},{"#f":7}]}],{"#f":3}],"#f":3}],"pasture":[{"->":".^.intro"},{"intro":["^You stop at foot of some rolling hills. You are astonished by the size of this farm. You see cows roming all around lazily chewing grass. Speckled bushes sprout wildly along the field to your right.","\n",{"->":".^.^.main"},{"#f":3}],"main":[["ev","str","^Examine bushes","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine cow","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go forward","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Go right","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"pasture.bushes"},"\n",{"#f":7}],"c-1":["^ ","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture.cow1"},{"->":".^.^.^.6"},null]}],"nop","^","\n","^you don't feel like your ready to do that yet.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ ",{"->":"pasture2"},"\n",{"#f":7}],"c-3":["^ ",{"->":"pasture3"},"\n",{"#f":7}]}],{"#f":3}],"bushes":[["^You look at the bushes and find brightly colored berries hanging from the branches.","\n","ev","str","^Eat Berries","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Put Berries in Pocket","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Step Away","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ You shove some berries in your mouth. Their sweet taste make you feel a little better and they make you feel light headed.","\n","ev",{"VAR?":"stamina"},10,"+",{"temp=":"stamina","re":true},"/ev",{"->":"pasture.main"},{"#f":7}],"c-1":["^ You pocket some berries later, they have to be here for a reason. ","\n","ev",1,"/ev",{"temp=":"hasBerries","re":true},{"->":"pasture.main"},{"#f":7}],"c-2":["^ You remind yourself of the task at hand and decide to move on. ","\n",{"->":"pasture.main"},{"#f":7}]}],{"#f":3}],"cow1":[["^You feel the body heat of the cow on your skin. It exhales loudly once you crouch down. You seem more nervous than it does.","\n","ev","str","^Pet the Cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Scratch Behind Its Ears","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Milk Cow","/str",{"VAR?":"cow1milked"},"!","/ev",{"*":".^.c-2","flg":5},{"c-0":["\n","^Your hands tremble a little bit as you pet the cow. You have never seen an animal of this size in person before. This whole trip has been a stark change from your New York home leaving you nervous and uncomphotable. The cow, on the other hand, seems at ease even going so far as to move closer to you.","\n","ev",1,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ ","\n","^You try scratching behind her ears, like a dog. It snorts furiously and trashs her head angrily. This scares you even more. You don't know how to approach these animals. If you can't even soothe them properly, how are you going to milk them?","\n","ev",{"VAR?":"stamina"},5,"-",{"temp=":"stamina","re":true},"/ev","ev",0,"/ev",{"temp=":"cow1Soothed","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","out","/ev","^ ~milk += 1","\n","ev",{"VAR?":"cow1Soothed"},{"VAR?":"hasBucket"},"&&","out","/ev","^ ~cow1milked = true","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow1Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You pull out the bucket, sit down, and stare at the udders. You don't like how they feel in your hands. They're fleshy, moist, and warm to the touch. You feel sick everytime to squeeze them. You try not to gag while the bucket fills. ",{"->":"pasture.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow1Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You reach down and the cow stops her foot. You are scared to go any further. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.37"},null]}],"nop","\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture2":[{"->":".^.intro"},{"intro":["^Audi's property goes on for what seemes like miles. You have yet to even see a fence any where. The cows seem to just wonder where they please.","\n",{"->":".^.^.main"},{"#f":3}],"main":[["ev","str","^Examine sky","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine cow","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ","\n","^The clouds are thin, as if they were smeared across the sky. It looks like its getting late, you are cold, you want to go home.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["^ ","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture2.cow2"},{"->":".^.^.^.6"},null]}],"nop","^","\n","^you don't feel like your ready to do that yet.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow2":[["^You see the cow intermintatly rustle through the bushes looking for something. It immediately stops and stares at you when you approach.","\n","ev","str","^Give The Cow What It Wants","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Milk Cow","/str",{"VAR?":"cow2milked"},"!","/ev",{"*":".^.c-1","flg":5},{"c-0":["\n","ev",{"VAR?":"hasBerries"},"/ev",[{"->":".^.b","c":true},{"b":["^ You take some berries out of your pocket to feed the cow some berries. You feel its tounge brush up against your hand as it takes them. It nuzzles your hand once it finishes chewing.",{"->":".^.^.^.5"},null]}],"nop","\n","ev",{"VAR?":"hasBerries"},"out","/ev","^ ~ cow2Soothed = true","\n","ev",{"VAR?":"hasBerries"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ you don't know what you can do.",{"->":".^.^.^.18"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"cow2Soothed"},{"VAR?":"hasBucket"},"&&","out","/ev","^ ~cow2milked = true","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","out","/ev","^ ~milk += 1","\n","ev",{"VAR?":"hasBucket"},{"VAR?":"cow2Soothed"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ You tug on the udders hoping to get this over with as soon as possible. The cow cries out in pain and knocks you to the ground when you get up you see the bucket contains drops of blood. ",{"->":"pasture2.main"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"cow2Soothed"},"!","out","/ev","^ ~stamina -= 5","\n","ev",{"VAR?":"cow2Soothed"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You get closer and the cow squeals and stomps off angrily, stepping on your foot on the way out. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.44"},null]}],"nop","\n",{"#f":7}]}],{"#f":3}],"#f":3}],"pasture3":[{"->":".^.intro"},{"intro":["^Your feet start to hurt again. You haven't really had a chance to fully recover from yesterday. Everything is moving so fast but it feels like you have made so little progress in finding your cousin.","\n",{"->":".^.^.main"},{"#f":3}],"main":[["ev","str","^Examine bucket","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Examine cow","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ","\n","^You see a metal bucket just lying on the floor. It is dented all over and a little dirty but it should do the trick.","\n","ev",1,"/ev",{"temp=":"hasBucket","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["^ ","\n","ev",{"VAR?":"hasBucket"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"pasture3.cow3"},{"->":".^.^.^.6"},null]}],"nop","^","\n","^you don't feel like your ready to do that yet.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":["^ ",{"->":"pasture"},"\n",{"#f":7}]}],{"#f":3}],"cow3":[["^This cow fidgets constantly, sparaticly swatting its tail and kicking its feet.","\n","ev","str","^Talk to the cow","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Milk Cow","/str",{"VAR?":"cow3milked"},"!","/ev",{"*":".^.c-1","flg":5},{"c-0":["\n","^You apologize for what you are about to do. You don't want to hurt it and your not here by choice. It seems to stop kicking and stay still.","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"hasBucket"},"out","/ev","^ ~cow1milked = true","\n","ev",{"VAR?":"hasBucket"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You are not prepared to do that right now. ",{"->":".^.^.^.^.^"},{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"pasture3.cowtail"},{"#f":7}]}],{"#f":3}],"cowtail":[["^You sit down to milk the cow and the cow turns away. You try to move with it being careful of its feet. Once you finally settle it down, a tail swats you in the face. Like clockwork, the cow slaps you in the face with its tail. You move around hoping to get out of its reach but the cow moves with you. You start to get angry.","\n","ev","str","^swat the tail away","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ignore it","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You get frustrated and slap the tail out of your face. This startles the cow and it kicks its hind legs. They narrowly miss you. But if it hadn't you would have been seriously injured. You hastily squeeze the milk you need ignoring every swat in the face.","\n","ev",{"VAR?":"stamina"},10,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev",{"->":"pasture3.main"},{"#f":7}],"c-1":["^ As best you can you try to ignore the tail in your face. Its hairs are coarse scratching up your face, getting in your eyes and mouth. Your face itches after every hit and you start to notice how bad this cow smells. You can hardly see, sometimes your hands jerk in reaction and milk sprays all over you. Despite this you get your milk even if most of it ended up on you. ","\n","ev",{"VAR?":"stamina"},10,"-",{"temp=":"stamina","re":true},"/ev","ev",{"VAR?":"milk"},1,"+",{"temp=":"milk","re":true},"/ev","^_ ",{"->":"pasture3.main"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"dadEnter":["^Just then the door of your barn busts open. Its your dad, you run towards him.","\n","end","^0","\n",{"#f":3}],"global decl":["ev",0,{"VAR=":"hasBerries"},100,{"VAR=":"stamina"},0,{"VAR=":"hasBucket"},0,{"VAR=":"cow1Soothed"},0,{"VAR=":"milk"},0,{"VAR=":"cow2Soothed"},0,{"VAR=":"cow3Soothed"},0,{"VAR=":"cow1milked"},0,{"VAR=":"cow2milked"},0,{"VAR=":"cow3milked"},"/ev","end",null],"#f":3}],"listDefs":{}}